[
  {
    "surah": 26,
    "ayat": 69,
    "terjemahan": "Dan bacakanlah pula kepada mereka perihal Nabi Ibrahim."
  },
  {
    "surah": 26,
    "ayat": 70,
    "terjemahan": "Ketika ia berkata kepada bapanya dan kaumnya: \"Apa yang kamu sembah?\""
  },
  {
    "surah": 26,
    "ayat": 71,
    "terjemahan": "Mereka menjawab: \"Kami menyembah berhala-berhala, maka (kerana memuliakannya) kami berkekalan menyembahnya\"."
  },
  {
    "surah": 26,
    "ayat": 72,
    "terjemahan": "Nabi Ibrahim bertanya: \"Adakah berhala-berhala itu mendengar kamu semasa kamu menyerunya?"
  },
  {
    "surah": 26,
    "ayat": 73,
    "terjemahan": "\"Atau mereka dapat memberikan sesuatu yang ada manfaatnya kepada kamu ataupun menimpakan sesuatu bahaya?\""
  },
  {
    "surah": 26,
    "ayat": 74,
    "terjemahan": "Mereka menjawab: \"(Tidak satupun!) Bahkan kami dapati datuk nenek kami berbuat demikian\"."
  },
  {
    "surah": 26,
    "ayat": 75,
    "terjemahan": "Nabi Ibrahim berkata: \"Sudahkah kamu berfikir sehingga nampak gunanya benda-benda yang kamu sembah itu? -"
  },
  {
    "surah": 26,
    "ayat": 76,
    "terjemahan": "\"(Yang sekian lama disembah oleh) kamu dan datuk nenek kamu yang dahulu?"
  },
  {
    "surah": 26,
    "ayat": 77,
    "terjemahan": "\"(Aku bertanya demikian) kerana sesungguhnya berhala-berhala itu ialah musuhKu, (aku tidak menyembah) melainkan Allah Tuhan sekalian alam;"
  },
  {
    "surah": 26,
    "ayat": 78,
    "terjemahan": "\"Tuhan yang menciptakan daku (dari tiada kepada ada), maka Dia lah yang memimpin dan memberi petunjuk kepadaku;"
  },
  {
    "surah": 26,
    "ayat": 79,
    "terjemahan": "\"Dan Tuhan yang Dia lah jua memberiku makan dan memberi minum,"
  },
  {
    "surah": 26,
    "ayat": 80,
    "terjemahan": "\"Dan apabila aku sakit, maka Dia lah yang menyembuhkan penyakitku;"
  },
  {
    "surah": 26,
    "ayat": 81,
    "terjemahan": "\"Dan (Dia lah) yang mematikan daku, kemudian Ia menghidupkan daku;"
  },
  {
    "surah": 26,
    "ayat": 82,
    "terjemahan": "\"Dan (Dia lah) yang aku harap-harapkan supaya mengampunkan dosaku pada hari kiamat;"
  },
  {
    "surah": 26,
    "ayat": 83,
    "terjemahan": "\"Wahai Tuhanku, berikanlah daku ilmu pengetahuan ugama, dan hubungkanlah daku dengan orang-orang yang soleh;"
  },
  {
    "surah": 26,
    "ayat": 84,
    "terjemahan": "\"Dan jadikanlah bagiku sebutan yang baik (nama yang harum) dalam kalangan orang-orang yang datang kemudian;"
  },
  {
    "surah": 26,
    "ayat": 85,
    "terjemahan": "\"Dan jadikanlah daku dari orang-orang yang mewarisi Syurga Jannatun-Naiim;"
  },
  {
    "surah": 26,
    "ayat": 86,
    "terjemahan": "\"Dan ampunkanlah bagi bapaku, kerana sesungguhnya ia adalah dari orang-orang yang sesat;"
  },
  {
    "surah": 26,
    "ayat": 87,
    "terjemahan": "\"Dan janganlah engkau hinakan daku pada hari makhluk-makhluk dibangkitkan hidup semula -"
  },
  {
    "surah": 26,
    "ayat": 88,
    "terjemahan": "\"Hari yang padanya harta benda dan anak-pinak tidak dapat memberikan pertolongan sesuatu apapun,"
  },
  {
    "surah": 26,
    "ayat": 89,
    "terjemahan": "\"Kecuali (harta benda dan anak-pinak) orang-orang yang datang mengadap Allah dengan hati yang selamat sejahtera (dari syirik dan penyakit munafik);"
  },
  {
    "surah": 26,
    "ayat": 90,
    "terjemahan": "\"Dan (pada hari itu) didekatkan Syurga bagi orang-orang yang bertaqwa,"
  },
  {
    "surah": 26,
    "ayat": 91,
    "terjemahan": "\"Dan diperlihatkan neraka jelas nyata kepada orang-orang yang sesat;"
  },
  {
    "surah": 26,
    "ayat": 92,
    "terjemahan": "\"Serta dikatakan kepada mereka: ` Mana dia benda-benda yang kamu sembah dahulu -"
  },
  {
    "surah": 26,
    "ayat": 93,
    "terjemahan": "` Selain dari Allah? Dapatkah mereka menolong kamu atau menolong dirinya sendiri ? '"
  },
  {
    "surah": 26,
    "ayat": 94,
    "terjemahan": "\"Lalu mereka dihumbankan ke dalam neraka dengan tertiarap, jatuh bangun berulang-ulang, - mereka dan orang-orang yang sesat bersama,"
  },
  {
    "surah": 26,
    "ayat": 95,
    "terjemahan": "\"Termasuk juga bala tentera iblis semuanya."
  },
  {
    "surah": 26,
    "ayat": 96,
    "terjemahan": "\"Mereka berkata, sambil bertengkar sesama sendiri dalam neraka:"
  },
  {
    "surah": 26,
    "ayat": 97,
    "terjemahan": "\" ` Demi Allah! Sesungguhnya kami (semasa di dunia dahulu) adalah di dalam kesesatan yang jelas nyata,"
  },
  {
    "surah": 26,
    "ayat": 98,
    "terjemahan": "\" ` Kerana kami menyamakan kamu dengan Tuhan sekalian alam;"
  },
  {
    "surah": 26,
    "ayat": 99,
    "terjemahan": "\" ` Dan tiadalah yang menyesatkan kami melainkan golongan yang berdosa."
  },
  {
    "surah": 26,
    "ayat": 100,
    "terjemahan": "\" ` Dengan sebab itu, tiadalah kami beroleh sesiapapun yang memberi pertolongan,"
  },
  {
    "surah": 26,
    "ayat": 101,
    "terjemahan": "\" ` Dan tiadalah juga sahabat karib yang bertimbang rasa."
  },
  {
    "surah": 26,
    "ayat": 102,
    "terjemahan": "\" ` Maka alangkah baiknya kalau kami dapat ke dunia sekali lagi, supaya kami menjadi dari orang-orang yang beriman. ' \""
  },
  {
    "surah": 26,
    "ayat": 103,
    "terjemahan": "Sesungguhnya pada peristiwa yang demikian itu terdapat satu tanda (yang membukitkan keesaan Allah dan kekuasaanNya); dan dalam pada itu, kebanyakan mereka tidak juga mahu beriman."
  },
  {
    "surah": 26,
    "ayat": 104,
    "terjemahan": "Dan sesungguhnya Tuhanmu (wahai Muhammad), Dia lah sahaja Yang Maha Kuasa, lagi Maha mengasihani."
  },
  {
    "surah": 26,
    "ayat": 105,
    "terjemahan": "(Demikian juga) kaum Nabi Nuh telah mendustakan Rasul-rasul (yang diutus kepada mereka.)"
  },
  {
    "surah": 26,
    "ayat": 106,
    "terjemahan": "Ketika saudara mereka - Nabi Nuh, berkata kepada mereka: \" Hendaknya kamu mematuhi suruhan Allah dan menjauhi laranganNya."
  },
  {
    "surah": 26,
    "ayat": 107,
    "terjemahan": "\"Sesungguhnya aku ini ialah Rasul yang amanah, (yang diutus oleh Allah) kepada kamu."
  },
  {
    "surah": 26,
    "ayat": 108,
    "terjemahan": "\" Oleh itu, takutilah kamu akan (kemurkaan) Allah, dan taatlah kepadaku."
  },
  {
    "surah": 26,
    "ayat": 109,
    "terjemahan": "\"Dan aku tidak meminta kepada kamu sebarang upah mengenai apa yang aku sampaikan (dari Tuhanku); balasanku hanyalah terserah kepada Allah Tuhan sekalian alam."
  },
  {
    "surah": 26,
    "ayat": 110,
    "terjemahan": "\"Maka dengan yang demikian, takutilah kamu akan (kemurkaan) Allah, dan taatlah kepadaku\"."
  },
  {
    "surah": 26,
    "ayat": 111,
    "terjemahan": "Mereka menjawab: \"Patutkah kami percaya kepadamu, sedang engkau semata-mata diikut oleh orang-orang yang rendah (pangkatnya dan hina pekerjaannya)?\""
  },
  {
    "surah": 26,
    "ayat": 112,
    "terjemahan": "Nabi Nuh berkata: \"Dan apalah ada kaitannya pengetahuanku dengan (pangkat dan) pekerjaan mereka?"
  },
  {
    "surah": 26,
    "ayat": 113,
    "terjemahan": "\"Sebenarnya hitungan amal mereka hanya terserah kepada Tuhanku; kalaulah kamu menyedari dan memahaminya (kamu tidak berkata demikian)."
  },
  {
    "surah": 26,
    "ayat": 114,
    "terjemahan": "\"Dan aku tidak akan menghalau orang-orang yang beriman (daripada bercampur-gaul denganku)."
  },
  {
    "surah": 26,
    "ayat": 115,
    "terjemahan": "\"Aku ini hanyalah seorang Rasul pemberi amaran yang jelas nyata (kepada semua - tidak kira hina mulia)\"."
  },
  {
    "surah": 26,
    "ayat": 116,
    "terjemahan": "Mereka (mengugut dengan) berkata: \"Jika engkau tidak mahu berhenti (daripada menyiarkan ugamamu itu) wahai Nuh, sudah tentu engkau akan menjadi dari orang-orang yang direjam!\""
  },
  {
    "surah": 26,
    "ayat": 117,
    "terjemahan": "Nabi Nuh berdoa dengan berkata: \"Wahai Tuhanku! Sesungguhnya kaumku telah mendustakan daku."
  },
  {
    "surah": 26,
    "ayat": 118,
    "terjemahan": "\"Oleh itu, hukumkanlah antaraku dengan mereka, dengan hukuman tegas (yang menegakkan yang benar dan melenyapkan yang salah), serta selamatkanlah daku dan orang-orang yang beriman yang bersama-sama denganku\""
  },
  {
    "surah": 26,
    "ayat": 119,
    "terjemahan": "Maka Kami selamatkan dia dan orang-orang yang bersama-sama dengannya dalam bahtera yang penuh sarat (dengan berbagai makhluk)."
  },
  {
    "surah": 26,
    "ayat": 120,
    "terjemahan": "Kemudian daripada itu, Kami tenggelamkan golongan (kafir) yang tinggal (tidak turut bersama dalam bahtera)."
  },
  {
    "surah": 26,
    "ayat": 121,
    "terjemahan": "Sesungguhnya pada peristiwa yang demikian, terdapat satu tanda (yang membuktikan kekuasaan Allah); dan dalam pada itu, kebanyakan mereka tidak juga mahu beriman."
  },
  {
    "surah": 26,
    "ayat": 122,
    "terjemahan": "Dan sesungguhnya Tuhanmu (wahai Muhammad), Dia lah sahaja Yang Maha Kuasa, lagi Maha Mengasihani."
  },
  {
    "surah": 26,
    "ayat": 123,
    "terjemahan": "(Demikian juga) kaum Aad telah mendustakan Rasul-rasul (yang diutus kepada mereka)."
  },
  {
    "surah": 26,
    "ayat": 124,
    "terjemahan": "Ketika saudara mereka - Nabi Hud, berkata kepada mereka: \"Hendaknya kamu mematuhi perintah Allah dan menjauhi laranganNya."
  },
  {
    "surah": 26,
    "ayat": 125,
    "terjemahan": "\"Sesungguhnya aku ini seorang Rasul yang amanah, (yang diutus oleh Allah) kepada kamu."
  },
  {
    "surah": 26,
    "ayat": 126,
    "terjemahan": "\"Oleh itu, takutilah kamu akan (kemurkaan) Allah, dan taatlah kepadaku."
  },
  {
    "surah": 26,
    "ayat": 127,
    "terjemahan": "\"Dan aku tidak meminta kepada kamu sebarang upah mengenai apa yang aku sampaikan (dari Tuhanku); balasanku hanyalah terserah kepada Allah Tuhan sekalian alam."
  },
  {
    "surah": 26,
    "ayat": 128,
    "terjemahan": "\"Patutkah kamu mendirikan pada tiap-tiap tempat yang tinggi bangunan-bangunan yang tersergam, padahal kamu tidak membuatnya dengan sesuatu tujuan yang baik."
  },
  {
    "surah": 26,
    "ayat": 129,
    "terjemahan": "\"Dan kamu pula bersusah payah mendirikan istana-istana dan benteng-benteng yang kukuh dengan harapan hendak kekal hidup selama-lamanya?"
  },
  {
    "surah": 26,
    "ayat": 130,
    "terjemahan": "\"Dan apabila kamu memukul atau menyeksa, kamu melakukan yang demikian dengan kejam bengis?"
  },
  {
    "surah": 26,
    "ayat": 131,
    "terjemahan": "\"Oleh itu, takutilah kamu akan (kemurkaan) Allah dan taatlah kepadaku."
  },
  {
    "surah": 26,
    "ayat": 132,
    "terjemahan": "\"Dan berbaktilah kamu kepada Allah yang telah menolong kamu dengan pemberian nikmat-nikmatNya yang kamu sedia mengetahuinya."
  },
  {
    "surah": 26,
    "ayat": 133,
    "terjemahan": "\"Diberinya kamu binatang-binatang ternak (yang biak) serta anak-pinak (yang ramai),"
  },
  {
    "surah": 26,
    "ayat": 134,
    "terjemahan": "\"Dan taman-taman (yang indah permai) serta matair-matair (yang mengalir)."
  },
  {
    "surah": 26,
    "ayat": 135,
    "terjemahan": "\"Sesungguhnya aku takut, (bahawa) kamu akan ditimpa azab seksa hari yang besar (huru-haranya)\"."
  },
  {
    "surah": 26,
    "ayat": 136,
    "terjemahan": "Mereka menjawab: \"Sama sahaja bagi kami, sama ada engkau beri nasihat pengajaran, atau engkau tidak menjadi dari orang-orang yang memberi nasihat pengajaran."
  },
  {
    "surah": 26,
    "ayat": 137,
    "terjemahan": "\"Segala apa (yang engkau katakan) ini, hanyalah adat kebiasaan orang-orang dahulu-kala,"
  },
  {
    "surah": 26,
    "ayat": 138,
    "terjemahan": "\"Dan kami pula tidak akan diseksa\"."
  },
  {
    "surah": 26,
    "ayat": 139,
    "terjemahan": "Akhirnya mereka mendustakan Rasul itu, lalu Kami binasakan mereka. Sesungguhnya pada peristiwa yang demikian, terdapat satu tanda (yang membuktikan kekuasaan Allah); dan dalam pada itu, kebanyakan mereka tidak juga mahu beriman."
  },
  {
    "surah": 26,
    "ayat": 140,
    "terjemahan": "Dan sesungguhnya Tuhanmu (wahai Muhammad), Dia lah sahaja Yang Maha Kuasa, lagi Maha Mengasihani."
  },
  {
    "surah": 26,
    "ayat": 141,
    "terjemahan": "(Demikian juga) kaum Thamud telah mendustakan Rasul-rasul (yang diutus kepada mereka),"
  },
  {
    "surah": 26,
    "ayat": 142,
    "terjemahan": "Ketika saudara mereka - Nabi Soleh, berkata kepada mereka: \"Hendaknya kamu mematuhi perintah Allah dan menjauhi laranganNya."
  },
  {
    "surah": 26,
    "ayat": 143,
    "terjemahan": "\"Sesungguhnya aku ini Rasul yang amanah, (yang diutus oleh Allah) kepada kamu."
  },
  {
    "surah": 26,
    "ayat": 144,
    "terjemahan": "\"Oleh itu, takutilah kamu akan (kemurkaan) Allah, dan taatlah kepadaku."
  },
  {
    "surah": 26,
    "ayat": 145,
    "terjemahan": "\"Dan aku tidak meminta kepada kamu sebarang upah mengenai apa yang aku sampaikan (dari Tuhanku), balasanku hanyalah terserah kepada Allah Tuhan sekalian alam."
  },
  {
    "surah": 26,
    "ayat": 146,
    "terjemahan": "\"Adakah (kamu fikir), bahawa kamu akan dibiarkan sentiasa bersenang-senang dalam nikmat-nikmat yang ada di dunia ini? -"
  },
  {
    "surah": 26,
    "ayat": 147,
    "terjemahan": "\"Di dalam taman-taman (yang indah permai), dan matair-matair (yang mengalir),"
  },
  {
    "surah": 26,
    "ayat": 148,
    "terjemahan": "\"Dan kebun-kebun tanaman serta pohon-pohon tamar (kurma) yang buah mayangnya halus lembut?"
  },
  {
    "surah": 26,
    "ayat": 149,
    "terjemahan": "\"Dan kamu memahat sebahagian dari gunung-ganang sebagai tempat tinggal - dengan bijak dan bersungguh-sungguh?"
  },
  {
    "surah": 26,
    "ayat": 150,
    "terjemahan": "\"Oleh itu, takutilah kamu akan (kemurkaan) Allah, dan taatlah kepadaku;"
  },
  {
    "surah": 26,
    "ayat": 151,
    "terjemahan": "\"Dan janganlah kamu taati perintah orang-orang yang melampaui batas, -"
  },
  {
    "surah": 26,
    "ayat": 152,
    "terjemahan": "\"Iaitu orang-orang yang melakukan kerosakan di bumi dan tidak membuat kebaikan\"."
  },
  {
    "surah": 26,
    "ayat": 153,
    "terjemahan": "Mereka menjawab: \"Sesungguhnya engkau ini hanyalah salah seorang dari golongan yang kena sihir!"
  },
  {
    "surah": 26,
    "ayat": 154,
    "terjemahan": "\"Engkau hanyalah seorang manusia seperti kami; oleh itu, bawakanlah satu tanda (mukjizat) jika betul engkau dari orang-orang yang benar\"."
  },
  {
    "surah": 26,
    "ayat": 155,
    "terjemahan": "Nabi Soleh berkata: \"Ini adalah seekor unta betina, (di antara cara-cara hidupnya ialah) air kamu hendaklah menjadi bahagian minumnya sehari, dan bahagian kamu sehari, menurut giliran yang tertentu."
  },
  {
    "surah": 26,
    "ayat": 156,
    "terjemahan": "\"Dan janganlah kamu menyentuhnya dengan sesuatu yang menyakitinya; (jika kamu menyakitinya) maka akibatnya kamu akan dibinasakan oleh azab seksa hari yang besar (huru-haranya)\"."
  },
  {
    "surah": 26,
    "ayat": 157,
    "terjemahan": "Akhirnya mereka menikam mati unta itu, kemudian mereka menyesal (setelah melihat kedatangan bala bencana)."
  },
  {
    "surah": 26,
    "ayat": 158,
    "terjemahan": "Lalu mereka ditimpa azab yang membinasakan. Sesungguhnya peristiwa yang demikian mengandungi satu tanda (yang membuktikan kekuasaan Allah); dan dalam pada itu, kebanyakan mereka tidak juga mahu beriman."
  },
  {
    "surah": 26,
    "ayat": 159,
    "terjemahan": "Dan sesungguhnya Tuhanmu (wahai Muhammad), Dia lah sahaja Yang Maha Kuasa, lagi Maha Mengasihani."
  },
  {
    "surah": 26,
    "ayat": 160,
    "terjemahan": "(Demikian juga) kaum Nabi Lut telah mendustakan Rasul-rasul (yang diutus kepada mereka)."
  },
  {
    "surah": 26,
    "ayat": 161,
    "terjemahan": "Ketika saudara mereka - Nabi Lut, berkata kepada mereka: \"Hendaknya kamu mematuhi perintah Allah dan menjauhi laranganNya."
  },
  {
    "surah": 26,
    "ayat": 162,
    "terjemahan": "\"Sesungguhnya aku ini Rasul yang amanah, (yang diutus oleh Allah) kepada kamu."
  },
  {
    "surah": 26,
    "ayat": 163,
    "terjemahan": "\"Oleh itu, takutilah kamu akan (kemurkaan) Allah, dan taatlah kepadaku."
  },
  {
    "surah": 26,
    "ayat": 164,
    "terjemahan": "\"Dan aku tidak meminta kepada kamu sebarang upah mengenai apa yang aku sampaikan (dari Tuhanku); balasanku hanyalah terserah kepada Allah Tuhan sekalian alam."
  },
  {
    "surah": 26,
    "ayat": 165,
    "terjemahan": "\"Patutkah kamu melakukan hubungan jenis dengan lelaki dari kalangan manusia,"
  },
  {
    "surah": 26,
    "ayat": 166,
    "terjemahan": "\"Dan kamu tinggalkan apa yang diciptakan oleh Tuhan kamu untuk kamu (melakukan hubungan yang halal) dari badan isteri-isteri kamu? (Kamu orang-orang yang bersalah) bahkan kamu adalah kaum yang melampaui batas (keinginan kebanyaKan haiwan)!\""
  },
  {
    "surah": 26,
    "ayat": 167,
    "terjemahan": "Mereka menjawab: \"Sesungguhnya jika engkau tidak berhenti wahai Lut (daripada mencaci dan menyalahkan kami), nescaya engkau akan diusir keluar!\""
  },
  {
    "surah": 26,
    "ayat": 168,
    "terjemahan": "Nabi Lut berkata: \"Sesungguhnya aku dari orang-orang yang bencikan perbuatan kamu yang keji itu\"."
  },
  {
    "surah": 26,
    "ayat": 169,
    "terjemahan": "(Nabi Lut berdoa): \"Wahai Tuhanku, selamatkanlah daku dan keluarga serta pengikut-pengikutku dari apa yang dilakukan oleh golongan (yang jahat) itu.\""
  },
  {
    "surah": 26,
    "ayat": 170,
    "terjemahan": "Maka Kami selamatkan dia dan keluarganya serta pengikut-pengikutnya - semuanya"
  },
  {
    "surah": 26,
    "ayat": 171,
    "terjemahan": "Kecuali seorang perempuan tua tertinggal dalam golongan yang kena azab itu."
  },
  {
    "surah": 26,
    "ayat": 172,
    "terjemahan": "Kemudian Kami hancurkan yang lain (yang menentang Nabi Lut)."
  },
  {
    "surah": 26,
    "ayat": 173,
    "terjemahan": "Dan Kami hujani mereka dengan hujan (azab yang membinasakan); maka amatlah buruknya hujan azab yang menimpa kaum yang telah diberi amaran."
  },
  {
    "surah": 26,
    "ayat": 174,
    "terjemahan": "Sesungguhnya peristiwa yang demikian, mengandungi satu tanda (yang membuktikan kekuasaan Allah); dan dalam pada itu, kebanyakan mereka tidak juga mahu beriman."
  },
  {
    "surah": 26,
    "ayat": 175,
    "terjemahan": "Dan sesungguhnya Tuhanmu (wahai Muhammad), Dia lah sahaja yang Maha Kuasa, lagi Maha Mengasihani."
  },
  {
    "surah": 26,
    "ayat": 176,
    "terjemahan": "(Demikian juga) penduduk \"Aikah\" telah mendustakan Rasul-rasul (yang diutus kepada mereka)."
  },
  {
    "surah": 26,
    "ayat": 177,
    "terjemahan": "Ketika Nabi Syuaib berkata kepada mereka: \"Hendaknya kamu mematuhi perintah Allah dan menjauhi laranganNya."
  },
  {
    "surah": 26,
    "ayat": 178,
    "terjemahan": "\"Sesungguhnya aku ini Rasul yang amanah, (yang diutus oleh Allah) kepada kamu."
  },
  {
    "surah": 26,
    "ayat": 179,
    "terjemahan": "\"Oleh itu, takutilah kamu akan (kemurkaan) Allah, dan taatlah kepadaku."
  },
  {
    "surah": 26,
    "ayat": 180,
    "terjemahan": "\"Dan aku tidak meminta kepada kamu sebarang upah mengenai apa yang aku sampaikan (dari Tuhanku); balasanku hanyalah terserah kepada Allah Tuhan sekalian alam."
  },
  {
    "surah": 26,
    "ayat": 181,
    "terjemahan": "\"Hendaklah kamu menyempurnakan sukatan cupak-gantang, dan janganlah kamu menjadi golongan yang merugikan orang lain."
  },
  {
    "surah": 26,
    "ayat": 182,
    "terjemahan": "\"Dan timbanglah dengan neraca yang betul timbangannya."
  },
  {
    "surah": 26,
    "ayat": 183,
    "terjemahan": "\"Dan janganlah kamu mengurangi hak-hak orang ramai, dan janganlah kamu bermaharajalela melakukan kerosakan di bumi."
  },
  {
    "surah": 26,
    "ayat": 184,
    "terjemahan": "\"Dan (sebaliknya) berbaktilah kepada Allah yang telah menciptakan kamu dan umat-umat yang telah lalu\"."
  },
  {
    "surah": 26,
    "ayat": 185,
    "terjemahan": "Mereka menjawab: \"Sesungguhnya engkau ini (hai Syuaib) hanyalah salah seorang dari golongan yang kena sihir."
  },
  {
    "surah": 26,
    "ayat": 186,
    "terjemahan": "\"Dan engkau hanyalah seorang manusia seperti kami; dan sesungguhnya kami fikir engkau ini dari orang-orang yang dusta."
  },
  {
    "surah": 26,
    "ayat": 187,
    "terjemahan": "Oleh itu, gugurkanlah atas kami ketul-ketul (yang membinasakan) dari langit, jika betul engkau dari orang-orang yang benar!\""
  },
  {
    "surah": 26,
    "ayat": 188,
    "terjemahan": "Nabi Syuaib berkata: \"Tuhanku lebih mengetahui akan apa yang kamu lakukan\"."
  },
  {
    "surah": 26,
    "ayat": 189,
    "terjemahan": "Maka mereka tetap juga mendustakannya, lalu mereka ditimpa azab seksa hari awan mendung; sesungguhnya kejadian itu adalah merupakan azab seksa hari yang amat besar - (huru-haranya)."
  },
  {
    "surah": 26,
    "ayat": 190,
    "terjemahan": "Sesungguhnya peristiwa yang demikian, mengandungi satu tanda (yang membuktikan kekuasaan Allah); dan dalam pada itu, kebanyakan mereka tidak juga mahu beriman."
  },
  {
    "surah": 26,
    "ayat": 191,
    "terjemahan": "Dan sesungguhnya Tuhanmu (wahai Muhammad), Dia lah sahaja yang Maha Kuasa, lagi Maha Mengasihani."
  },
  {
    "surah": 26,
    "ayat": 192,
    "terjemahan": "Dan sesungguhnya Al-Quran (yang di antara isinya kisah-kisah yang tersebut) adalah diturunkan oleh Allah Tuhan sekalian alam."
  },
  {
    "surah": 26,
    "ayat": 193,
    "terjemahan": "Ia dibawa turun oleh malaikat Jibril yang amanah."
  },
  {
    "surah": 26,
    "ayat": 194,
    "terjemahan": "Ke dalam hatimu, supaya engkau (wahai Muhammad) menjadi seorang dari pemberi-pemberi ajaran dan amaran (kepada umat manusia)."
  },
  {
    "surah": 26,
    "ayat": 195,
    "terjemahan": "(Ia diturunkan) dengan bahasa Arab yang fasih serta terang nyata."
  },
  {
    "surah": 26,
    "ayat": 196,
    "terjemahan": "Dan sesungguhnya Al-Quran (tersebut juga perihalnya dan sebahagian dari pengajaran-pengajarannya) di dalam Kitab-kitab ugama orang-orang yang telah lalu."
  },
  {
    "surah": 26,
    "ayat": 197,
    "terjemahan": "(Tidakkah mereka yang musyrik sedarkan kebenaran itu) dan tidakkah menjadi satu keterangan kepada mereka bahawa pendita-pendita ugama Bani lsrail mengetahui akan kebenaran Al-Quran itu?"
  },
  {
    "surah": 26,
    "ayat": 198,
    "terjemahan": "Dan sekiranya Kami turunkan Al-Quran kepada setengah orang yang bukan Arab, yang tidak tahu membaca Arab,"
  },
  {
    "surah": 26,
    "ayat": 199,
    "terjemahan": "Kemudian ia (dikurniakan Tuhan dapat) membacakannya kepada mereka, mereka tetap juga tidak mahu percayakan bacaan itu daripada Tuhan."
  },
  {
    "surah": 26,
    "ayat": 200,
    "terjemahan": "Demikianlah Kami masukkan perasaan (kufur ingkar) itu ke dalam hati orang-orang yang melakukan dosa - tidak percayakan Al-Quran."
  },
  {
    "surah": 26,
    "ayat": 201,
    "terjemahan": "Mereka tidak beriman kepada Al-Quran sehingga mereka melihat azab yang tidak terperi sakitnya,"
  },
  {
    "surah": 26,
    "ayat": 202,
    "terjemahan": "Lalu azab itu datang menimpa mereka secara mengejut, dengan tidak mereka menyedarinya."
  },
  {
    "surah": 26,
    "ayat": 203,
    "terjemahan": "Maka (pada saat itu) mereka akan berkata (dengan menyesal): \"Dapatkah kiranya kami diberi tempoh?\""
  },
  {
    "surah": 26,
    "ayat": 204,
    "terjemahan": "(Kalaulah demikian keadaan mereka) maka patutkah mereka meminta disegerakan azab Kami?"
  },
  {
    "surah": 26,
    "ayat": 205,
    "terjemahan": "Bagaimana fikiranmu (wahai Muhammad)? Jika Kami berikan mereka menikmati kesenangan bertahun-tahun,"
  },
  {
    "surah": 26,
    "ayat": 206,
    "terjemahan": "Kemudian mereka didatangi azab seksa yang dijanjikan kepada mereka,"
  },
  {
    "surah": 26,
    "ayat": 207,
    "terjemahan": "(Tentulah) kesenangan yang mereka nikmati bertahun-tahun itu tidak dapat memberikan mereka sebarang pertolongan."
  },
  {
    "surah": 26,
    "ayat": 208,
    "terjemahan": "Dan tiadalah Kami membinasakan mana-mana negeri (yang telah dibinasakan itu), melainkan setelah diutus kepadanya lebih dahulu, Rasul-rasul pemberi amaran."
  },
  {
    "surah": 26,
    "ayat": 209,
    "terjemahan": "Memperingatkan mereka; dan Kami tidak sekali-kali berlaku zalim."
  },
  {
    "surah": 26,
    "ayat": 210,
    "terjemahan": "Dan Al-Quran itu pula tidak sekali-kali dibawa turun oleh Syaitan-syaitan."
  },
  {
    "surah": 26,
    "ayat": 211,
    "terjemahan": "Dan tidak layak bagi Syaitan-syaitan itu berbuat demikian, dan mereka juga tidak akan dapat melakukannya."
  },
  {
    "surah": 26,
    "ayat": 212,
    "terjemahan": "Sesungguhnya mereka dihalang sama sekali daripada mendengar wahyu yang dibawa oleh Malaikat."
  },
  {
    "surah": 26,
    "ayat": 213,
    "terjemahan": "Maka janganlah engkau (wahai Muhammad) menyembah tuhan yang lain bersama-sama Allah, akibatnya engkau akan menjadi dari golongan yang dikenakan azab seksa."
  },
  {
    "surah": 26,
    "ayat": 214,
    "terjemahan": "Dan berilah peringatan serta amaran kepada kaum kerabatmu yang dekat."
  },
  {
    "surah": 26,
    "ayat": 215,
    "terjemahan": "Dan hendaklah engkau merendah diri kepada pengikut-pengikutmu dari orang-orang yang beriman."
  },
  {
    "surah": 26,
    "ayat": 216,
    "terjemahan": "Kemudian jika mereka berlaku ingkar kepadamu, maka katakanlah: \"Sesungguhnya aku berlepas diri dari apa yang kamu lakukan!\""
  },
  {
    "surah": 26,
    "ayat": 217,
    "terjemahan": "Dan berserahlah kepada Allah Yang Maha Kuasa, lagi Maha Mengasihani,"
  },
  {
    "surah": 26,
    "ayat": 218,
    "terjemahan": "Yang melihatmu semasa engkau berdiri (mengerjakan sembahyang),"
  },
  {
    "surah": 26,
    "ayat": 219,
    "terjemahan": "Dan (melihat) gerak-gerimu di antara orang-orang yang sujud."
  },
  {
    "surah": 26,
    "ayat": 220,
    "terjemahan": "Sesungguhnya Dia lah jua yang Maha Mendengar, lagi Maha Mengetahui."
  },
  {
    "surah": 26,
    "ayat": 221,
    "terjemahan": "Mahukah, Aku khabarkan kepada kamu, kepada siapakah Syaitan-syaitan itu selalu turun?"
  },
  {
    "surah": 26,
    "ayat": 222,
    "terjemahan": "Mereka selalu turun kepada tiap-tiap pendusta yang berdosa,"
  },
  {
    "surah": 26,
    "ayat": 223,
    "terjemahan": "Yang mendengar bersungguh-sungguh (apa yang disampaikan oleh Syaitan-syaitan itu), sedang kebanyakan beritanya adalah dusta."
  },
  {
    "surah": 26,
    "ayat": 224,
    "terjemahan": "Dan Ahli-ahli syair itu, diturut oleh golongan yang sesat - tidak berketentuan hala."
  },
  {
    "surah": 26,
    "ayat": 225,
    "terjemahan": "Tidakkah engkau melihat bahawa mereka merayau-rayau dengan tidak berketentuan hala dalam tiap-tiap lembah (khayal dan angan-angan kosong)?"
  },
  {
    "surah": 26,
    "ayat": 226,
    "terjemahan": "Dan bahawa mereka memperkatakan apa yang mereka tidak melakukannya?"
  },
  {
    "surah": 26,
    "ayat": 227,
    "terjemahan": "Kecuali orang-orang yang beriman dan beramal soleh (dari kalangan penyair-penyair itu), dan mereka pula mengingati Allah banyak-banyak, serta mereka membela diri sesudah mereka dianiaya. Dan (ingatlah), orang-orang yang melakukan sebarang kezaliman, akan mengetahui kelak, ke tempat mana, mereka akan kembali."
  },
  {
    "surah": 27,
    "ayat": 1,
    "terjemahan": "Taa, siin. Ini ialah ayat-ayat Al-Quran, juga Kitab yang jelas nyata (kandungannya dan kebenarannya),"
  },
  {
    "surah": 27,
    "ayat": 2,
    "terjemahan": "Menjadi hidayah petunjuk dan berita gembira bagi orang-orang yang beriman,"
  },
  {
    "surah": 27,
    "ayat": 3,
    "terjemahan": "Iaitu mereka yang tetap mendirikan sembahyang dan memberi zakat, sedang mereka pula percaya dengan yakin akan hari akhirat."
  },
  {
    "surah": 27,
    "ayat": 4,
    "terjemahan": "Sesungguhnya orang-orang yang tidak percaya kepada hari akhirat, Kami jadikan perbuatan-perbuatan buruk mereka kelihatan baik kepada mereka; oleh itu, tinggalah mereka meraba-raba dalam kesesatan."
  },
  {
    "surah": 27,
    "ayat": 5,
    "terjemahan": "Merekalah orang-orang yang akan beroleh azab seksa yang buruk (di dunia) dan mereka pula pada hari akhirat adalah orang-orang yang palig rugi."
  },
  {
    "surah": 27,
    "ayat": 6,
    "terjemahan": "Dan sesungguhnya engkau (wahai Muhammad) diberikan menyambut dan menerima Al-Quran dari sisi Allah Yang Maha Bijaksana, lagi Maha Mengetahui."
  },
  {
    "surah": 27,
    "ayat": 7,
    "terjemahan": "(Ingatkanlah peristiwa) ketika Nabi Musa berkata kepada isterinya: \"Sesungguhnya aku ada melihat api; aku akan bawakan berita dari situ kepada kamu, atau aku akan bawakan colok api daripadanya, supaya kamu dapat memanaskan diri."
  },
  {
    "surah": 27,
    "ayat": 8,
    "terjemahan": "Maka apabila ia sampai ke tempat api itu, (kedengaran) ia diseru: \"Berkat yang melimpah-limpah kepada orang yang berada dekat api ini dan sesiapa yang ada (di daerah) sekelilingnya; dan Maha Sucilah Allah Tuhan sekalian alam."
  },
  {
    "surah": 27,
    "ayat": 9,
    "terjemahan": "\"Wahai Musa, sesungguhnya Akulah Allah Yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 27,
    "ayat": 10,
    "terjemahan": "Dan (sekarang) campakkanlah tongkatmu. Maka apabila ia melihat tongkatnya itu (menjadi seekor ular besar) bergerak cepat tangkas, seolah-olah seekor ular kecil, berpalinglah dia melarikan diri dan tidak menoleh lagi. (Lalu ia diseru): \" Wahai Musa, janganlah takut, sesungguhnya Rasul-rasul itu semasa mengadapku (menerima wahyu), tidak sepatutnya merasa takut,"
  },
  {
    "surah": 27,
    "ayat": 11,
    "terjemahan": "\"Tetapi sesiapa yang berbuat salah, kemudian ia mengubahnya dengan melakukan kebaikan sesudah berbuat salah, maka sesungguhnya Aku Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 27,
    "ayat": 12,
    "terjemahan": "\"Dan masukkanlah tanganmu melalui belahan dada bajumu, nescaya keluarlah ia putih bersinar-sinar dengan tidak ada cacat (ini ialah) di antara sembilan mukjizat (yang membuktikan kebenaranmu), untuk dibawa kepada Firaun dan kaumnya; sesungguhnya mereka adalah kaum yang fasik - derhaka."
  },
  {
    "surah": 27,
    "ayat": 13,
    "terjemahan": "Maka ketika keterangan-keterangan mukjizat Kami sampai kepada Firan dan kaumnya dengan jelas nyata, berkatalah mereka: \" ini adalah sihir yang terang nyata!\""
  },
  {
    "surah": 27,
    "ayat": 14,
    "terjemahan": "Dan mereka mengingkarinya secara zalim dan sombong angkuh sedang hati mereka meyakini kebenarannya. Oleh itu, lihatlah bagaimana kesudahan orang-orang yang melakukan kerosakan."
  },
  {
    "surah": 27,
    "ayat": 15,
    "terjemahan": "Dan sesungguhnya kami telah mengurniakan ilmu pengetahuan kepada Nabi Daud dan Nabi Sulaiman; dan mereka berdua bersyukur dengan berkata: \"Segala puji tertentu bagi Allah yang dengan limpah kurniaNya memberi kami kelebihan mengatasi kebanyakan hamba-hambaNya yang beriman\"."
  },
  {
    "surah": 27,
    "ayat": 16,
    "terjemahan": "Dan Nabi Sulaiman mewarisi (pangkat kenabian dan kerajaan) Nabi Daud; dan (setelah itu) Nabi Sulaiman berkata: \"Wahai umat manusia, kami telah diajar mengerti bahasa pertuturan burung, dan kami telah diberikan serba sedikit dari tiap-tiap sesuatu (yang diperlukan); sesungguhnya yang demikian ini adalah limpah kurnia (dari Allah) yang jelas nyata\"."
  },
  {
    "surah": 27,
    "ayat": 17,
    "terjemahan": "Dan dihimpunkan bagi Nabi Sulaiman bala tenteranya, dari jin dan manusia serta burung; lalu mereka dijaga serta diatur keadaan dan perjalanan masing-masing."
  },
  {
    "surah": 27,
    "ayat": 18,
    "terjemahan": "(Maralah angkatan itu) hingga apabila mereka sampai ke \"Waadin-Naml\", berkatalah seekor semut: \"Wahai sekalian semut, masuklah ke sarang kamu masing-masing, jangan Sulaiman dan tenteranya memijak serta membinasakan kamu, sedang mereka tidak menyedari\"."
  },
  {
    "surah": 27,
    "ayat": 19,
    "terjemahan": "Maka tersenyumlah Nabi Sulaiman mendengar kata-kata semut itu, dan berdoa dengan berkata:\" Wahai Tuhanku, ilhamkanlah daku supaya tetap bersyukur akan nikmatMu yang Engkau kurniakan kepadaku dan kepada ibu bapaku, dan supaya aku tetap mengerjakan amal soleh yang Engkau redai; dan masukkanlah daku - dengan limpah rahmatMu - dalam kumpulan hamba-hambaMu yang soleh\"."
  },
  {
    "surah": 27,
    "ayat": 20,
    "terjemahan": "Dan (setelah itu) Nabi Sulaiman memeriksa kumpulan burung (yang turut serta dalam tenteranya) lalu berkata: \"Mengapa aku tidak melihat burung belatuk? Adakah ia dari mereka yang tidak hadir?"
  },
  {
    "surah": 27,
    "ayat": 21,
    "terjemahan": "\"Demi sesungguhnya! Aku akan menyeksanya dengan seksa yang seberat-beratnya, atau aku akan menyembelihnya, kecuali ia membawa kepadaku alasan yang terang nyata (yang membuktikan sebab-sebab ia tidak hadir)\"."
  },
  {
    "surah": 27,
    "ayat": 22,
    "terjemahan": "Burung belatuk itu tidak lama ghaibnya selepas itu, lalu datang sambil berkata (kepada Nabi Sulaiman): \"Aku dapat mengetahui secara meliputi akan perkara yang engkau tidak cukup mengetahuinya, dan aku datang kepadamu dari negeri Saba' dengan membawa khabar berita yang diyakini kebenarannya."
  },
  {
    "surah": 27,
    "ayat": 23,
    "terjemahan": "\"Sesungguhnya aku dapati seorang perempuan memerintah mereka dan ia telah diberikan kepadanya (serba sedikit) dari tiap-tiap sesuatu (yang diperlukan) dan ia pula mempunyai singgahsana yang besar."
  },
  {
    "surah": 27,
    "ayat": 24,
    "terjemahan": "\"Aku dapati raja perempuan itu dan kaumnya sujud kepada matahari dengan meninggalkan ibadat menyembah Allah, dan Syaitan pula memperelokkan pada pandangan mereka perbuatan (syirik) mereka, lalu menghalangi mereka dari jalan (yang benar); oleh itu mereka tidak beroleh petunjuk, -"
  },
  {
    "surah": 27,
    "ayat": 25,
    "terjemahan": "\"(Mereka dihalangi oleh Syaitan) supaya mereka tidak sujud menyembah Allah yang mengeluarkan benda yang tersembunyi di langit dan di bumi, dan yang mengetahui apa yang kamu rahsiakan serta apa yang kamu zahirkan."
  },
  {
    "surah": 27,
    "ayat": 26,
    "terjemahan": "\"Allah! - Tiada Tuhan melainkan Dia, Tuhan yang mempunyai Arasy yang besar \"."
  },
  {
    "surah": 27,
    "ayat": 27,
    "terjemahan": "Nabi Sulaiman berkata: Kami akan fikirkan dengan sehalus-halusnya, adakah benar apa yang engkau katakan itu, ataupun engkau dari golongan yang berdusta."
  },
  {
    "surah": 27,
    "ayat": 28,
    "terjemahan": "\"Pergilah bawa suratku ini, serta campakkanlah kepada mereka, kemudian berundurlah dari mereka; dalam pada itu perhatikanlah apa tindak balas mereka\"."
  },
  {
    "surah": 27,
    "ayat": 29,
    "terjemahan": "(Setelah membaca surat itu), berkatalah raja perempuan negeri Saba': \"Wahai ketua-ketua kamu! Sesungguhnya telah disampaikan kepadaku sepucuk surat yang mulia."
  },
  {
    "surah": 27,
    "ayat": 30,
    "terjemahan": "\"Sesungguhnya surat itu dari Nabi Sulaiman, dan kandungannya (seperti berikut): `"
  },
  {
    "surah": 27,
    "ayat": 31,
    "terjemahan": "\" `Bahawa janganlah kamu meninggi diri terhadapku, dan datanglah kamu kepadaku dengan menyerah diri (beriman dan mematuhi ajaran ugama Allah). ' \""
  },
  {
    "surah": 27,
    "ayat": 32,
    "terjemahan": "Raja perempuan itu berkata lagi: \"Wahai ketua-ketua kaum, berilah penjelasan kepadaku mengenai perkara yang aku hadapi ini; aku tidak pernah memutuskan sesuatu perkara sebelum kamu hadir memberi pendapat dan mempersetujuinya\"."
  },
  {
    "surah": 27,
    "ayat": 33,
    "terjemahan": "Mereka menjawab: Kita adalah orang-orang yang kuat gagah dan amat berani merempuh peperangan; dan perkara itu (walau bagaimanapun) terserahlah kepadamu; oleh itu fikirkanlah apa yang engkau hendak perintahkan."
  },
  {
    "surah": 27,
    "ayat": 34,
    "terjemahan": "Raja perempuan itu berkata: \"Sesungguhnya raja-raja, apabila masuk ke sebuah negeri, mereka merosakkannya, dan mereka menjadikan penduduknya yang mulia hina-dina; dan sedemikian itulah mereka akan lakukan."
  },
  {
    "surah": 27,
    "ayat": 35,
    "terjemahan": "\"Dan bahawa aku hendak menghantarkan hadiah kepada mereka, kemudian aku akan menunggu, apakah balasan yang akan dibawa balik oleh utusan-utusan kita\""
  },
  {
    "surah": 27,
    "ayat": 36,
    "terjemahan": "Maka apabila (utusan pembawa hadiah itu) datang mengadap Nabi Sulaiman, berkatalah Nabi Sulaiman (kepadanya): \"Tidaklah patut kamu memberikan kepadaku pemberian harta-benda, kerana apa yang telah diberikan Allah kepadaku lebih baik dari apa yang telah diberikanNya kepada kamu; (bukan aku yang memandang kepada pemberian hadiah) bahkan kamulah yang bergembira dengan hanya kekayaan yang dihadiahkan kepada kamu (atau yang kamu hadiahkan dengan perasaan megah)."
  },
  {
    "surah": 27,
    "ayat": 37,
    "terjemahan": "\"Kembalilah kepada mereka, (jika mereka tidak juga mahu beriman) maka demi sesungguhnya Kami akan mendatangi mereka dengan angkatan tentera yang mereka tidak terdaya menentangnya, dan kami akan mengeluarkan mereka dari negeri Saba' dengan keadaan hina, menjadi orang-orang tawanan.\""
  },
  {
    "surah": 27,
    "ayat": 38,
    "terjemahan": "Nabi Sulaiman berkata pula (kepada golongan bijak pandainya): \"Wahai pegawai-pegawaiku, siapakah di antara kamu yang dapat membawa kepadaku singgahsananya sebelum mereka datang mengadapku dalam keadaan berserah diri memeluk Islam?\""
  },
  {
    "surah": 27,
    "ayat": 39,
    "terjemahan": "Berkatalah Ifrit dari golongan jin: \"Aku akan membawakannya kepadamu sebelum engkau bangun dari tempat dudukmu, dan sesungguhnya aku amatlah kuat gagah untuk membawanya, lagi amanah\"."
  },
  {
    "surah": 27,
    "ayat": 40,
    "terjemahan": "Berkata pula seorang yang mempunyai ilmu pengetahuan dari Kitab Allah: \"Aku akan membawakannya kepadamu dalam sekelip mata!\" Setelah Nabi Sulaiman melihat singgahsana itu terletak di sisinya, berkatalah ia: \"Ini ialah dari limpah kurnia Tuhanku, untuk mengujiku adakah aku bersyukur atau aku tidak mengenangkan nikmat pemberianNya. Dan (sebenarnya) sesiapa yang bersyukur maka faedah syukurnya itu hanyalah terpulang kepada dirinya sendiri, dan sesiapa yang tidak bersyukur (maka tidaklah menjadi hal kepada Allah), kerana sesungguhnya Tuhanku Maha Kaya, lagi Maha Pemurah\"."
  },
  {
    "surah": 27,
    "ayat": 41,
    "terjemahan": "Nabi Sulaiman berkata pula (kepada orang-orangnya): \"Ubahkanlah keadaan singgahsananya itu, supaya kita melihat adakah ia dapat mencapai pengetahuan yang sebenar (untuk mengenal singgahsananya itu) atau ia termasuk dalam golongan yang tidak dapat mencapai pengetahuan yang demikian\"."
  },
  {
    "surah": 27,
    "ayat": 42,
    "terjemahan": "Maka ketika ia datang mengadap, Nabi Sulaiman bertanya kepadanya: Serupa inikah singahsanamu?\" Ia menjawab: \"Boleh jadi inilah dia; dan kami telah diberikan ilmu pengetahuan sebelum berlakunya (mukjizat) ini, dan kami pula adalah tetap berserah diri (menjunjung perintah Allah)\"."
  },
  {
    "surah": 27,
    "ayat": 43,
    "terjemahan": "Dan ia dihalangi (daripada memeluk Islam pada masa yang lalu): apa yang ia pernah menyembahnya (dari benda-benda) yang lain dari Allah; sesungguhnya adalah ia (pada masa itu) dari puak yang kafir."
  },
  {
    "surah": 27,
    "ayat": 44,
    "terjemahan": "(Setelah itu) dikatakan kepadanya: \"Dipersilakan masuk ke dalam istana ini.\" Maka ketika ia melihatnya, disangkanya halaman istana itu sebuah kolam air, serta dia pun menyingsingkan pakaian dari dua betisnya. Nabi Sulaiman berkata: \"Sebenarnya ini adalah sebuah istana yang diperbuat licin berkilat dari kaca\". (Mendengar yang demikian), Balqis berdoa: \"Wahai Tuhanku, sesungguhnya aku telah menganiaya diri sendiri dan (sekarang aku menegaskan bahawa) aku berserah diri memeluk Islam bersama-sama Nabi Sulaiman, kepada Allah Tuhan sekalian alam \"."
  },
  {
    "surah": 27,
    "ayat": 45,
    "terjemahan": "Dan demi sesungguhnya, Kami telah mengutus kepada kaum Thamud, saudara mereka Nabi Soleh (menyeru mereka dengan berkata): \"Sembahlah kamu akan Allah!\" Maka tiba-tiba mereka menjadi dua puak (mukmin dan kafir) yang berbalah."
  },
  {
    "surah": 27,
    "ayat": 46,
    "terjemahan": "Nabi Soleh berkata (kepada puak kafir): \"Wahai kaumku, mengapa kamu segerakan kufur ingkar yang mendatangkan keburukan kepada kamu, (tidak) mendahulukan iman yang mendatangkan kebaikan kepada kamu? Alangkah baiknya kalau kamu memohon ampun kepada Allah supaya kamu diberi rahmat.\""
  },
  {
    "surah": 27,
    "ayat": 47,
    "terjemahan": "Mereka menjawab: \"Kami merasa nahas dan malang dengan sebabmu, dan juga dengan sebab pengikut-pengikutmu!\" Nabi Soleh berkata: Perkara yang menyebabkan baik dan malang kamu adalah di sisi Allah (dan Dia lah yang menentukannya, bukannya aku), sebenarnya kamu adalah kaum yang disesatkan (oleh hawa nafsu)\"."
  },
  {
    "surah": 27,
    "ayat": 48,
    "terjemahan": "Dan di bandar (tempat tinggal kaum Thamud) itu, ada sembilan orang yang semata-mata melakukan kerosakan di bumi (dengan berbagai-bagai maksiat) dan tidak melakukan kebaikan sedikitpun."
  },
  {
    "surah": 27,
    "ayat": 49,
    "terjemahan": "Mereka berkata (sesama sendiri): \"Hendaklah kamu masing-masing bersumpah dengan nama Allah, bahawa sesungguhnya kita akan membunuh Soleh dan pengikut-pengikutnya secara mengejut pada waktu malam, kemudian kita akan berkata kepada warisnya: ` Kami tidak hadir (di tempat) pembunuhan (Soleh apalagi membunuhnya atau membunuh) pengikut-pengikutnya, dan sesungguhnya kami adalah berkata benar '. \""
  },
  {
    "surah": 27,
    "ayat": 50,
    "terjemahan": "Dan (dengan demikian) mereka telah merancangkan rancangan jahat, dan Kami pula rancangkan balasannya dengan seburuk-buruk balasan, sedang mereka tidak menyedarinya."
  },
  {
    "surah": 27,
    "ayat": 51,
    "terjemahan": "Maka lihatlah bagaimana akibat rancangan jahat mereka, iaitu Kami telah hancurkan mereka dan kaum mereka semuanya."
  },
  {
    "surah": 27,
    "ayat": 52,
    "terjemahan": "Kesudahannya rumah-rumah mereka itu telah runtuh ranap, dengan sebab mereka berlaku zalim; sesungguhnya kejadian yang demikian mengandungi pelajaran yang mendatangkan iktibar bagi orang-orang yang mahu mengetahui (akan sebab dan musababnya)."
  },
  {
    "surah": 27,
    "ayat": 53,
    "terjemahan": "Dan Kami selamatkan orang-orang yang beriman, serta yang selalu bertaqwa."
  },
  {
    "surah": 27,
    "ayat": 54,
    "terjemahan": "Dan Nabi Lut juga (Kami utuskan); (ingatlah peristiwanya) ketika ia berkata kepada kaumnya: \"Patutkah kamu melakukan perbuatan yang keji sedang kamu nampak kejinya?"
  },
  {
    "surah": 27,
    "ayat": 55,
    "terjemahan": "\"Sesungguhnya kamu mendatangi lelaki, bukan perempuan, kerana memuaskan nafsu syahwat kamu. (Perbuatan kamu itu amatlah keji) bahkan kamu kaum yang jahil (yang tidak mengetahui akan akibatnya)\"."
  },
  {
    "surah": 27,
    "ayat": 56,
    "terjemahan": "Maka kaumnya tidak menjawab selain dari berkata: usirlah Lut dan pengikut-pengikutnya dari bandar kamu ini; sesungguhnya mereka adalah orang-orang yang mendakwakan dirinya bersih suci \"."
  },
  {
    "surah": 27,
    "ayat": 57,
    "terjemahan": "Lalu Kami selamatkan Nabi Lut dan keluarganya serta pengikut-pengikutnya, kecuali isterinya, Kami takdirkan dia menjadi dari golongan yang tertinggal dalam azab."
  },
  {
    "surah": 27,
    "ayat": 58,
    "terjemahan": "Dan Kami hujani mereka dengan hujan yang membinasakan, maka amatlah buruknya hujan azab yang menimpa orang-orang yang telah diberi amaran."
  },
  {
    "surah": 27,
    "ayat": 59,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Segala puji tertentu bagi Allah dan selamat sejahtera kepada hamba-hambaNya (Nabi-nabi) yang dipilihNya. Manakah yang lebih baik? - Allah (yang demikian kekuasaanNya) atau benda-benda yang mereka jadikan sekutu-sekutu bagiNya?"
  },
  {
    "surah": 27,
    "ayat": 60,
    "terjemahan": "Bahkan siapakah yang telah mencipta langit dan bumi, dan menurunkan hujan dari langit untuk kamu? Lalu Kami tumbuhkan dengan air hujan itu tanaman kebun-kebun (yang menghijau subur) dengan indahnya, yang kamu tidak dapat dan tidak berkuasa menumbuhkan pohon-pohonnya. Adakah sebarang tuhan yang lain bersama-sama Allah? (Tidak!) bahkan mereka (yang musyrik itu) adalah kaum yang menyeleweng dari kebenaran (tauhid)."
  },
  {
    "surah": 27,
    "ayat": 61,
    "terjemahan": "Atau siapakah yang telah menjadikan bumi tempat penetapan dan telah menjadikan sungai-sungai di antara bahagian-bahagiannya dan telah menjadikan untuknya gunung-ganang yang menetapnya; dan juga telah menjadikan di antara dua laut (yang masin dan yang tawar) sekatan (semula jadi) yang memisahnya? Adakah sebarang tuhan yang lain bersama-sama Allah? (Tidak!) bahkan kebanyakan mereka (yang musyrik itu) tidak mengetahui."
  },
  {
    "surah": 27,
    "ayat": 62,
    "terjemahan": "Atau siapakah yang memperkenankan doa orang yang menderita apabila ia berdoa kepadaNya, dan yang menghapuskan kesusahan, serta menjadikan kamu pengganti (umat-umat yang telah lalu) mendiami dan menguasai bumi? Adakah sebarang tuhan yang lain bersama-sama Allah? Amat sedikit di antara kamu yang mengingati (nikmat Allah itu)."
  },
  {
    "surah": 27,
    "ayat": 63,
    "terjemahan": "Atau siapakah yang menunjukkan jalan kepada kamu dalam gelap-gelita darat dan laut, dan yang menghantarkan angin sebagai pembawa berita yang mengembirakan sebelum kedatangan rahmatNya? Adakah sebarang tuhan yang lain bersama-sama Allah? Maha Tinggilah keadaan Allah dari apa yang mereka sekutukan denganNya."
  },
  {
    "surah": 27,
    "ayat": 64,
    "terjemahan": "Atau siapakah yang memulakan kejadian sekalian makhluk, kemudian dia mengembalikannya (hidup semula sesudah matinya). dan siapakah yang memberi rezeki kepada kamu dari langit dan bumi? Adakah sebarang tuhan yang lain bersama-sama Allah? Katakanlah (wahai Muhammad): \"Bawalah kemari keterangan-keterangan kamu, jika betul kamu orang-orang yang benar \"."
  },
  {
    "surah": 27,
    "ayat": 65,
    "terjemahan": "Katakanlah lagi: Tiada sesiapapun di langit dan di bumi yang mengetahui perkara yang ghaib melainkan Allah!\" Dan tiadalah mereka menyedari bilakah masing-masing akan dibangkitkan hidup semula (sesudah mati)."
  },
  {
    "surah": 27,
    "ayat": 66,
    "terjemahan": "Bahkan mereka (yang kafir) telah berkali-kali mengetahui tentang hari akhirat (tetapi mereka tidak meyakininya), bahkan mereka berada dalam syak mengenainya; bahkan matahati mereka buta langsung daripada memikirkannya."
  },
  {
    "surah": 27,
    "ayat": 67,
    "terjemahan": "Dan orang-orang yang kafir berkata: \"Adakah sesudah kami menjadi tanah, dan juga datuk nenek kami, adakah kami semua akan dikeluarkan dari kubur (hidup semula)?"
  },
  {
    "surah": 27,
    "ayat": 68,
    "terjemahan": "\"Demi sesungguhnya, kami telah dijanjikan dengan perkara ini, kami dan juga datuk nenek kami dahulu; ini hanyalah cerita-cerita dongeng orang-orang dahulu kala\"."
  },
  {
    "surah": 27,
    "ayat": 69,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Mengembaralah kamu di muka bumi, kemudian perhatikanlah bagaimana buruknya kesudahan orang-orang yang berdosa itu\"."
  },
  {
    "surah": 27,
    "ayat": 70,
    "terjemahan": "Dan janganlah engkau berdukacita terhadap (keingkaran) mereka (yang kafir itu,) dan janganlah engkau resah-gelisah disebabkan tipu daya yang mereka lakukan."
  },
  {
    "surah": 27,
    "ayat": 71,
    "terjemahan": "Dan mereka bertanya: \"Bilakah berlakunya azab yang telah dijanjikan itu, jika betul kamu orang-orang yang benar?\""
  },
  {
    "surah": 27,
    "ayat": 72,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Dipercayai tidak lama lagi akan datang kepada kamu sebahagian dari azab yang kamu minta disegerakan itu\"."
  },
  {
    "surah": 27,
    "ayat": 73,
    "terjemahan": "Dan sesungguhnya Tuhanmu (wahai Muhammad) sentiasa melimpah-ruah kurniaNya kepada umat manusia seluruhnya tetapi kebanyakan mereka tidak bersyukur."
  },
  {
    "surah": 27,
    "ayat": 74,
    "terjemahan": "Dan sesungguhnya Tuhanmu sedia mengetahui apa yang terpendam dalam hati mereka dan apa yang mereka nyatakan (dengan tutur kata dan perbuatan)."
  },
  {
    "surah": 27,
    "ayat": 75,
    "terjemahan": "Dan tiada sesuatu perkara yang ghaib di langit dan di bumi, melainkan tertulis dalam Kitab yang terang nyata."
  },
  {
    "surah": 27,
    "ayat": 76,
    "terjemahan": "Sesungguhnya Al-Quran ini menceritakan kepada Bani lsrail (perkara yang sebenar-benarnya) mengenai kebanyakan (hal-hal ugama) yang mereka berselisihan padanya."
  },
  {
    "surah": 27,
    "ayat": 77,
    "terjemahan": "Dan sesungguhnya Al-Quran itu menjadi hidayah petunjuk dan rahmat bagi orang-orang yang beriman."
  },
  {
    "surah": 27,
    "ayat": 78,
    "terjemahan": "Sesungguhnya Tuhanmu (wahai Muhammad) akan memutuskan di antara mereka dengan hukumNya, dan Dia lah sahaja Yang Maha Kuasa, lagi Maha Mengetahui."
  },
  {
    "surah": 27,
    "ayat": 79,
    "terjemahan": "Oleh itu, berserahlah kepada Allah, sesungguhnya engkau berada di atas kebenaran yang jelas nyata."
  },
  {
    "surah": 27,
    "ayat": 80,
    "terjemahan": "Sesungguhnya engkau tidak dapat menjadikan orang-orang yang mati (hatinya) itu menerima ajaranmu, dan tidak dapat menjadikan orang-orang yang pekak itu mendengar seruanmu, apabila mereka berundur ke belakang (disebabkan keingkarannya)."
  },
  {
    "surah": 27,
    "ayat": 81,
    "terjemahan": "Dan engkau tidak akan dapat memberi petunjuk kepada orang-orang yang buta supaya menjauhi kesesatan mereka; engkau tidak dapat memperdengarkan (seruanmu itu) melainkan kepada orang-orang yang sanggup beriman akan ayat-ayat keterangan Kami, kerana mereka orang-orang yang berserah diri dengan ikhlas."
  },
  {
    "surah": 27,
    "ayat": 82,
    "terjemahan": "Dan apabila sampai masa berlakunya hukuman atas manusia, Kami keluarkan untuk mereka sejenis binatang dari bumi, yang akan menyatakan kepada mereka, bahawa manusia telah tidak meyakini ayat-ayat keterangan dan pengajaran Kami."
  },
  {
    "surah": 27,
    "ayat": 83,
    "terjemahan": "Dan (ingatlah) hari Kami himpunkan dari tiap-tiap umat sekumpulan besar orang-orang yang mendustakan ayat-ayat keterangan Kami, lalu mereka dijaga serta diatur keadaan dan perjalanan masing-masing."
  },
  {
    "surah": 27,
    "ayat": 84,
    "terjemahan": "Sehingga apabila mereka datang (ke tempat pengadilan), Allah Taala berfirman: \"Adakah kamu mendustakan ayat-ayat keteranganKu dengan tidak lebih dahulu kamu mengetahuinya secara meliputi? Atau apakah yang kamu telah lakukan?\""
  },
  {
    "surah": 27,
    "ayat": 85,
    "terjemahan": "Dan jatuhlah hukuman atas mereka (dengan azab) disebabkan kezaliman mereka (berlaku kufur ingkar), lalu mereka diam membisu."
  },
  {
    "surah": 27,
    "ayat": 86,
    "terjemahan": "Tidakkah mereka memerhatikan bahawa Kami telah menjadikan malam untuk mereka berehat padanya, dan menjadikan siang terang-benderang? Sesungguhnya yang demikian itu mengandungi tanda-tanda (kekuasaan Allah) bagi kaum yang beriman."
  },
  {
    "surah": 27,
    "ayat": 87,
    "terjemahan": "Dan (ingatkanlah) hari di tiup sangkakala, lalu terkejutlah - gerun gementar - makhluk-makhluk yang ada di langit dan yang ada di bumi, kecuali mereka yang dikekhendaki Allah; dan kesemuanya akan datang kepadaNya dengan keadaan tunduk patuh."
  },
  {
    "surah": 27,
    "ayat": 88,
    "terjemahan": "Dan engkau melihat gunung-ganang, engkau menyangkanya tetap membeku, padahal ia bergerak cepat seperti bergeraknya awan; (demikianlah) perbuatan Allah yang telah membuat tiap - tiap sesuatu dengan serapi-rapi dan sebaik-baiknya; sesungguhnya Ia Amat mendalam PengetahuanNya akan apa yang kamu lakukan."
  },
  {
    "surah": 27,
    "ayat": 89,
    "terjemahan": "Sesiapa yang datang membawa amal kebajikan (yang telah dikerjakannya) maka ia akan beroleh balasan yang lebih baik daripadanya, dan mereka akan beroleh aman sentosa daripada kejadian-kejadian yang mengerikan pada hari kiamat itu."
  },
  {
    "surah": 27,
    "ayat": 90,
    "terjemahan": "Dan sesiapa yang datang membawa amal jahat (yang telah dikerjakannya) maka sudah tentu mereka akan ditumuskan mukanya ke dalam api neraka, (sambil dikatakan kepada mereka): \"Kamu tidak diberi melainkan balasan apa yang kamu telah lakukan\"."
  },
  {
    "surah": 27,
    "ayat": 91,
    "terjemahan": "(Katakanlah wahai Muhammad):\" Aku hanyalah diperintahkan supaya menyembah Allah Tuhan negeri (Makkah) ini yang telah menjadikannya suci lagi dihormati dan yang menguasai segala-galanya; dan aku diperintahkan supaya tetap menjadi dari orang-orang Islam (yang menyerah diri bulat-bulat kepadaNya), -"
  },
  {
    "surah": 27,
    "ayat": 92,
    "terjemahan": "\"Dan supaya aku sentiasa membaca Al-Quran\". Oleh itu, sesiapa yang menurut petunjuk (Al-Quran dan beramal dengannya) maka faedah perbuatannya itu akan terpulang kepada dirinya sendiri, dan sesiapa yang sesat, maka katakanlah kepadanya: \"Sesungguhnya aku hanyalah seorang pemberi amaran\"."
  },
  {
    "surah": 27,
    "ayat": 93,
    "terjemahan": "Dan katakanlah (wahai Muhammad): \"Segala puji tertentu bagi Allah (yang melimpahkan nikmat-nikmatNya yang tidak terhitung), Ia akan memperlihatkan kepada kamu tanda-tanda kekuasaanNya supaya kamu dapat mengetahuinya (dengan jelas nyata)\"; dan Tuhanmu tidaklah lalai akan segala yang kamu lakukan."
  },
  {
    "surah": 28,
    "ayat": 1,
    "terjemahan": "Taa, Siin, Miim."
  },
  {
    "surah": 28,
    "ayat": 2,
    "terjemahan": "Inilah ayat-ayat Kitab - Al-Quran - yang memberi penjelasan."
  },
  {
    "surah": 28,
    "ayat": 3,
    "terjemahan": "Kami bacakan kepadamu (wahai Muhammad) sebahagian dari kisah Nabi Musa dan Firaun dengan keterangan yang benar bagi orang-orang yang beriman."
  },
  {
    "surah": 28,
    "ayat": 4,
    "terjemahan": "Sesungguhnya Firaun telah berlaku zalim di bumi (Mesir) dengan melampaui batas, serta ia menjadikan penduduknya berpuak-puak. Ia menindas sepuak di antaranya dengan membunuh anak-anak lelaki mereka dan membiarkan hidup anak-anak perempuan mereka. Sesungguhnya adalah ia dari golongan yang membuat kerosakan."
  },
  {
    "surah": 28,
    "ayat": 5,
    "terjemahan": "Dan Kami hendak berihsan dengan memberikan pertolongan kepada kaum yang tertindas di negeri itu, dan hendak menjadikan mereka pemimpin-pemimpin, serta hendak menjadikan mereka orang-orang yang mewarisi (apa yang dimiliki oleh Firaun dan kaumnya)."
  },
  {
    "surah": 28,
    "ayat": 6,
    "terjemahan": "Dan Kami hendak memberi mereka kedudukan yang kukuh di negeri itu, serta hendak memperlihatkan kepada Firaun dan Haman bersama-sama tentera mereka apa yang mereka bimbangkan dari golongan yang bertindas itu."
  },
  {
    "surah": 28,
    "ayat": 7,
    "terjemahan": "Dan Kami ilhamkan kepada ibu Musa:\" Susukanlah dia; dalam pada itu, jika engkau takutkan sesuatu bahaya mengenainya (dari angkara Firaun), maka (letakkanlah dia di dalam peti dan) lepaskanlah dia ke laut; dan janganlah engkau merasa bimbang dan jangan pula berdukacita; sesungguhnya Kami akan mengembalikannya kepadamu, dan Kami akan melantiknya menjadi salah seorang dari Rasul-rasul Kami."
  },
  {
    "surah": 28,
    "ayat": 8,
    "terjemahan": "Setelah itu dia dipungut oleh orang-orang Firaun; kesudahannya dia akan menjadi musuh dan menyebabkan dukacita bagi mereka; sesungguhnya Firaun dan Haman serta orang-orangnya adalah golongan yang bersalah."
  },
  {
    "surah": 28,
    "ayat": 9,
    "terjemahan": "Dan (ketika melihat kanak-kanak itu) berkatalah isteri Firaun: \"(Semoga ia menjadi) cahaya mata bagiku dan bagimu; janganlah kamu membunuhnya; mudah-mudahan ia berguna kepada kita, atau kita jadikan dia anak\". Padahal mereka tidak menyedari (kesudahannya)."
  },
  {
    "surah": 28,
    "ayat": 10,
    "terjemahan": "Dan (sepeninggalannya) menjadilah hati ibu Musa kosong; sesungguhnya ia nyaris-nyaris menyatakan perihal anaknya itu dengan berterus-terang jika tidaklah Kami kuatkan hatinya (dengan perasaan sabar dan tenang tenteram), supaya tetaplah ia dari orang-orang yang percaya (akan janji Allah)."
  },
  {
    "surah": 28,
    "ayat": 11,
    "terjemahan": "Dan berkatalah ia kepada kakak Musa: \"Pergilah cari khabar beritanya\". (Maka pergilah ia) lalu dilihatnya dari jauh sedang orang ramai tidak menyedarinya."
  },
  {
    "surah": 28,
    "ayat": 12,
    "terjemahan": "Dan Kami jadikan dia dari mulanya enggan menyusu kepada perempuan-perempuan yang hendak menyusukannya; (melihatkan halnya itu), kakaknya berkata: \"Mahukah, aku tunjukkan kamu kepada penduduk sebuah rumah yang dapat memeliharanya untuk kamu, serta mereka tulus ikhlas kepadanya?\""
  },
  {
    "surah": 28,
    "ayat": 13,
    "terjemahan": "Maka (dengan jalan itu) Kami kembalikan dia kepada ibunya supaya tenang tenteram hatinya dan tidak berdukacita (disebabkan bercerai dengannya); dan supaya ia mengetahui bahawa janji Allah (untuk menyelamatkannya) adalah benar; akan tetapi kebanyakan mereka tidak mengetahui (yang demikian itu)."
  },
  {
    "surah": 28,
    "ayat": 14,
    "terjemahan": "Dan ketika Musa sampai ke peringkat umurnya yang cukup kekuatannya dan sempurna, Kami beri kepadanya kebijaksanaan serta ilmu pengetahuan; dan demikian Kami membalas orang-orang yang berusaha memperbaiki amalannya."
  },
  {
    "surah": 28,
    "ayat": 15,
    "terjemahan": "Dan masuklah ia ke bandar (Mesir) dalam masa penduduknya tidak menyedarinya, lalu didapatinya di situ dua orang lelaki sedang berkelahi, - seorang dari golongannya sendiri dan yang seorang lagi dari pihak musuhnya. Maka orang yang dari golongannya meminta tolong kepadanya melawan orang yang dari pihak musuhnya; Musa pun menumbuknya lalu menyebabkan orang itu mati. (pada saat itu) Musa berkata: \"Ini adalah dari kerja Syaitan, sesungguhnya Syaitan itu musuh yang menyesatkan, yang nyata (angkaranya) \"."
  },
  {
    "surah": 28,
    "ayat": 16,
    "terjemahan": "Ia merayu (dengan sesalnya): \"Wahai Tuhanku, sesungguhnya aku telah menganiaya diri sendiri; oleh itu ampunkanlah - apalah jua kiranya - akan dosaku\". (Maka Allah Taala menerima taubatnya) lalu mengampunkan dosanya; sesungguhnya Allah jualah Yang Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 28,
    "ayat": 17,
    "terjemahan": "Ia merayu lagi: \"Wahai Tuhanku, demi nikmat-nikmat yang Engkau kurniakan kepadaku, (peliharalah daku) supaya aku tidak akan menjadi penyokong kepada golongan yang bersalah\"."
  },
  {
    "surah": 28,
    "ayat": 18,
    "terjemahan": "Semenjak itu, tinggalah ia di bandar (Mesir) dalam keadaan cemas sambil memerhatikan (berita mengenai dirinya), maka tiba-tiba orang yang meminta pertolongan kepadanya semalam, memanggil meminta pertolongannya lagi. Musa berkata kepadanya: \"Sesungguhnya engkau ini orang yang nyata sesatnya!\""
  },
  {
    "surah": 28,
    "ayat": 19,
    "terjemahan": "Maka ketika ia bersedia hendak menumbuk orang yang menjadi musuh bagi mereka berdua berkatalah orang itu: \"Wahai Musa, adakah engkau hendak membunuhku sebagaimana engkau membunuh satu jiwa semalam? Sebenarnya engkau hanyalah hendak menjadi seorang yang kejam di bumi, dan tidaklah engkau hendak menjadi seorang pendamai\"."
  },
  {
    "surah": 28,
    "ayat": 20,
    "terjemahan": "Dan datanglah seorang lelaki dari hujung bandar itu dengan berlari, (lalu menyampaikan berita) dengan berkata: \"Wahai Musa, sesungguhnya pegawai-pegawai Firaun sedang mengadakan pakatan terhadapmu, mereka hendak membunuhmu; oleh itu pergilah dari sini, sesungguhnya aku adalah pemberi nasihat secara ikhlas kepadamu\"."
  },
  {
    "surah": 28,
    "ayat": 21,
    "terjemahan": "Musa pun keluarlah dari negeri itu dalam keadaan cemas sambil memerhatikan (berita mengenai dirinya) serta berdoa dengan berkata: \"Wahai Tuhanku, selamatkanlah daku dari kaum yang zalim \"."
  },
  {
    "surah": 28,
    "ayat": 22,
    "terjemahan": "Dan setelah ia (meninggalkan Mesir dalam perjalanan) menuju ke negeri Madyan, berdoalah ia dengan berkata: \"Mudah-mudahan Tuhanku menunjukkan jalan yang benar kepadaku,\"."
  },
  {
    "surah": 28,
    "ayat": 23,
    "terjemahan": "Dan ketika dia sampai di telaga air negeri Madyan, ia dapati di situ sekumpulan orang-orang lelaki sedang memberi minum (binatang ternak masing-masing), dan ia juga dapati di sebelah mereka dua perempuan yang sedang menahan kambing-kambingnya. dia bertanya: \"Apa hal kamu berdua?\" Mereka menjawab: \"Kami tidak memberi minum (kambing-kambing kami) sehingga pengembala-pengembala itu membawa balik binatang ternak masing-masing; dan bapa kami seorang yang terlalu tua umurnya \"."
  },
  {
    "surah": 28,
    "ayat": 24,
    "terjemahan": "Maka Musa pun memberi minum kepada binatang-binatang ternak mereka, kemudian ia pergi ke tempat teduh lalu berdoa dengan berkata: \"Wahai Tuhanku, sesungguhnya aku sangat berhajat kepada sebarang rezeki pemberian yang Engkau berikan\"."
  },
  {
    "surah": 28,
    "ayat": 25,
    "terjemahan": "Kemudian salah seorang dari perempuan dua beradik itu datang mendapatkannya dengan berjalan dalam keadaan tersipu-sipu sambil berkata:\" Sebenarnya bapaku menjemputmu untuk membalas budimu memberi minum binatang ternak kami\". Maka ketika Musa datang mendapatkannya dan menceritakan kepadanya kisah-kisah kejadian yang berlaku (mengenai dirinya) berkatalah orang tua itu kepadanya: \"Janganlah engkau bimbang, engkau telah selamat dari kaum yang zalim itu \"."
  },
  {
    "surah": 28,
    "ayat": 26,
    "terjemahan": "Salah seorang di antara perempuan yang berdua itu berkata: \"Wahai ayah, ambilah dia memjadi orang upahan (mengembala kambing kita), sesungguhnya sebaik-baik orang yang ayah ambil bekerja ialah orang yang kuat, lagi amanah\"."
  },
  {
    "surah": 28,
    "ayat": 27,
    "terjemahan": "Bapa perempuan itu berkata (kepada Musa): \"Aku hendak mengahwinkanmu dengan salah seorang dari dua anak perempuanku ini, dengan syarat bahawa engkau bekerja denganku selama delapan tahun; dalam pada itu, jika engkau genapkan menjadi sepuluh tahun, maka yang demikian itu adalah dari kerelaanmu sendiri. Dan (ingatlah) aku tidak bertujuan hendak menyusahkanmu; engkau akan dapati aku Insya Allah, dari orang-orang yang baik layanannya\"."
  },
  {
    "surah": 28,
    "ayat": 28,
    "terjemahan": "Musa menjawab: \"Perjanjian itu adalah antaraku denganmu (tetap dihormati bersama); yang mana sahaja dari dua tempoh itu yang aku tunaikan, maka janganlah hendaknya aku disalahkan. Dan Allah jualah menjadi Pengawas terhadap apa yang kita katakan itu\"."
  },
  {
    "surah": 28,
    "ayat": 29,
    "terjemahan": "Setelah Musa menyempurnakan tempoh kerjanya itu dan (mendapat izin) berjalan dengan isterinya (kembali ke Mesir), ia melihat (dalam perjalanannya itu) api dari sebelah Gunung Tursina. (Ketika itu) berkatalah ia kepada isterinya: \"Berhentilah; sesungguhnya aku ada melihat api, semoga aku dapat membawa kepada kamu sesuatu berita dari situ, atau sepuntung dari api itu, supaya kamu dapat memanaskan diri\"."
  },
  {
    "surah": 28,
    "ayat": 30,
    "terjemahan": "Maka ketika ia sampai ke tempat api itu, (kedengaran) ia diseru dari tepi lembah yang di sebelah kanan, di tempat yang dilimpahi berkat, dari arah pohon kayu (yang ada di situ): \"Wahai Musa, sesungguhnya Akulah Allah Tuhan sekalian alam. (Sesungguhnya api itu adalah sebagai satu isyarat yang didatangkan oleh Allah untuk menarik perhatian Musa ke tempat itu dan bukannya zat Allah, Wallahu A'lam)"
  },
  {
    "surah": 28,
    "ayat": 31,
    "terjemahan": "\"Dan (sekarang) campakkanlah tongkatmu\". (Ia pun mencampaknya), maka apabila ia melihat tongkatnya itu (menjadi seekor ular besar) bergerak cepat tangkas, seolah-olah seekor ular kecil, berpalinglah ia melarikan diri dan tidak menoleh lagi. (Lalu ia diseru): \"Wahai Musa, datanglah kemari dan janganlah engkau takut. Sesungguhnya engkau dari orang-orang yang beroleh aman."
  },
  {
    "surah": 28,
    "ayat": 32,
    "terjemahan": "\"Masukkanlah tanganmu melalui belahan dada bajumu, nescaya keluarlah ia putih bersinar-sinar dengan tiada cacat; dan kepitlah tanganmu di celah ketiakmu ketika merasa takut (nescaya hilanglah takutmu). Yang demikian adalah dua bukti dari Tuhanmu (untuk engkau menunjukkannya) kepada Firaun dan kaumnya. Sesungguhnya mereka itu adalah kaum yang fasik - derhaka\""
  },
  {
    "surah": 28,
    "ayat": 33,
    "terjemahan": "Nabi Musa merayu dengan berkata: \"Wahai Tuhanku, bahawa aku telah membunuh seorang dari kalangan mereka; oleh itu aku takut mereka akan membunuhku \""
  },
  {
    "surah": 28,
    "ayat": 34,
    "terjemahan": "\"Dan saudaraku - Harun, ia lebih fasih lidahnya daripadaku, maka utuslah dia bersama-samaku sebagai penyokong yang mengakui kebenaranku; sesungguhnya aku bimbang bahawa mereka akan mendustakan daku\"."
  },
  {
    "surah": 28,
    "ayat": 35,
    "terjemahan": "Allah berfirman: \"Kami akan menguatkan tenaga dan daya-usahamu dengan saudaramu (Harun), dan Kami akan memberikan kuasa kemenangan kepada kamu berdua oleh itu mereka tidak akan sampai kepada maksud membahayakan atau mengalahkan kamu. Dengan membawa ayat-ayat keterangan Kami itu, kamu berdua serta pengikut-pengikut kamu akan menang\"."
  },
  {
    "surah": 28,
    "ayat": 36,
    "terjemahan": "Setelah Nabi Musa datang kepada Firaun dan kaumnya dengan membawa ayat-ayat keterangan Kami yang terang nyata, mereka berkata: \"Apa yang engkau bawa ini hanyalah sihir yang dibuat-buat, dan kami tidak pernah mendengar tentang perkara ini dalam kalangan datuk nenek kami yang telah lalu\"."
  },
  {
    "surah": 28,
    "ayat": 37,
    "terjemahan": "Dan (bagi menjawabnya) Nabi Musa berkata: \"Tuhanku lebih mengetahui siapakah yang membawa hidayah petunjuk dari sisiNya dan siapa yang akan beroleh kesudahan yang baik di dunia ini. Sesungguhnya orang-orang yang zalim tidak akan berjaya\"."
  },
  {
    "surah": 28,
    "ayat": 38,
    "terjemahan": "Dan Firaun pula berkata: \"Wahai orang-orangku, aku tidak mengetahui ada bagi kamu sebarang tuhan yang lain daripadaku; oleh itu, wahai Haman, bakarkanlah untukku batu-bata, serta binalah untukku bangunan yang tinggi, supaya aku naik melihat Tuhan Musa (yang dikatakannya itu); dan sesungguhnya aku percaya adalah Musa dari orang-orang yang berdusta\"."
  },
  {
    "surah": 28,
    "ayat": 39,
    "terjemahan": "Dan berlaku sombong takburlah Firaun dan tenteranya di negeri itu dengan tiada alasan yang benar, dan mereka menyangka bahawa mereka tidak akan dikembalikan kepada Kami."
  },
  {
    "surah": 28,
    "ayat": 40,
    "terjemahan": "Dengan sebab itu Kami mengepungnya bersama-sama tenteranya serta Kami humbankan mereka ke dalam laut; maka perhatikanlah bagaimana buruknya kesudahan orang-orang yang zalim."
  },
  {
    "surah": 28,
    "ayat": 41,
    "terjemahan": "Dan Kami jadikan mereka ketua-ketua (dalam kesesatan) yang mengajak ke neraka (dengan kekufurannya), dan pada hari kiamat pula mereka tidak mendapat sebarang pertolongan."
  },
  {
    "surah": 28,
    "ayat": 42,
    "terjemahan": "Dan Kami iringi mereka dengan laknat di dunia ini, dan pada hari kiamat pula adalah mereka dari orang-orang yang tersingkir (dari rahmat Kami) dengan sehina-hinanya."
  },
  {
    "surah": 28,
    "ayat": 43,
    "terjemahan": "Dan demi sesungguhnya, Kami berikan kepada Nabi Musa Kitab Taurat sesudah Kami binasakan kaum-kaum yang telah lalu, untuk membuka hati dan menjadi hidayah petunjuk serta membawa rahmat, semoga mereka beringat."
  },
  {
    "surah": 28,
    "ayat": 44,
    "terjemahan": "Dan engkau (wahai Muhammad) tidak ada di sebelah barat (tempat Nabi Musa menerima wahyu) ketika Kami sempurnakan penyerahan Kitab Taurat kepadanya, dan engkau juga tidak termasuk dalam golongan yang menyaksikan peristiwa itu."
  },
  {
    "surah": 28,
    "ayat": 45,
    "terjemahan": "Akan tetapi (engkau hanya mengetahui kisah itu dengan jalan Kami memberi wahyu kenabian kepadamu disebabkan) Kami telah mengadakan beberapa umat (dari zaman Nabi Musa hingga ke zamanmu) sampai berlanjutanlah masa yang mereka lalui (serta kucar-kacirlah ugama yang mereka anuti). Dan engkau pula tidak pernah tinggal bersama-sama penduduk negeri Madyan membaca dan mempelajari dari mereka ayat-ayat keterangan Kami (tentang hal Nabi Musa di sana), tetapi Kamilah yang mengutusmu (menjadi Rasul dan memberi wahyu kepadamu mengenai hal itu)."
  },
  {
    "surah": 28,
    "ayat": 46,
    "terjemahan": "Dan engkau juga tidak berada dekat Gunung Tursina ketika Kami menyeru (Nabi Musa dan memberi wahyu kepadanya dahulu), tetapi (diturunkan) rahmat (Al-Quran) dari Tuhanmu (menerangkan Kisah itu) supaya engkau memberi amaran kepada kaum (mu) yang telah lama tidak didatangi sebarang Rasul pemberi amaran sebelummu, semoga mereka beroleh pengajaran (serta insaf mematuhinya)."
  },
  {
    "surah": 28,
    "ayat": 47,
    "terjemahan": "Dan kalau tidaklah orang-orang musyrik itu akan berkata - semasa mereka ditimpa bala bencana disebabkan perbuatan kufur dan maksiat yang mereka lakukan: \"Wahai Tuhan kami, mengapa Engkau tidak mengutuskan kepada Kami seorang Rasul supaya kami menurut ayat-ayat keteranganMu (yang dibawanya), dan supaya kami menjadi dari orang-orang yang beriman, \" (tentulah engkau wahai Muhammad tidak diutuskan kepada mereka, bahkan Kami terus menyeksa mereka)."
  },
  {
    "surah": 28,
    "ayat": 48,
    "terjemahan": "Maka ketika datang kepada mereka kebenaran (Al-Quran) dari sisi Kami, mereka berkata pula: \"Hendaknya (Muhammad) diberi (Kitab ugama yang diturunkan dengan sekaligus) sebagaimana Kitab Taurat yang diberikan kepada Musa\". Bukankah mereka dahulu telah kufur ingkar akan apa yang diberikan kepada Nabi Musa? Mereka berkata lagi: \"Kedua-duanya (Al-Quran dan Taurat) itu ialah sihir yang saling membantu (yang satu menyokong yang lain). \"Dan mereka berkata pula: \"Sesungguhnya kami kufur ingkar terhadap Kitab-kitab itu semuanya!\""
  },
  {
    "surah": 28,
    "ayat": 49,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Kalau demikianlah sikap kamu maka bawalah sebuah Kitab dari sisi Allah yang dapat memberi panduan lebih daripada keduanya, supaya aku menurutnya. (Bawalah dia) jika betul kamu orang-orang yang benar \"."
  },
  {
    "surah": 28,
    "ayat": 50,
    "terjemahan": "Kemudian, kalau mereka tidak dapat menerima cabaranmu (wahai Muhammad), maka ketahuilah, sesungguhnya mereka hanyalah menurut hawa nafsu mereka; dan tidak ada yang lebih sesat daripada orang yang menurut hawa nafsunya dengan tidak berdasarkan hidayah petunjuk dari Allah. Sesungguhnya Allah tidak memberi pimpinan kepada kaum yang zalim (yang berdegil dalam keingkarannya)."
  },
  {
    "surah": 28,
    "ayat": 51,
    "terjemahan": "Dan demi sesungguhnya Kami telah hubungkan turunnya firman-firman Kami (Al-Quran) dengan berturut-turut kepada mereka, supaya mereka beroleh peringatan (lalu beriman)."
  },
  {
    "surah": 28,
    "ayat": 52,
    "terjemahan": "Orang-orang yang Kami beri Kitab sebelum turunnya Al-Quran, mereka beriman kepadanya."
  },
  {
    "surah": 28,
    "ayat": 53,
    "terjemahan": "Dan apabila Al-Quran itu dibacakan kepada mereka; mereka, berkata: \"Kami beriman kepadanya, sesungguhnya ia adalah perkara yang betul benar dari Tuhan kami; sesungguhnya kami sebelum ia diturunkan, telahpun mematuhinya \"."
  },
  {
    "surah": 28,
    "ayat": 54,
    "terjemahan": "Mereka itu akan beroleh pahala dua kali disebabkan kesabaran mereka; dan juga kerana mereka menolak kejahatan dengan kebaikan, dan mereka menderma dari apa yang Kami kurniakan kepada mereka."
  },
  {
    "surah": 28,
    "ayat": 55,
    "terjemahan": "Dan apabila mereka mendengar perkataan yang sia-sia, mereka berpaling daripadanya sambil berkata: \"Bagi kami amal kami dan bagi kamu pula amal kamu; selamat tinggalah kamu; kami tidak ingin berdamping dengan orang-orang yang jahil\"."
  },
  {
    "surah": 28,
    "ayat": 56,
    "terjemahan": "Sesungguhnya engkau (wahai Muhammad) tidak berkuasa memberi hidayah petunjuk kepada sesiapa yang engkau kasihi (supaya ia menerima Islam), tetapi Allah jualah yang berkuasa memberi hidayah petunjuk kepada sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya); dan Dia lah jua yang lebih mengetahui akan orang-orang yang (ada persediaan untuk) mendapat hidayah petunjuk (kepada memeluk Islam)."
  },
  {
    "surah": 28,
    "ayat": 57,
    "terjemahan": "Dan mereka (yang kafir) berkata: \"Kalau kami menyertaimu menurut petunjuk yang engkau bawa itu, nescaya kami dengan serta merta ditangkap dan diusir dari negeri kami (oleh golongan yang menentang)\". Mengapa mereka (berkata demikian)? Bukankah kami telah melindungi mereka dan menjadikan (negeri Makkah) tempat tinggal mereka sebagai tanah suci yang aman, yang dibawa kepadanya hasil tanaman dari segala jenis, sebagai rezeki pemberian dari sisi Kami? (Benar, Kami telah menjadikan semuanya itu), tetapi kebanyakan mereka tidak memikirkan perkara itu untuk mengetahuinya (serta bersyukur)."
  },
  {
    "surah": 28,
    "ayat": 58,
    "terjemahan": "Dan berapa banyak Kami binasakan negeri-negeri yang penduduknya telah berlaku sombong dan tidak bersyukur dalam kehidupannya (yang serba mewah dan senang lenang). Maka itulah dia tempat-tempat tinggal mereka terbiar tidak didiami orang sesudah mereka (dibinasakan), kecuali sedikit sahaja dan sesungguhnya Kamilah yang mewarisi mereka."
  },
  {
    "surah": 28,
    "ayat": 59,
    "terjemahan": "Dan tidaklah menjadi kebiasaan Tuhanmu membinasakan mana-mana negeri sebelum Ia mengutus ke ibu negeri itu seorang Rasul yang akan membacakan kepada penduduknya ayat-ayat keterangan Kami; dan tidaklah menjadi kebiasaan Kami membinasakan mana-mana negeri melainkan setelah penduduknya berlaku zalim."
  },
  {
    "surah": 28,
    "ayat": 60,
    "terjemahan": "Dan apa jua (harta benda dan lain-lainnya) yang diberikan kepada kamu, maka adalah ia merupakan kesenangan hidup di dunia dan perhiasannya; dalam pada itu, apa jua yang ada di sisi Allah (yang disediakan untuk orang-orang yang beriman dan taat) adalah ia lebih baik dan lebih kekal; maka mengapa kamu tidak mahu memahaminya?"
  },
  {
    "surah": 28,
    "ayat": 61,
    "terjemahan": "(Jika sudah diketahui yang demikian) maka adakah orang yang Kami janjikan kepadanya janji yang baik (balasan Syurga) lalu ia mendapatnya, sama seperti orang yang kami kurniakan menikmati kesenangan hidup di dunia kemudian ia pada hari kiamat termasuk dalam golongan yang dibawa (untuk menerima azab neraka)?"
  },
  {
    "surah": 28,
    "ayat": 62,
    "terjemahan": "Dan pada hari (kiamat itu) Allah menyeru mereka lalu bertanya:\" Mana dia sekutu-sekutuKu, yang kamu anggap mereka (menjadi tuhan dan dapat memberikan pertolongan)?\""
  },
  {
    "surah": 28,
    "ayat": 63,
    "terjemahan": "Mereka yang berhak menerima hukuman (azab neraka) berkata: \"Wahai Tuhan kami, inilah mereka yang kami menyebabkan kesesatannya, kami menyebabkan mereka sesat (dengan pilihan mereka sendiri) sebagaimana kami telah sesat (dengan pilihan kami sendiri); (dengan ini) kami mengakui kepadaMu bahawa kami berlepas diri (dari kekufuran mereka). Bukanlah Kami yang mereka puja dan taati, (bahkan mereka hanya memuja dan mentaati hawa nafsu mereka sendiri)\"."
  },
  {
    "surah": 28,
    "ayat": 64,
    "terjemahan": "Dan dikatakan (kepada mereka): Panggilah makhluk-makhluk dan benda-benda yang kamu jadikan sekutu Allah (untuk menolong kamu)\". lalu mereka memanggilnya, tetapi makhluk-makhluk dan benda-benda itu tidak menyahut panggilan mereka; dan mereka tetap melihat azab (dengan merasa sesal) serta bercita-cita kalaulah mereka di dunia dahulu menurut petunjuk."
  },
  {
    "surah": 28,
    "ayat": 65,
    "terjemahan": "Dan pada hari (kiamat itu) Allah menyeru mereka lalu bertanya: \"Apa jawab kamu kepada Rasul-rasul yang diutus kepada kamu dahulu?"
  },
  {
    "surah": 28,
    "ayat": 66,
    "terjemahan": "Maka gelaplah kepada mereka, pada hari itu, segala khabar berita dan peristiwa (yang telah lalu), serta menjadilah mereka tidak dapat hendak bertanya-tanyaan sesama sendiri."
  },
  {
    "surah": 28,
    "ayat": 67,
    "terjemahan": "(Demikianlah akibat orang-orang derhaka), adapun orang yang bertaubat dan beriman serta beramal soleh, maka semoga akan menjadilah ia dari orang-orang yang berjaya."
  },
  {
    "surah": 28,
    "ayat": 68,
    "terjemahan": "Dan Tuhanmu menciptakan apa yang dirancangkan berlakunya, dan Dia lah juga yang memilih (satu-satu dari makhlukNya untuk sesuatu tugas atau keutamaan dan kemuliaan); tidaklah layak dan tidaklah berhak bagi sesiapapun memilih (selain dari pilihan Allah). Maha Suci Allah dan Maha Tinggilah keadaanNya dari apa yang mereka sekutukan denganNya."
  },
  {
    "surah": 28,
    "ayat": 69,
    "terjemahan": "Dan Tuhanmu mengetahui akan apa yang terpendam dalam hati mereka dan apa yang mereka zahirkan."
  },
  {
    "surah": 28,
    "ayat": 70,
    "terjemahan": "Dan Dia lah Allah tiada Tuhan melainkan Dia. Segala puji tertentu bagiNya, di dunia dan di akhirat; dan hanyalah Dia yang berkuasa menghukum, serta kepadaNyalah kamu semua dikembalikan."
  },
  {
    "surah": 28,
    "ayat": 71,
    "terjemahan": "Katakanlah: \"Bagaimana fikiran kamu jika Allah menjadikan malam kepada kamu tetap selama-lamanya hingga ke hari kiamat; tuhan yang manakah yang lain dari Allah, yang dapat membawakan cahaya yang menerangi kepada kamu? Maka mengapa kamu tidak mahu mendengar (secara memahami dan menerima kebenaran)?\""
  },
  {
    "surah": 28,
    "ayat": 72,
    "terjemahan": "katakanlah lagi: Bagaimana fikiran kamu jika Allah menjadikan siang kepada kamu tetap selama-lamanya hingga ke hari kiamat; tuhan yang manakah yang lain dari Allah, yang dapat membawakan malam kepada kamu untuk kamu berehat padanya? Maka mengapa kamu tidak mahu melihat (dalil-dalil dan bukti keesaan dan kekuasaan Allah)?\""
  },
  {
    "surah": 28,
    "ayat": 73,
    "terjemahan": "Dan di antara rahmat pemberianNya, Ia menjadikan untuk kamu malam dan siang (silih berganti supaya kamu berehat padanya dan supaya kamu berusaha mencari rezeki dari limpah kurniaNya, dan juga supaya kamu bersyukur."
  },
  {
    "surah": 28,
    "ayat": 74,
    "terjemahan": "Dan (ingatlah) pada hari (kiamat), Allah akan menyeru mereka lalu bertanya: \"Mana dia sekutu-sekutuKu yang kamu sifatkan mereka (menjadi tuhan dan dapat memberikan pertolongan)?\""
  },
  {
    "surah": 28,
    "ayat": 75,
    "terjemahan": "Dan (pada hari itu) Kami keluarkan dari tiap-tiap umat seorang saksi, lalu Kami katakan (kepada golongan yang kafir): \"Bawalah keterangan dan bukti kebenaran kamu\". Maka (pada saat itu) ketahuilah mereka bahawa kebenaran (hak ketuhanan) itu tertentu bagi Allah, dan (dengan itu), hilang lenyaplah dari mereka apa yang mereka ada-adakan secara dusta dahulu."
  },
  {
    "surah": 28,
    "ayat": 76,
    "terjemahan": "Sesungguhnya Qarun adalah ia dari kaum Nabi Musa, kemudian ia berlaku sombong dan zalim terhadap mereka; dan Kami telah mengurniakannya dari berbagai jenis kekayaan yang anak-anak kuncinya menjadi beban yang sungguh berat untuk dipikul oleh sebilangan orang yang kuat sasa. (Ia berlaku sombong) ketika kaumnya berkata kepadanya: \"Janganlah engkau bermegah-megah (dengan kekayaanmu), sesungguhnya Allah tidak suka kepada orang-orang yang bermegah-megah. (seperti lagakmu itu)."
  },
  {
    "surah": 28,
    "ayat": 77,
    "terjemahan": "\"Dan tuntutlah dengan harta kekayaan yang telah dikurniakan Allah kepadamu akan pahala dan kebahagiaan hari akhirat dan janganlah engkau melupakan bahagianmu (keperluan dan bekalanmu) dari dunia; dan berbuat baiklah (kepada hamba-hamba Allah) sebagaimana Allah berbuat baik kepadamu (dengan pemberian nikmatNya yang melimpah-limpah); dan janganlah engkau melakukan kerosakan di muka bumi; sesungguhnya Allah tidak suka kepada orang-orang yang berbuat kerosakan \"."
  },
  {
    "surah": 28,
    "ayat": 78,
    "terjemahan": "Qarun menjawab (dengan sombongnya): \"Aku diberikan harta kekayaan ini hanyalah disebabkan pengetahuan dan kepandaian yang ada padaku\". (Kalaulah Qarun bijak pandai) tidakkah ia mengetahui dan pandai memahami, bahawa Allah telah membinasakan sebelumnya, dari umat-umat yang telah lalu, orang-orang yang lebih kuat daripadanya dan lebih banyak mengumpulkan harta kekayaan ? Dan (ingatlah) orang-orang yang berdosa (apabila mereka diseksa) tidak lagi ditanya tentang dosa-dosa mereka, (kerana Allah sedia mengetahuinya)."
  },
  {
    "surah": 28,
    "ayat": 79,
    "terjemahan": "Kemudian Qarun keluar kepada kaumnya dengan memakai perhiasannya. (Pada saat itu) berkatalah orang-orang yang semata-mata inginkan kesenangan kehidupan dunia: \"Alangkah baiknya kalau kita ada kekayaan seperti yang didapati oleh Qarun! Sesungguhnya dia adalah seorang yang bernasib baik\"."
  },
  {
    "surah": 28,
    "ayat": 80,
    "terjemahan": "Dan berkata pula orang-orang yang diberi ilmu (di antara mereka): \"Janganlah kamu berkata demikian, pahala dari Allah lebih baik bagi orang yang beriman dan beramal soleh; dan tidak akan dapat menerima (pahala yang demikian) itu melainkan orang-orang yang sabar\"."
  },
  {
    "surah": 28,
    "ayat": 81,
    "terjemahan": "Lalu Kami timbuskan dia bersama-sama dengan rumahnya di dalam tanah, maka tidaklah ia mendapat sebarang golongan yang boleh menolongnya dari azab Allah\" dan ia pula tidak dapat menolong dirinya sendiri."
  },
  {
    "surah": 28,
    "ayat": 82,
    "terjemahan": "Dan orang-orang yang pada masa dahulu bercita-cita mendapat kekayaan seperti Qarun - mulai sedar sambil berkata: \"Wah! Sesungguhnya Allah memewahkan rezeki bagi sesiapa yang dikehendakiNya dari hamba-hambaNya, dan Dia lah juga yang menyempitkannya kalau tidak kerana Allah memberi pertolongan kepada kita tentulah kita akan dibinasakan dengan tertimbus di dalam tanah (seperti Qarun). Aduhai! Sesungguhnya orang-orang yang kufurkan nikmat Allah itu tidak akan berjaya!\""
  },
  {
    "surah": 28,
    "ayat": 83,
    "terjemahan": "Negeri akhirat (yang telah diterangkan nikmat-nikmatnya) itu, Kami sediakan bagi orang-orang yang tidak bertujuan hendak mendapat pengaruh atau kelebihan di muka bumi dan tidak ingat hendak melakukan kerosakan; dan kesudahan yang baik adalah bagi orang-orang yang bertaqwa."
  },
  {
    "surah": 28,
    "ayat": 84,
    "terjemahan": "Sesiapa yang datang membawa amal baik (pada hari akhirat) maka baginya balasan yang lebih baik daripadanya; dan sesiapa yang datang membawa amal jahat, maka mereka yang melakukan kejahatan tidak di balas melainkan dengan apa yang mereka kerjakan."
  },
  {
    "surah": 28,
    "ayat": 85,
    "terjemahan": "Sesungguhnya Allah yang mewajibkan kepadamu (beramal dan menyampaikan) Al-Quran (wahai Muhammad) sudah tentu akan menyampaikan engkau lagi kepada apa yang engkau ingini dan cintai. Katakanlah (kepada kaum yang menentangmu): \"Tuhanku amat mengetahui akan sesiapa yang membawa hidayah petunjuk dan sesiapa pula yang berada dalam kesesatan yang nyata \"."
  },
  {
    "surah": 28,
    "ayat": 86,
    "terjemahan": "Dan engkau (wahai Muhammad) tidak pernah berharap supaya Kitab Al-Qufsran ini diturunkan kepadamu, (tetapi ia diturunkan kepadamu) hanyalah sebagai rahmat dari Tuhanmu, oleh itu janganlah engkau menjadi orang-orang kafir."
  },
  {
    "surah": 28,
    "ayat": 87,
    "terjemahan": "Dan janganlah mereka (yang ingkar) dapat menghalangmu (daripada menyampaikan dan beramal dengan) ayat-ayat Allah sesudah ia diturunkan kepadamu; dan serulah manusia kepada (ugama) Tuhanmu; dan janganlah engkau menjadi dari golongan yang menyertai orang-orang musyrik."
  },
  {
    "surah": 28,
    "ayat": 88,
    "terjemahan": "Dan janganlah engkau menyembah tuhan yang lain bersama-sama Allah. Tiada Tuhan melainkan Dia. Tiap-tiap sesuatu akan binasa melainkan Zat Allah. BagiNyalah kuasa memutuskan segala hukum, dan kepadaNyalah kamu semua dikembalikan (untuk dihitung amal masing-masing dan menerima balasan)."
  },
  {
    "surah": 29,
    "ayat": 1,
    "terjemahan": "Alif, Laam, Miim."
  },
  {
    "surah": 29,
    "ayat": 2,
    "terjemahan": "Patutkah manusia menyangka bahawa mereka akan dibiarkan dengan hanya berkata: \"Kami beriman\", sedang mereka tidak diuji (dengan sesuatu cubaan)?"
  },
  {
    "surah": 29,
    "ayat": 3,
    "terjemahan": "Dan demi sesungguhnya! Kami telah menguji orang-orang yang terdahulu daripada mereka, maka (dengan ujian yang demikian), nyata apa yang diketahui Allah tentang orang-orang yang sebenar-benarnya beriman, dan nyata pula apa yang diketahuiNya tentang orang-orang yang berdusta."
  },
  {
    "surah": 29,
    "ayat": 4,
    "terjemahan": "Bahkan patutkah orang-orang yang melakukan kejahatan menyangka bahawa mereka akan terlepas dari azab Kami? Amatlah buruk apa yang mereka hukumkan itu."
  },
  {
    "surah": 29,
    "ayat": 5,
    "terjemahan": "Sesiapa yang percaya akan pertemuannya dengan Allah (untuk menerima balasan), maka sesungguhnya masa yang telah ditetapkan oleh Allah itu akan tiba (dengan tidak syak lagi); dan Allah jualah Yang Maha Mendengar, lagi Maha Mengetahui."
  },
  {
    "surah": 29,
    "ayat": 6,
    "terjemahan": "Dan sesiapa yang berjuang (menegakkan Islam) maka sesungguhnya dia hanyalah berjuang untuk kebaikan dirinya sendiri; sesungguhnya Allah Maha Kaya (tidak berhajatkan sesuatupun) daripada sekalian makhluk."
  },
  {
    "surah": 29,
    "ayat": 7,
    "terjemahan": "Dan orang-orang yang beriman serta beramal soleh sesungguhnya Kami akan hapuskan dari mereka kesalahan-kesalahan mereka, dan Kami akan membalas apa yang mereka telah kerjakan - dengan sebaik-baik balasan."
  },
  {
    "surah": 29,
    "ayat": 8,
    "terjemahan": "Dan Kami wajibkan manusia berbuat baik kepada kedua ibu bapanya; dan jika mereka berdua mendesakmu supaya engkau mempersekutukan Daku (dalam ibadatmu) dengan sesuatu yang engkau tidak mempunyai pengetahuan mengenainya, maka janganlah engkau taat kepada mereka. Kepada Akulah tempat kembali kamu semuanya, kemudian Aku akan menerangkan kepada kamu segala yang kamu telah kerjakan."
  },
  {
    "surah": 29,
    "ayat": 9,
    "terjemahan": "Dan orang-orang yang beriman serta beramal soleh, sudah tentu Kami akan masukkan mereka dalam kumpulan orang-orang yang soleh (dengan mendapat sebaik-baik balasan)."
  },
  {
    "surah": 29,
    "ayat": 10,
    "terjemahan": "Dan ada sebahagian dari manusia yang berkata: \"Kami beriman kepada Allah\"; kemudian apabila ia diganggu dan disakiti pada jalan Allah, ia jadikan gangguan manusia itu seperti azab seksa Allah (lalu ia taatkan manusia). Dan jika datang pertolongan dari Tuhanmu memberi kemenangan kepadamu, mereka sudah tentu akan berkata: \"Kami adalah sentiasa bersama-sama kamu\". (Mengapa mereka berdusta?) Bukankah Allah lebih mengetahui akan apa yang terpendam dalam hati sekalian makhluk?"
  },
  {
    "surah": 29,
    "ayat": 11,
    "terjemahan": "Dan sesungguhnya Allah mengetahui akan orang-orang yang beriman, dan sesungguhnya Ia mengetahui akan orang-orang yang munafik."
  },
  {
    "surah": 29,
    "ayat": 12,
    "terjemahan": "Dan berkata pula orang-orang yang kufur ingkar kepada orang-orang yang beriman: \"Ikutlah jalan ugama kami, dan kami sedia menanggung kesalahan-kesalahan kamu (kalau kamu mengira perbuatan itu salah)\". Padahal mereka tidak akan dapat menanggung kesalahan orang-orang yang bersalah itu sedikitpun, dan sesungguhnya mereka adalah berdusta."
  },
  {
    "surah": 29,
    "ayat": 13,
    "terjemahan": "Dan sesungguhnya mereka akan menanggung beban-beban dosa mereka dan beban-beban (dosa orang-orang yang mereka sesatkan) bersama-sama dengan beban-beban dosa mereka sendiri; dan sesungguhnya mereka akan ditanya pada hari kiamat kelak tentang apa yang mereka pernah ada-adakan secara dusta itu."
  },
  {
    "surah": 29,
    "ayat": 14,
    "terjemahan": "Dan sesungguhnya Kami telah mengutus Nabi Nuh kepada kaumnya, maka tinggalah ia dalam kalangan mereka selama sembilan ratus lima puluh tahun; akhirnya mereka dibinasakan oleh taufan sedang mereka berkeadaan zalim (dengan kufur derhaka)."
  },
  {
    "surah": 29,
    "ayat": 15,
    "terjemahan": "Maka dengan itu Kami selamatkan dia dan pengikut-pengikutnya yang turut bersama dalam bahtera, dan Kami jadikan bahtera itu satu tanda (yang membuktikan kekuasaan Kami dan memberi pengajaran insaf) kepada sekalian makhluk."
  },
  {
    "surah": 29,
    "ayat": 16,
    "terjemahan": "Dan (sebutkanlah peristiwa) Nabi Ibrahim, ketika ia berkata kepada kaumnya: \"Sembahlah kamu akan Allah dan bertaqwalah kepadaNya; yang demikian itu adalah baik bagi kamu jika kamu tahu (membezakan yang baik dari yang buruk)."
  },
  {
    "surah": 29,
    "ayat": 17,
    "terjemahan": "\"Kamu hanyalah menyembah berhala-berhala yang diperbuat oleh orang, tidak menyembah Allah yang mencipta segala-galanya, dan kamu hanya mengadakan penyembahan yang dusta. Sesungguhnya mereka yang kamu sembah yang lain dari Allah itu, tidak berkuasa memberi rezeki kepada kamu; oleh itu carilah rezeki dari sisi Allah, dan sembahlah akan Dia, serta bersyukurlah kepadaNya; (ingatlah), kepada Allah jualah kamu akan dikembalikan."
  },
  {
    "surah": 29,
    "ayat": 18,
    "terjemahan": "\"Dan jika kamu terus-menerus mendustakan (ajaran ugama Allah yang aku sampaikan kepada kamu), maka sesungguhnya umat-umat yang sebelum kamu telah juga mendustakan (Rasul-rasulnya); dan (ingatlah) tugas Rasul hanya menyampaikan dengan penjelasan yang terang nyata\"."
  },
  {
    "surah": 29,
    "ayat": 19,
    "terjemahan": "Tidakkah mereka melihat dan memikirkan bagaimana Allah mencipta makhluk-makhluk pada mulanya, kemudian Ia akan mengembalikannya (hidup semula sesudah matinya)? Sesungguhnya yang demikian itu amatlah mudah bagi Allah."
  },
  {
    "surah": 29,
    "ayat": 20,
    "terjemahan": "Katakanlah: \"Mengembaralah kamu di muka bumi, serta lihatlah bagaimana Allah telah memulakan ciptaan makhluk-makhluk dari asal jadinya; kemudian Allah akan memulakan ciptaan itu semula (pada hari akhirat) dalam bentuk kejadian yang baharu. Sesungguhnya Allah Maha Kuasa atas tiap-tiap sesuatu."
  },
  {
    "surah": 29,
    "ayat": 21,
    "terjemahan": "\"Ia menyeksa sesiapa yang dikehendakiNya (iaitu orang-orang yang ingkar), dan Ia juga yang memberi rahmat kepada sesiapa yang dikehendakiNya (iaitu orang-orang yang beriman); dan kepadaNyalah kamu semua akan dikembalikan (untuk menerima balasan)."
  },
  {
    "surah": 29,
    "ayat": 22,
    "terjemahan": "\"Dan kamu tidak akan dapat melepaskan diri (dari kekuasaan Allah) di bumi dan tidak juga di langit (sekalipun); dan kamu tidak akan mendapat sebarang pelindung dan penolong yang lain dari Allah\"."
  },
  {
    "surah": 29,
    "ayat": 23,
    "terjemahan": "Dan orang-orang yang kufur ingkar akan ayat-ayat keterangan Allah dan pertemuan denganNya, mereka tetaplah akan menjadi orang-orang yang putus asa dari rahmatKu; dan mereka pula akan beroleh azab seksa yang tidak terperi sakitnya."
  },
  {
    "surah": 29,
    "ayat": 24,
    "terjemahan": "Kemudian, seruan Nabi Ibrahim tidak dijawab oleh kaumnya melainkan dengan kata-kata (tentangan yang keras): \"Bunuhlah dia atau bakarlah dia\". Maka Allah selamatkan Nabi Ibrahim dari api (yang disediakan oleh kaumnya). Sesungguhnya peristiwa yang demikian, mengandungi tanda-tanda (yang membuktikan kekuasaan Allah) bagi kaum yang (mahu) beriman."
  },
  {
    "surah": 29,
    "ayat": 25,
    "terjemahan": "Dan Nabi Ibrahim berkata pula (kepada kaumnya): \"Perbuatan kamu menyembah berbagai berhala, tidak menyembah Allah itu, hanyalah kerana menjaga hubungan kasih mesra di antara kamu masing-masing dalam kehidupan dunia ini; kemudian pada hari kiamat kelak setengah kamu akan membantah setengahnya yang lain, dan setengah kamu pula akan melaknatkan setengahnya yang lain; dan (kesudahannya) tempat kembali kamu ialah neraka, dan kamu tidak akan beroleh sesiapapun yang dapat memberikan pertolongan\"."
  },
  {
    "surah": 29,
    "ayat": 26,
    "terjemahan": "Setelah itu Lut beriman kepadanya dan Nabi Ibrahim pun berkata: \"Aku hendak berhijrah kepada TuhanKu, sesungguhnya Dia lah jua Yang Maha Kuasa, lagi Maha Bijaksana\"."
  },
  {
    "surah": 29,
    "ayat": 27,
    "terjemahan": "Dan Kami kurniakan kepadanya: Ishak (anaknya) dan Yaakub (cucunya); dan Kami jadikan dalam kalangan keturunannya orang-orang yang berpangkat Nabi dan menerima Kitab-kitab ugama; dan Kami berikan balasannya yang baik di dunia; dan sesungguhnya adalah ia, pada hari akhirat, dari orang-orang yang soleh."
  },
  {
    "surah": 29,
    "ayat": 28,
    "terjemahan": "Dan (ingatkanlah peristiwa) Nabi Lut tatkata ia berkata kepada kaumnya: \"Sesungguhnya kamu melakukan perbuatan yang keji, yang tidak pernah dilakukan oleh seorangpun dari penduduk alam ini sebelum kamu."
  },
  {
    "surah": 29,
    "ayat": 29,
    "terjemahan": "\"Patutkah kamu mendatangi orang lelaki (untuk memuaskan nafsu syahwat kamu)? Dan kamu memotong jalan lalu-lalang (untuk tujuan jahat kamu)? Dan kamu pula melakukan perbuatan yang mungkar di tempat-tempat perhimpunan kamu?\" Maka kaumnya tidak menjawab selain daripada berkata (secara mengejek-ejek): \"Datangkanlah kepada kami azab dari Allah (yang engkau janjikan itu) jika betul engkau dari orang-orang yang benar\"."
  },
  {
    "surah": 29,
    "ayat": 30,
    "terjemahan": "Nabi Lut berdoa dengan berkata: \"Wahai Tuhanku, tolonglah daku terhadap kaum yang melakukan kerosakan (menderhaka)\"."
  },
  {
    "surah": 29,
    "ayat": 31,
    "terjemahan": "Dan ketika datang (malaikat) utusan kami kepada Nabi Ibrahim dengan membawa berita yang mengembirakan), mereka berkata: \"Sebenarnya kami hendak membinasakan penduduk bandar ini), sesungguhnya penduduknya adalah orang-orang yang zalim\"."
  },
  {
    "surah": 29,
    "ayat": 32,
    "terjemahan": "Nabi Ibrahim berkata: \"Sebenarnya Lut ada di bandar itu\". Mereka menjawab: \"Kami mengetahui akan orang-orang yang tinggal di situ. Sesungguhnya kami akan menyelamatkan dia dan keluarganya (serta pengikut-pengikutnya) - kecuali isterinya, ia adalah dari orang-orang yang dibinasakan\"."
  },
  {
    "surah": 29,
    "ayat": 33,
    "terjemahan": "Dan ketika datang utusan-utusan Kami kepada Nabi Lut, ia merasa dukacita dengan kedatangan mereka, dan merasa tidak terdaya untuk mengawal mereka (dari gangguan kaumnya); dan (setelah melihatkan halnya yang demikian), utusan-utusan itu berkata: \"Janganlah engkau takut dan janganlah berdukacita, sesungguhnya kami akan menyelamatkanmu dan keluargamu (serta pengikut-pengikutmu) - kecuali isterimu, ia adalah dari orang-orang yang dibinasakan."
  },
  {
    "surah": 29,
    "ayat": 34,
    "terjemahan": "\"Sesungguhnya kami (diutuskan) untuk menurunkan atas penduduk bandar ini azab dari langit, disebabkan mereka melakukan kejahatan (kufur dan maksiat)\"."
  },
  {
    "surah": 29,
    "ayat": 35,
    "terjemahan": "Dan demi sesungguhnya, Kami telah (binasakan bandar itu dan telah) tinggalkan bekas-bekasnya sebagai satu tanda (yang mendatangkan iktibar) bagi orang-orang yang mahu memahaminya."
  },
  {
    "surah": 29,
    "ayat": 36,
    "terjemahan": "Dan (Kami utuskan) kepada penduduk Madyan saudara mereka: Nabi Syuaib; lalu ia berkata: \"Wahai kaumku, sembahlah kamu akan Allah, dan kerjakanlah amal soleh dengan mengharapkan pahala akhirat, dan janganlah kamu melakukan kerosakan di bumi\"."
  },
  {
    "surah": 29,
    "ayat": 37,
    "terjemahan": "Maka mereka mendustakannya, lalu mereka dibinasakan oleh gempa bumi, serta menjadilah mereka mayat-mayat yang tersungkur di tempat tinggal masing-masing."
  },
  {
    "surah": 29,
    "ayat": 38,
    "terjemahan": "Dan (ingatkanlah peristiwa kebinasaan) Aad (kaum nabi Hud) dan Thamud (kaum Nabi Soleh); dan telahpun ternyata kepada kamu sebahagian dari bekas-bekas tempat kediaman mereka; dan (kebinasaan mereka yang demikian ialah disebabkan) Syaitan memperelokkan pada pandangan mereka: amal-amal mereka (yang jahat itu), lalu ia menghalangi mereka dari jalan Allah; padahal mereka orang-orang yang bijak pandai dan berakal (yang dapat membezakan yang benar dan yang salah)."
  },
  {
    "surah": 29,
    "ayat": 39,
    "terjemahan": "Dan (ingatkanlah juga peristiwa kebinasaan) Qarun dan Firaun serta Haman. Dan demi sesungguhnya Nabi Musa telah datang kepada mereka membawa keterangan-keterangan (mukjizat) yang jelas nyata, lalu mereka berlaku sombong takbur di bumi (mendustakannya), padahal mereka tidak dapat melepaskan diri (dari azab Allah)."
  },
  {
    "surah": 29,
    "ayat": 40,
    "terjemahan": "Maka masing-masing Kami binasakan dengan sebab dosanya, iaitu di antaranya ada yang Kami hantarkan angin ribut menghujaninya dengan batu; dan ada yang dibinasakan dengan letusan suara yang menggempakan bumi; dan ada yang Kami timbuskan dia di bumi; dan ada pula yang Kami tenggelamkan di laut. Dan (ingatlah) Allah tidak sekali-kali menganiaya mereka, akan tetapi merekalah yang menganiaya diri sendiri."
  },
  {
    "surah": 29,
    "ayat": 41,
    "terjemahan": "Misal bandingan orang-orang yang menjadikan benda-benda yang lain dari Allah sebagai pelindung-pelindung (yang diharapkan pertolongannya) adalah seperti labah-labah yang membuat sarang (untuk menjadi tempat perlindungannya); padahal sesungguhnya sarang-sarang yang paling reput ialah sarang labah-labah, kalaulah mereka orang-orang yang berpengetahuan."
  },
  {
    "surah": 29,
    "ayat": 42,
    "terjemahan": "Sesungguhnya Allah mengetahui (kepalsuan) apa jua yang mereka sembah yang lain daripadaNya, dan Allah jualah Yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 29,
    "ayat": 43,
    "terjemahan": "Dan misal-misal perbandingan yang demikian itu Kami kemukakan kepada umat manusia, dan hanya orang-orang yang berilmu yang dapat memahaminya."
  },
  {
    "surah": 29,
    "ayat": 44,
    "terjemahan": "Allah mencipta langit dan bumi dengan cara yang layak dan berhikmat; sesungguhnya yang demikian itu mengandungi satu tanda (yang membuktikan kebijaksanaan Allah) bagi orang-orang yang beriman."
  },
  {
    "surah": 29,
    "ayat": 45,
    "terjemahan": "Bacalah serta ikutlah (wahai Muhammad) akan apa yang diwahyukan kepadamu dari Al-Quran, dan dirikanlah sembahyang (dengan tekun); sesungguhnya sembahyang itu mencegah dari perbuatan yang keji dan mungkar; dan sesungguhnya mengingati Allah adalah lebih besar (faedahnya dan kesannya); dan (ingatlah) Allah mengetahui akan apa yang kamu kerjakan."
  },
  {
    "surah": 29,
    "ayat": 46,
    "terjemahan": "Dan janganlah kamu berbahas dengan Ahli Kitab melainkan dengan cara yang lebih baik, kecuali orang-orang yang berlaku zalim di antara mereka; dan katakanlah (kepada mereka): \"Kami beriman kepada (Al-Quran) yang diturunkan kepada kami dan kepada (Taurat dan Injil) yang diturunkan kepada kamu; dan Tuhan kami, juga Tuhan kamu, adalah Satu; dan kepadaNyalah, kami patuh dengan berserah diri.\""
  },
  {
    "surah": 29,
    "ayat": 47,
    "terjemahan": "Dan (sebagaimana Kami telah menurunkan Kitab-kitab ugama kepada Rasul-rasul yang telah lalu) demikianlah Kami turunkan pula kepadamu (wahai Muhammad) Kitab Al-Quran ini. Maka orang-orang yang Kami berikan Kitab (Taurat dan Injil) ada yang beriman kepada Al-Quran, dan juga sebahagian dari orang-orang (Makkah) beriman kepadanya; dan tiadalah yang mengingkari ayat-ayat keterangan Kami melainkan orang-orang yang berdegil dalam kekufurannya."
  },
  {
    "surah": 29,
    "ayat": 48,
    "terjemahan": "Dan engkau (wahai Muhammad) tidak pernah tahu membaca sesebuah kitab pun sebelum turunnya Al-Quran ini, dan tidak pula tahu menulisnya dengan tangan kananmu; (kalaulah engkau dahulu pandai membaca dan menulis) tentulah ada alasan bagi orang-orang kafir yang menentangmu akan merasa ragu-ragu (tentang kebenaranmu)."
  },
  {
    "surah": 29,
    "ayat": 49,
    "terjemahan": "(Al-Quran tetap datangnya dari Allah dengan tidak syak lagi) bahkan ia ayat-ayat keterangan yang jelas nyata, yang terpelihara di dalam dada orang-orang yang berilmu; dan tiadalah yang mengingkari ayat-ayat keterangan Kami melainkan orang-orang yang zalim."
  },
  {
    "surah": 29,
    "ayat": 50,
    "terjemahan": "Dan mereka berkata: \"Mengapa tidak diturunkan kepada (Muhammad) mukjizat-mukjizat dari Tuhannya?\" Jawablah (wahai Muhammad): \"Sesungguhnya (urusan menurunkan) mukjizat-mukjizat itu adalah tertentu bagi Allah, dan aku hanyalah seorang Rasul pemberi amaran yang jelas nyata\"."
  },
  {
    "surah": 29,
    "ayat": 51,
    "terjemahan": "(Patutkah mereka meminta mukjizat-mukjizat yang lain?) tidakkah cukup bagi mereka bahawa Kami telah menurunkan kepadamu Al-Quran yang dibacakan kepada mereka? Sesungguhnya Al-Quran yang diturunkan itu mengandungi rahmat dan peringatan bagi orang-orang yang beriman."
  },
  {
    "surah": 29,
    "ayat": 52,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Cukuplah Allah menjadi saksi (yang mengetahui perkara yang berbangkit) antaraku dengan kamu; Ia mengetahui segala yang ada di langit dan di bumi. Dan mereka yang percaya kepada perkara yang salah dan tidak percaya kepada Allah, mereka itulah orang-orang yang rugi."
  },
  {
    "surah": 29,
    "ayat": 53,
    "terjemahan": "Dan mereka meminta kepadamu menyegerakan kedatangan azab (yang dijanjikan); dan kalau tidaklah kerana adanya tempoh yang telah ditetapkan, tentulah azab itu akan datang menimpa mereka; dan azab itu tetap akan datang menimpa mereka secara mengejut, sedang mereka tidak menyedarinya."
  },
  {
    "surah": 29,
    "ayat": 54,
    "terjemahan": "Mereka meminta kepadamu menyegerakan kedatangan azab itu, padahal sesungguhnya neraka Jahannam tetap akan meliputi orang-orang yang kafir -"
  },
  {
    "surah": 29,
    "ayat": 55,
    "terjemahan": "Pada hari azab itu menyelubungi mereka dari sebelah atas mereka dan dari bawah kaki mereka; dan (malaikat yang melakukannya) akan berkata kepada mereka: \"Rasalah kamu (balasan) apa yang kamu telah kerjakan\"."
  },
  {
    "surah": 29,
    "ayat": 56,
    "terjemahan": "Wahai hamba-hambaKu yang beriman! Sesungguhnya bumiKu adalah luas (untuk kamu bebas beribadat); oleh itu, (di mana sahaja kamu dapat berbuat demikian) maka hendaklah kamu ikhlaskan ibadat kamu kepadaKu."
  },
  {
    "surah": 29,
    "ayat": 57,
    "terjemahan": "Tiap-tiap diri (sudah tetap) akan merasai mati, kemudian kamu akan dikembalikan kepada Kami (untuk menerima balasan)."
  },
  {
    "surah": 29,
    "ayat": 58,
    "terjemahan": "Dan orang-orang yang beriman serta beramal soleh, Kami akan tempatkan mereka dalam mahligai-mahligai di Syurga yang mengalir di bawahnya beberapa sungai, mereka kekal di dalamnya. Demikianlah balasan yang sebaik-baiknya bagi orang-orang yang beramal soleh -"
  },
  {
    "surah": 29,
    "ayat": 59,
    "terjemahan": "(Iaitu) mereka yang sabar, dan mereka pula berserah diri bulat-bulat kepada Tuhannya."
  },
  {
    "surah": 29,
    "ayat": 60,
    "terjemahan": "Dan (ingatlah) berapa banyak binatang yang tidak membawa rezekinya bersama, Allah jualah yang memberi rezeki kepadanya dan kepada kamu; dan Dia lah jua Yang Maha Mendengar, lagi Maha Mengetahui."
  },
  {
    "surah": 29,
    "ayat": 61,
    "terjemahan": "Dan sesungguhnya jika engkau (wahai Muhammad) bertanya kepada mereka (yang musyrik) itu: \"Siapakah yang menciptakan langit dan bumi, dan yang memudahkan matahari dan bulan (untuk faedah makhluk-makhlukNya)?\" Sudah tentu mereka akan menjawab: \"Allah\". Maka bagaimana mereka tergamak dipalingkan (oleh hawa nafsunya daripada mengakui keesaan Allah dan mematuhi perintahNya)?"
  },
  {
    "surah": 29,
    "ayat": 62,
    "terjemahan": "Allah memewahkan rezeki bagi sesiapa yang dikehendakiNya di antara hamba-hambaNya dan menyempitkan (rezeki itu) baginya; sesungguhnya Allah Maha Mengetahui akan tiap-tiap sesuatu."
  },
  {
    "surah": 29,
    "ayat": 63,
    "terjemahan": "Dan sesungguhnya jika engkau (wahai Muhammad) bertanya kepada mereka (yang musyrik) itu: \"Siapakah yang menurunkan hujan dari langit, lalu Ia hidupkan dengannya tumbuh-tumbuhan di bumi sesudah matinya?\" Sudah tentu mereka akan menjawab: \"Allah\". Ucapkanlah (wahai Muhammad): \"Alhamdulillah\" (sebagai bersyukur disebabkan pengakuan mereka yang demikian), bahkan kebanyakan mereka tidak memahami (hakikat tauhid dan pengertian syirik)."
  },
  {
    "surah": 29,
    "ayat": 64,
    "terjemahan": "Dan (ingatlah bahawa) kehidupan dunia ini (meliputi segala kesenangan dan kemewahannya, jika dinilaikan dengan kehidupan akhirat) tidak lain hanyalah ibarat hiburan dan permainan; dan sesungguhnya negeri akhirat itu ialah kehidupan yang sebenar-benarnya; kalaulah mereka mengetahui (hakikat ini tentulah mereka tidak akan melupakan hari akhirat)."
  },
  {
    "surah": 29,
    "ayat": 65,
    "terjemahan": "Dalam pada itu, apabila mereka naik bahtera (lalu menemui sesuatu bahaya di laut), mereka memohon pertolongan kepada Allah dengan doa yang tulus ikhlas kepadaNya. Kemudian setelah Allah menyelamatkan mereka (naik) ke darat, mereka berlaku syirik kepadaNya."
  },
  {
    "surah": 29,
    "ayat": 66,
    "terjemahan": "(Akibat syirik itu) menjadilah mereka orang-orang yang kufurkan nikmat yang Kami telah berikan kepadanya, dan (menjadi) orang-orang yang hanya dapat bersuka ria di dunia; kemudian mereka akan mengetahui kelak akibat buruk apa yang mereka lakukan."
  },
  {
    "surah": 29,
    "ayat": 67,
    "terjemahan": "Dan tidakkah mereka melihat dan memerhatikan bahawa Kami telah menjadikan (Makkah, negeri mereka) tanah suci yang dihormati, lagi aman; sedang orang-orang ramai yang tinggal (dalam daerah-daerah) di sekeliling mereka sentiasa diculik (untuk ditawan atau dibunuh) ? Oleh itu, patutkah mereka percaya kepada perkara yang salah, dan kufur ingkar akan nikmat-nikmat Allah?"
  },
  {
    "surah": 29,
    "ayat": 68,
    "terjemahan": "Dan tidaklah ada yang lebih zalim daripada orang yang mereka-reka perkara-perkara yang dusta terhadap Allah, atau mendustakan kebenaran setelah kebenaran itu disampaikan kepadanya. Bukankah (telah diketahui bahawa) dalam neraka Jahannam disediakan tempat tinggal bagi orang-orang yang kafir?"
  },
  {
    "surah": 29,
    "ayat": 69,
    "terjemahan": "Dan orang-orang yang berusaha dengan bersungguh-sungguh kerana memenuhi kehendak ugama Kami, sesungguhnya Kami akan memimpin mereka ke jalan-jalan Kami (yang menjadikan mereka bergembira serta beroleh keredaan); dan sesungguhnya (pertolongan dan bantuan) Allah adalah berserta orang-orang yang berusaha membaiki amalannya."
  },
  {
    "surah": 30,
    "ayat": 1,
    "terjemahan": "Alif, Laam, Miim."
  },
  {
    "surah": 30,
    "ayat": 2,
    "terjemahan": "Orang-orang Rom telah dikalahkan -"
  },
  {
    "surah": 30,
    "ayat": 3,
    "terjemahan": "Di negeri yang dekat sekali; dan mereka sesudah kekalahannya itu akan mengalahkan lawannya -"
  },
  {
    "surah": 30,
    "ayat": 4,
    "terjemahan": "Dalam masa tidak sampai sepuluh tahun. Kepada pentadbiran Allah jualah terpulang segala urusan, sebelum berlakunya dan sesudah berlakunya; dan pada ketika berlakunya (kemenangan Rom) itu, orang-orang yang beriman akan bergembira -"
  },
  {
    "surah": 30,
    "ayat": 5,
    "terjemahan": "Dengan kemenangan yang diberi Allah. Ia memberi kemenangan kepada sesiapa yang dikehendakiNya, dan Dia lah jua yang Maha Kuasa, lagi Maha Mengasihani."
  },
  {
    "surah": 30,
    "ayat": 6,
    "terjemahan": "Demikian dijanjikan Allah. Allah tidak pernah mengubah janjiNya, akan tetapi kebanyakan manusia tidak mengetahui (hakikat yang sebenarnya)."
  },
  {
    "surah": 30,
    "ayat": 7,
    "terjemahan": "Mereka hanya mengetahui perkara yang zahir nyata dari kehidupan dunia sahaja, dan mereka tidak pernah ingat hendak mengambil tahu tentang hari akhirat."
  },
  {
    "surah": 30,
    "ayat": 8,
    "terjemahan": "Patutkah mereka merasa cukup dengan mengetahui yang demikian sahaja, dan tidak memikirkan dalam hati mereka, (supaya mereka dapat mengetahui), bahawa Allah tidak menciptakan langit dan bumi serta segala yang ada di antara keduanya itu melainkan dengan ada gunanya yang sebenar, dan dengan ada masa penghujungnya yang tertentu, (juga untuk kembali menemui Penciptanya)? Dan sebenarnya banyak di antara manusia, orang-orang yang sungguh ingkar akan pertemuan dengan Tuhannya."
  },
  {
    "surah": 30,
    "ayat": 9,
    "terjemahan": "Tidakkah mereka telah berjalan dan mengembara di muka bumi, serta memerhatikan bagaimana kesudahan orang-orang yang terdahulu dari mereka? Orang-orang itu lebih kuat daripada mereka sendiri, dan orang-orang itu telah meneroka bumi serta memakmurkannya lebih daripada kemakmuran yang dilakukan oleh mereka, dan orang-orang itu juga telah didatangi oleh Rasul-rasulnya dengan membawa keterangan-keterangan yang jelas nyata (lalu mereka mendustakannya dan kesudahannya mereka dibinasakan). Dengan yang demikian, maka Allah tidak sekali-kali menganiaya mereka, tetapi merekalah yang menganiaya diri sendiri."
  },
  {
    "surah": 30,
    "ayat": 10,
    "terjemahan": "Sesudah dibinasakan di dunia maka akibat orang-orang yang melakukan kejahatan itu ialah seburuk-buruk azab (di akhirat kelak), disebabkan mereka mendustakan ayat-ayat keterangan Allah dan sentiasa mempersendakannya."
  },
  {
    "surah": 30,
    "ayat": 11,
    "terjemahan": "Allah memulakan kejadian sekalian makhluk, kemudian Ia mengembalikannya (hidup semula pada hari kiamat), kemudian kepadaNyalah kamu akan dikembalikan (untuk menerima balasan)."
  },
  {
    "surah": 30,
    "ayat": 12,
    "terjemahan": "Dan semasa berlakunya hari kiamat, orang-orang yang berdosa akan dia membisu serta berputus asa."
  },
  {
    "surah": 30,
    "ayat": 13,
    "terjemahan": "Dan makhluk-makhluk yang mereka jadikan sekutu-sekutu Allah itu tidak ada satupun daripadanya pemberi syafaat melepaskan mereka (dari azab Allah), padahal mereka berlaku kufur di dunia dahulu dengan sebab makhluk-makhluk yang mereka sekutukan (dengan Allah) itu."
  },
  {
    "surah": 30,
    "ayat": 14,
    "terjemahan": "Dan semasa berlakunya kiamat, mereka pada hari itu akan berpecah kepada dua kumpulan (setelah selesai perbicaraan)."
  },
  {
    "surah": 30,
    "ayat": 15,
    "terjemahan": "Adapun kumpulan orang-orang yang beriman dan beramal soleh, maka mereka akan ditempatkan di taman Syurga dalam keadaan bersuka ria."
  },
  {
    "surah": 30,
    "ayat": 16,
    "terjemahan": "Dan sebaliknya kumpulan orang-orang yang kafir dan mendustakan ayat-ayat Kami (Al-Quran) serta mendustakan pertemuan hari akhirat, maka mereka akan tetap berada dalam azab seksa selama-lamanya."
  },
  {
    "surah": 30,
    "ayat": 17,
    "terjemahan": "(Setelah kamu mengetahui yang demikian) maka bertasbihlah kepada Allah semasa kamu berada pada waktu malam dan semasa kamu berada pada waktu subuh."
  },
  {
    "surah": 30,
    "ayat": 18,
    "terjemahan": "Serta pujilah Allah yang berhak menerima segala puji (dari sekalian makhlukNya) di langit dan di bumi, dan juga (bertasbihlah kepadaNya serta pujilah Dia) pada waktu petang dan semasa kamu berada pada waktu zuhur."
  },
  {
    "surah": 30,
    "ayat": 19,
    "terjemahan": "Ia mengeluarkan sesuatu yang hidup dari benda yang mati, dan mengeluarkan benda yang mati dari sesuatu yang hidup, serta menghidupkan bumi sesudah matinya; dan sedemikian itulah kamu akan dikeluarkan (hidup semula dari kubur)."
  },
  {
    "surah": 30,
    "ayat": 20,
    "terjemahan": "Dan di antara tanda-tanda yang membuktikan kekuasaanNya (menghidupkan kamu semula), bahawa Ia menciptakan kamu dari tanah; setelah sempurna sahaja peringkat-peringkat kejadian kamu, kamu menjadi manusia yang hidup bertebaran di muka bumi."
  },
  {
    "surah": 30,
    "ayat": 21,
    "terjemahan": "Dan di antara tanda-tanda yang membuktikan kekuasaannya dan rahmatNya, bahawa Ia menciptakan untuk kamu (wahai kaum lelaki), isteri-isteri dari jenis kamu sendiri, supaya kamu bersenang hati dan hidup mesra dengannya, dan dijadikanNya di antara kamu (suami isteri) perasaan kasih sayang dan belas kasihan. Sesungguhnya yang demikian itu mengandungi keterangan-keterangan (yang menimbulkan kesedaran) bagi orang-orang yang berfikir."
  },
  {
    "surah": 30,
    "ayat": 22,
    "terjemahan": "Dan di antara tanda-tanda yang membuktikan kekuasaanNya dan kebijaksanaanNya ialah kejadian langit dan bumi, dan perbezaan bahasa kamu dan warna kulit kamu. Sesungguhnya yang demikian itu mengandungi keterangan-keterangan bagi orang-orang yang berpengetahuan."
  },
  {
    "surah": 30,
    "ayat": 23,
    "terjemahan": "Dan di antara tanda-tanda yang membuktikan kemurahannya dan kasih sayangNya ialah tidurnya kamu pada waktu malam dan pada siang hari, dan usaha kamu mencari rezeki dari limpah kurniaNya (pada kedua-dua waktu itu). Sesungguhnya keadaan yang demikian mengandungi keterangan-keterangan bagi orang-orang yang mahu mendengar (nasihat pengajaran)."
  },
  {
    "surah": 30,
    "ayat": 24,
    "terjemahan": "Dan di antara tanda-tanda yang membuktikan kebesaranNya dan kekuasaanNya, Ia memperlihatkan kilat kepada kamu, untuk menakutkan (dari panahan petir) dan memberi harapan (dengan turunnya hujan); dan Ia menurunkan hujan dari langit, lalu Ia hidupkan bumi sesudah matinya dengan hujan itu. Sesungguhnya yang demikian mengandungi keterangan-keterangan bagi orang-orang yang menggunakan akal untuk memahamiNya."
  },
  {
    "surah": 30,
    "ayat": 25,
    "terjemahan": "Dan di antara tanda-tanda yang membuktikan keluasan ilmuNya dan kekuasaanNya, ialah terdirinya langit dan bumi (dalam keadaan yang menakjubkan itu) dengan perintah dan penentuan takdirNya; akhirnya apabila Ia menyeru kamu dengan satu seruan (supaya kamu bangkit hidup semula) dari bumi, kamu dengan serta merta keluar (dari kubur masing-masing)."
  },
  {
    "surah": 30,
    "ayat": 26,
    "terjemahan": "Dan sekalian makhluk yang ada di langit dan di bumi adalah hak kepunyaanNya, masing-masing tetap tunduk kepada hukum peraturanNya."
  },
  {
    "surah": 30,
    "ayat": 27,
    "terjemahan": "Dan Dia lah yang memulakan kejadian sekalian makhluk, kemudian Ia mengembalikannya (hidup semula sesudah mereka mati), sedang perlaksanaan yang demikian amatlah mudah bagiNya. Dan bagiNyalah jua sifat yang tertinggi di langit dan di bumi, dan Dia lah jua Yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 30,
    "ayat": 28,
    "terjemahan": "Ia mengemukakan kepada kamu satu misal perbandingan dari keadaan diri kamu sendiri, iaitu: Relakah kamu menerima sebahagian dari hamba-hamba abdi yang kamu miliki itu menjadi rakan kongsi kamu pada harta benda yang Kami telah kurniakan kepada kamu, supaya dengan penerimaan kamu itu, mereka dengan kamu menjadi sama-sama berhak padanya, sehingga kamu pun tidak berani (menguruskan harta benda itu dengan tiada persetujuan) mereka, sebagaimana kamu tidak berani (berbuat demikian dengan orang-orang yang berkongsi dengan kamu - yang setaraf dengan) diri kamu? Demikianlah Kami menjelaskan keterangan-keterangan satu persatu bagi orang-orang yang menggunakan akal untuk memahaminya."
  },
  {
    "surah": 30,
    "ayat": 29,
    "terjemahan": "Orang-orang yang zalim itu (tidak berfikir), bahkan menurut hawa nafsu mereka (melakukan syirik) dengan tidak berdasarkan pengetahuan. Maka tiada sesiapa yang dapat memberi petunjuk kepada orang yang telah disesatkan oleh Allah (disebabkan bawaannya sendiri), dan tiada pula bagi mereka sesiapa yang dapat menolong melepaskan mereka dari azab."
  },
  {
    "surah": 30,
    "ayat": 30,
    "terjemahan": "(Setelah jelas kesesatan syirik itu) maka hadapkanlah dirimu (engkau dan pengikut-pengikutmu, wahai Muhammad) ke arah ugama yang jauh dari kesesatan; (turutlah terus) ugama Allah, iaitu ugama yang Allah menciptakan manusia (dengan keadaan bersedia dari semulajadinya) untuk menerimanya; tidaklah patut ada sebarang perubahan pada ciptaan Allah itu; itulah ugama yang betul lurus, tetapi kebanyakan manusia tidak mengetahui."
  },
  {
    "surah": 30,
    "ayat": 31,
    "terjemahan": "Hendaklah kamu (wahai Muhammad dan pengikut-pengikutmu) sentiasa rujuk kembali kepada Allah (dengan mengerjakan amal-amal bakti) serta bertaqwalah kamu kepadaNya; dan kerjakanlah sembahyang dengan betul sempurna; dan janganlah kamu menjadi dari mana-mana golongan orang musyrik -"
  },
  {
    "surah": 30,
    "ayat": 32,
    "terjemahan": "Iaitu orang-orang yang menjadikan fahaman ugama mereka berselisihan mengikut kecenderungan masing-masing serta mereka pula menjadi berpuak-puak; tiap-tiap puak bergembira dengan apa yang ada padanya (dari fahaman dan amalan yang terpesong itu)."
  },
  {
    "surah": 30,
    "ayat": 33,
    "terjemahan": "Dan apabila manusia disentuh oleh sesuatu bahaya, mereka segera berdoa kepada Tuhan mereka dengan keadaan rujuk kembali bertaubat kepadaNya; kemudian apabila Allah memberi mereka merasai sesuatu rahmat daripadaNya, tiba-tiba sebahagian dari mereka mempersekutukan sesuatu yang lain dengan Tuhannya;"
  },
  {
    "surah": 30,
    "ayat": 34,
    "terjemahan": "Dengan sebab itu, mereka mengingkari nikmat-nikmat yang telah Kami berikan kepadanya. Maka (dikatakan kepada mereka): \"Bersenang-senanglah kamu (bagi sementara), kemudian kamu akan mengetahui (balasan kederhakaan kamu)\"."
  },
  {
    "surah": 30,
    "ayat": 35,
    "terjemahan": "Pernahkah Kami menurunkan kepada mereka (yang musyrik itu) sebarang bukti keterangan, lalu ia menerangkan jalan yang membolehkan mereka lakukan perbuatan syirik itu?"
  },
  {
    "surah": 30,
    "ayat": 36,
    "terjemahan": "Dan apabila Kami beri manusia merasai sesuatu rahmat, mereka bergembira dengannya (sehingga lupa daratan); dan jika mereka ditimpa sesuatu bencana disebabkan apa yang telah dilakukan oleh tangan mereka sendiri, tiba-tiba mereka berputus asa."
  },
  {
    "surah": 30,
    "ayat": 37,
    "terjemahan": "(Mengapa mereka bersikap demikian?) dan mengapa mereka tidak melihat (dengan hati mereka) bahawa Allah memewahkan rezeki bagi sesiapa yang dikehendakiNya (sebagai cubaan adakah orang itu bersyukur atau sebaliknya), dan Ia juga yang menyempitkannya (sebagai ujian sama ada diterima dengan sabar atau tidak)? Sesungguhnya hal yang demikian itu mengandungi keterangan-keterangan (yang membuktikan kekuasaan Allah) bagi orang-orang yang beriman."
  },
  {
    "surah": 30,
    "ayat": 38,
    "terjemahan": "Maka (bagi menyatakan sikap syukur) berikanlah kepada kerabatmu, dan orang miskin serta orang musafir akan haknya masing-masing; pemberian yang demikian adalah baik bagi orang-orang yang bertujuan memperoleh keredaan Allah dan mereka itulah orang-orang yang berjaya."
  },
  {
    "surah": 30,
    "ayat": 39,
    "terjemahan": "Dan (ketahuilah bahawa) sesuatu pemberian atau tambahan yang kamu berikan, supaya bertambah kembangnya dalam pusingan harta manusia maka ia tidak sekali-kali akan kembang di sisi Allah (tidak mendatangkan kebaikan). Dan sebaliknya sesuatu pemberian sedekah yang kamu berikan dengan tujuan mengharapkan keredaan Allah semata-mata, maka mereka yang melakukannya itulah orang-orang yang beroleh pahala berganda-ganda."
  },
  {
    "surah": 30,
    "ayat": 40,
    "terjemahan": "Allah jualah yang mencipta kamu; kemudian Ia memberi rezeki kepada kamu; sesudah itu Ia mematikan kamu; kemudian Ia menghidupkan kamu semula. Adakah di antara makhluk-makhluk yang kamu sekutukan dengan Allah itu sesiapa yang dapat berbuat sesuatu pun dari segala yang tersebut? Maha Suci Allah dan Tertinggi keadaanNya dari apa yang mereka sekutukan (denganNya)."
  },
  {
    "surah": 30,
    "ayat": 41,
    "terjemahan": "Telah timbul berbagai kerosakan dan bala bencana di darat dan di laut dengan sebab apa yang telah dilakukan oleh tangan manusia; (timbulnya yang demikian) kerana Allah hendak merasakan mereka sebahagian dari balasan perbuatan-perbuatan buruk yang mereka telah lakukan, supaya mereka kembali (insaf dan bertaubat)."
  },
  {
    "surah": 30,
    "ayat": 42,
    "terjemahan": "Katakanlah: \"Mengembaralah kamu di muka bumi kemudian lihatlah bagaimana kesudahan orang-orang yang telah lalu (yang telah dibinasakan); kebanyakan mereka adalah orang-orang musyrik\"."
  },
  {
    "surah": 30,
    "ayat": 43,
    "terjemahan": "(Jika demikian keadaannya) maka hadapkanlah dirimu (wahai Muhammad) ke arah ugama yang betul, sebelum datangnya dari Allah: hari yang tak dapat ditolak; pada hari itu manusia akan berpecah (kepada dua golongan)."
  },
  {
    "surah": 30,
    "ayat": 44,
    "terjemahan": "Sesiapa yang kufur ingkar maka dia lah sahaja yang menanggung bencana kekufurannya itu, dan sesiapa yang beramal soleh (yang membuktikan imannya), maka merekalah orang-orang yang membuat persiapan untuk kesenangan diri mereka masing-masing;"
  },
  {
    "surah": 30,
    "ayat": 45,
    "terjemahan": "Kerana Allah akan membalas orang-orang yang beriman dan beramal soleh dari limpah kurniaNya. Sesungguhnya Ia tidak suka kepada orang-orang yang kufur ingkar."
  },
  {
    "surah": 30,
    "ayat": 46,
    "terjemahan": "Dan di antara tanda-tanda yang membuktikan kekuasaanNya, bahawa Ia menghantarkan angin sebagai pembawa berita yang mengembirakan; dan untuk merasakan kamu sedikit dari rahmatNya, dan supaya kapal-kapal belayar laju dengan perintahNya, dan juga supaya kamu dapat mencari rezeki dari limpah kurniaNya; dan seterusnya supaya kamu bersyukur."
  },
  {
    "surah": 30,
    "ayat": 47,
    "terjemahan": "Dan demi sesungguhnya, Kami telah mengutuskan sebelummu (wahai Muhammad) Rasul-rasul kepada kaum masing-masing, lalu mereka membawa kepada kaumnya keterangan-keterangan yang jelas nyata; kemudian Kami menyeksa orang-orang yang berlaku salah (mengingkarinya); dan sememangnya adalah menjadi tanggungjawab Kami menolong orang-orang yang beriman."
  },
  {
    "surah": 30,
    "ayat": 48,
    "terjemahan": "Allah jualah yang menghantarkan angin, lalu angin itu menggerakkan awan; kemudian Allah menyebarkan awan itu di langit sebagaimana yang dikehendakiNya, dan menjadikannya berkelompok-kelompok; lalu engkau melihat hujan keluar dari celah-celahnya. Maka apabila Allah menurunkan hujan itu mengenai sesiapa yang dikehendakiNya dari hamba-hambanya, mereka serta merta bergembira;"
  },
  {
    "surah": 30,
    "ayat": 49,
    "terjemahan": "Dan sesungguhnya mereka dahulu, sebelum diturunkan hujan kepada mereka, adalah orang-orang yang telah berputus asa."
  },
  {
    "surah": 30,
    "ayat": 50,
    "terjemahan": "Maka lihatlah olehmu kepada kesan-kesan rahmat Allah, bagaimana Ia menghidupkan bumi sesudah matinya (dengan tanaman-tanaman yang menghijau subur). Sesungguhnya Allah yang demikian kekuasaanNya, sudah tentu berkuasa menghidupkan orang-orang yang telah mati. Dan (ingatlah) Ia maha Kuasa atas tiap-tiap sesuatu."
  },
  {
    "surah": 30,
    "ayat": 51,
    "terjemahan": "Dan demi sesungguhnya, jika Kami hantarkan angin (menyerang tanaman) lalu mereka melihat tanaman itu menjadi kuning kering, nescaya mereka sesudah itu, terus kembali kufur (tidak mengenangkan nikmat-nikmat Allah serta berputus asa)."
  },
  {
    "surah": 30,
    "ayat": 52,
    "terjemahan": "(Maka janganlah engkau berdukacita - wahai Muhammad - terhadap keadaan mereka yang demikian), kerana sesungguhnya engkau tidak dapat menjadikan orang-orang yang mati (hatinya) itu menerima ajaranmu, dan tidak dapat menjadikan orang-orang yang pekak itu mendengar seruanmu, apabila mereka berpaling undur (disebabkan keingkarannya)."
  },
  {
    "surah": 30,
    "ayat": 53,
    "terjemahan": "Dan engkau tidak akan dapat memberi petunjuk kepada orang-orang yang buta (matahatinya) supaya menjauhi kesesatan mereka; engkau tidak dapat memperdengarkan (seruanmu itu) melainkan kepada orang-orang yang sedia beriman akan ayat-ayat keterangan Kami, kerana mereka orang-orang yang menurut perintah."
  },
  {
    "surah": 30,
    "ayat": 54,
    "terjemahan": "Allah yang menciptakan kamu bermula dengan keadaan lemah, selepas berkeadaan lemah itu Ia menjadikan kamu kuat. Setelah itu Ia menjadikan kamu lemah pula serta tua beruban. Ia menciptakan apa yang dikehendakiNya, dan Dia lah jua yang Maha Mengetahui, lagi Maha Kuasa."
  },
  {
    "surah": 30,
    "ayat": 55,
    "terjemahan": "Dan semasa berlakunya hari kiamat, orang-orang yang berdosa akan bersumpah mengatakan bahawa mereka tidak tinggal (di dalam kubur) melainkan sekadar satu saat sahaja; demikianlah mereka sentiasa dipalingkan (oleh fahaman sesatnya dari memperkatakan yang benar)."
  },
  {
    "surah": 30,
    "ayat": 56,
    "terjemahan": "Dan (bagi menjawabnya) berkatalah orang-orang yang berilmu serta beriman: \"Demi sesungguhnya, kamu telah tinggal - menurut yang terkandung dalam Kitab Allah - sampai ke hari kebangkitan (hari kiamat); maka inilah dia hari kebangkitan (yang dijanjikan) itu, akan tetapi kamu dari dahulu lagi tidak mahu mengetahui (kebenarannya)\"."
  },
  {
    "surah": 30,
    "ayat": 57,
    "terjemahan": "Maka pada hari itu tidak berguna lagi bagi orang-orang yang zalim, sebarang alasan yang mereka kemukakan untuk melepaskan diri, dan mereka pula tidak diberi peluang untuk memohon keredaan Allah."
  },
  {
    "surah": 30,
    "ayat": 58,
    "terjemahan": "Dan demi sesungguhnya, Kami telah mengemukakan kepada umat manusia berbagai kisah dan perbandingan di dalam Al-Quran ini; dan demi sesungguhnya jika engkau membawa kepada mereka sebarang keterangan, sudah tentu orang-orang kafir itu akan berkata: \"Kamu ini tidak lain hanyalah orang-orang yang membuat dakwaan palsu\"."
  },
  {
    "surah": 30,
    "ayat": 59,
    "terjemahan": "Demikianlah Allah meteraikan hati orang-orang yang tidak mahu menerima jalan mengetahui (kebenaran)."
  },
  {
    "surah": 30,
    "ayat": 60,
    "terjemahan": "Oleh itu, bersabarlah (wahai Muhammad), sesungguhnya janji Allah itu benar; dan janganlah orang-orang yang tidak meyakini apa yang engkau sampaikan itu menjadikan engkau resah gelisah."
  },
  {
    "surah": 31,
    "ayat": 1,
    "terjemahan": "Alif, Laam, Miim."
  },
  {
    "surah": 31,
    "ayat": 2,
    "terjemahan": "Ini ialah ayat-ayat Kitab (Al-Quran) yang mengandungi hikmat-hikmat dan kebenaran yang tetap kukuh,"
  },
  {
    "surah": 31,
    "ayat": 3,
    "terjemahan": "Menjadi hidayah petunjuk dan rahmat bagi orang-orang yang sedia mengerjakan amal-amal yang baik"
  },
  {
    "surah": 31,
    "ayat": 4,
    "terjemahan": "Iaitu orang-orang yang mendirikan sembahyang, dan memberi zakat, serta mereka yakin tentang adanya hari akhirat."
  },
  {
    "surah": 31,
    "ayat": 5,
    "terjemahan": "Mereka itulah yang tetap mendapat hidayah petunjuk dari Tuhan mereka, dan merekalah orang-orang yang berjaya."
  },
  {
    "surah": 31,
    "ayat": 6,
    "terjemahan": "Dan ada di antara manusia: orang yang memilih serta membelanjakan hartanya kepada cerita-cerita dan perkara-perkara hiburan yang melalaikan; yang berakibat menyesatkan (dirinya dan orang ramai) dari ugama Allah dengan tidak berdasarkan sebarang pengetahuan; dan ada pula orang yang menjadikan ugama Allah itu sebagai ejek-ejekan; merekalah orang-orang yang akan beroleh azab yang menghinakan."
  },
  {
    "surah": 31,
    "ayat": 7,
    "terjemahan": "Dan apabila dibacakan kepadanya ayat-ayat Kami, berpalinglah dia dengan angkuhnya, seoleh-oleh ada penyumbat pada kedua telinganya; maka gembirakanlah dia dengan balasan azab yang tidak terperi sakitnya."
  },
  {
    "surah": 31,
    "ayat": 8,
    "terjemahan": "Sesungguhnya orang-orang yang beriman dan beramal soleh, mereka akan beroleh Syurga yang penuh dengan berbagai nikmat,"
  },
  {
    "surah": 31,
    "ayat": 9,
    "terjemahan": "kekalan mereka di dalamnya. Demikian dijanjikan Allah - janji yang tetap benar; dan Dia lah jua yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 31,
    "ayat": 10,
    "terjemahan": "Ia menciptakan langit dengan tidak bertiang sebagaimana yang kamu melihatnya; dan Ia mengadakan di bumi gunung-ganang yang menetapnya supaya bumi itu tidak menghayun-hayunkan kamu; dan Ia biakkan padanya berbagai jenis binatang. Dan Kami menurunkan hujan dari langit, lalu Kami tumbuhkan di bumi berbagai jenis tanaman yang memberi banyak manfaat."
  },
  {
    "surah": 31,
    "ayat": 11,
    "terjemahan": "Ini (semuanya adalah) ciptaan Allah, maka cubalah kamu tunjukkan kepadaKu apakah yang telah diciptakan oleh makhluk-makhluk yang lain daripadaNya (yang kamu sembah itu)? (Tidak ada sesuatu pun) bahkan orang-orang yang zalim (dengan perbuatan syiriknya) itu berada dalam kesesatan yang jelas nyata."
  },
  {
    "surah": 31,
    "ayat": 12,
    "terjemahan": "Dan sesungguhnya Kami telah memberi kepada Luqman, hikmat kebijaksanaan, (serta Kami perintahkan kepadanya): Bersyukurlah kepada Allah (akan segala nikmatNya kepadamu)\". Dan sesiapa yang bersyukur maka faedahnya itu hanyalah terpulang kepada dirinya sendiri, dan sesiapa yang tidak bersyukur (maka tidaklah menjadi hal kepada Allah), kerana sesungguhnya Allah Maha Kaya, lagi Maha Terpuji."
  },
  {
    "surah": 31,
    "ayat": 13,
    "terjemahan": "Dan (ingatlah) ketika Luqman berkata kepada anaknya, semasa ia memberi nasihat kepadanya:\" Wahai anak kesayanganku, janganlah engkau mempersekutukan Allah (dengan sesuatu yang lain), sesungguhnya perbuatan syirik itu adalah satu kezaliman yang besar\"."
  },
  {
    "surah": 31,
    "ayat": 14,
    "terjemahan": "Dan Kami wajibkan manusia berbuat baik kepada kedua ibu bapanya; ibunya telah mengandungnya dengan menanggung kelemahan demi kelemahan (dari awal mengandung hingga akhir menyusunya), dan tempoh menceraikan susunya ialah dalam masa dua tahun; (dengan yang demikian) bersyukurlah kepadaKu dan kepada kedua ibubapamu; dan (ingatlah), kepada Akulah jua tempat kembali (untuk menerima balasan)."
  },
  {
    "surah": 31,
    "ayat": 15,
    "terjemahan": "Dan jika mereka berdua mendesakmu supaya engkau mempersekutukan denganKu sesuatu yang engkau - dengan fikiran sihatmu - tidak mengetahui sungguh adanya maka janganlah engkau taat kepada mereka; dan bergaulah dengan mereka di dunia dengan cara yang baik. Dan turutlah jalan orang-orang yang rujuk kembali kepadaKu (dengan tauhid dan amal-amal yang soleh). Kemudian kepada Akulah tempat kembali kamu semuanya, maka Aku akan menerangkan kepada kamu segala yang kamu telah kerjakan."
  },
  {
    "surah": 31,
    "ayat": 16,
    "terjemahan": "(Luqman menasihati anaknya dengan berkata): \"Wahai anak kesayanganku, sesungguhnya jika ada sesuatu perkara (yang baik atau yang buruk) sekalipun seberat bijih sawi, serta ia tersembunyi di dalam batu besar atau di langit atau pun di bumi, sudah tetap akan dibawa oleh Allah (untuk dihakimi dan dibalasNya); kerana sesungguhnya Allah Maha Halus pengetahuanNya; lagi Amat Meliputi akan segala yang tersembunyi."
  },
  {
    "surah": 31,
    "ayat": 17,
    "terjemahan": "\"Wahai anak kesayanganku, dirikanlah sembahyang, dan suruhlah berbuat kebaikan, serta laranglah daripada melakukan perbuatan yang mungkar, dan bersabarlah atas segala bala bencana yang menimpamu. Sesungguhnya yang demikian itu adalah dari perkara-perkara yang dikehendaki diambil berat melakukannya."
  },
  {
    "surah": 31,
    "ayat": 18,
    "terjemahan": "\"Dan janganlah engkau memalingkan mukamu (kerana memandang rendah) kepada manusia, dan janganlah engkau berjalan di bumi dengan berlagak sombong; sesungguhnya Allah tidak suka kepada tiap-tiap orang yang sombong takbur, lagi membanggakan diri."
  },
  {
    "surah": 31,
    "ayat": 19,
    "terjemahan": "\"Dan sederhanakanlah langkahmu semasa berjalan, juga rendahkanlah suaramu (semasa berkata-kata), sesungguhnya seburuk-buruk suara ialah suara keldai\"."
  },
  {
    "surah": 31,
    "ayat": 20,
    "terjemahan": "Tidakkah kamu memperhatikan bahawa Allah telah memudahkan untuk kegunaan kamu apa yang ada di langit dan yang ada di bumi, dan telah melimpahkan kepada kami nikmat-nimatNya yang zahir dan yang batin? Dalam pada itu, ada di antara manusia orang yang membantah mengenai (sifat-sifat) Allah dengan tidak berdasarkan sebarang pengetahuan atau sebarang petunjuk; dan tidak juga berdasarkan mana-mana Kitab Allah yang menerangi kebenaran."
  },
  {
    "surah": 31,
    "ayat": 21,
    "terjemahan": "Dan apabila dikatakan kepada mereka (yang ingkar): \"Turutlah akan apa yang telah diturunkan oleh Allah\" mereka menjawab:\" (Tidak), bahkan Kami hanya menurut apa yang Kami dapati datuk nenek kami melakukannya\". Patutkah mereka (menurut datuk neneknya) sekalipun Syaitan mengajak mereka itu (melakukan perbuatan yang menjerumuskan mereka) ke dalam azab api neraka yang marak menjulang?"
  },
  {
    "surah": 31,
    "ayat": 22,
    "terjemahan": "Dan sesiapa yang berserah diri bulat-bulat kepada Allah (dengan ikhlas) sedang ia berusaha mengerjakan kebaikan, maka sesungguhnya ia telah berpegang kepada simpulan (tali ugama) yang teguh dan (ingatlah) kepada Allah jualah kesudahan segala urusan."
  },
  {
    "surah": 31,
    "ayat": 23,
    "terjemahan": "Dan sesiapa yang kufur ingkar, maka janganlah engkau (wahai Muhammad) berdukacita tentang kekufurannya itu; kepada Kamilah tempat kembalinya mereka, kemudian Kami akan memberitahu kepada mereka tentang apa yang mereka telah kerjakan. Sesungguhnya Allah Maha Mengetahui akan segala (isi hati) yang terkandung di dalam dada."
  },
  {
    "surah": 31,
    "ayat": 24,
    "terjemahan": "Kami akan berikan mereka menikmati kesenangan bagi sementara (di dunia), kemudian Kami akan memaksa mereka (dengan menyeretnya) ke dalam azab yang amat berat."
  },
  {
    "surah": 31,
    "ayat": 25,
    "terjemahan": "Dan sesungguhnya jika engkau (wahai Muhammad) bertanya kepada mereka (yang musyrik) itu: \"Siapakah yang menciptakan langit dan bumi?\" Sudah tentu mereka akan menjawab: \"Allah\". Ucapkanlah (wahai Muhammad): \"Alhamdulillah\" (sebagai bersyukur disebabkan pengakuan mereka yang demikian - tidak mengingkari Allah), bahkan kebanyakan mereka tidak mengetahui (hakikat tauhid dan pengertian syirik)."
  },
  {
    "surah": 31,
    "ayat": 26,
    "terjemahan": "Allah jua yang memiliki segala yang ada di langit dan di bumi; sesungguhnya Allah Dia lah jua yang Maha Kaya, lagi sentiasa Terpuji."
  },
  {
    "surah": 31,
    "ayat": 27,
    "terjemahan": "Dan sekiranya segala pohon yang ada di bumi menjadi pena, dan segala lautan (menjadi tinta), dengan dibantu kepadanya tujuh lautan lagi sesudah itu, nescaya tidak akan habis Kalimah-kalimah Allah itu ditulis. Sesungguhnya Allah Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 31,
    "ayat": 28,
    "terjemahan": "(Bagi Allah Yang Maha Kuasa) soal menciptakan kamu semua (dari tiada kepada ada), dan soal membangkitkan kamu hidup semula sesudah mati, tidak ada apa-apa sukarnya, hanyalah seperti (mencipta dan menghidupkan semula) seorang manusia sahaja. Sesungguhnya Allah Maha Mendengar, lagi Maha Melihat."
  },
  {
    "surah": 31,
    "ayat": 29,
    "terjemahan": "Tidakkah engkau memerhatikan bahawa Allah memasukkan malam pada siang dan memasukkan siang pada malam (silih berganti), dan Ia memudahkan matahari dan bulan (untuk faedah makhluk-makhlukNya)? Tiap-tiap satu dari keduanya beredar untuk suatu masa yang telah ditetapkan. Dan (ingatlah) sesungguhnya Allah Maha Mengetahui dengan mendalam akan apa yang kamu lakukan."
  },
  {
    "surah": 31,
    "ayat": 30,
    "terjemahan": "Bersifatnya Allah dengan penuh kekuasaan dan luas ilmu pengetahuan itu kerana bahawasanya Allah Dia lah sahaja Tuhan Yang Sebenar-benarnya, dan bahawa segala yang mereka sembah selain dari Allah adalah palsu belaka. Dan (ingatlah) sesungguhnya Allah Dia lah Yang Maha Tinggi keadaanNya, lagi Maha Besar (kekuasaanNya)."
  },
  {
    "surah": 31,
    "ayat": 31,
    "terjemahan": "Tidakkah engkau memerhatikan bahawasanya kapal-kapal belayar di laut dengan nikmat Kurnia Allah, untuk diperlihatkan kepada kamu sebahagian dari tanda-tanda kemurahanNya? Sesungguhnya yang demikian itu mengandungi keterangan-keterangan dan bukti (untuk berfikir) bagi tiap-tiap (mukmin) yang tetap teguh pendiriannya, lagi sentiasa bersyukur."
  },
  {
    "surah": 31,
    "ayat": 32,
    "terjemahan": "Dan (orang-orang yang tidak bersifat demikian) apabila mereka dirempuh serta diliputi oleh ombak yang besar seperti kelompok-kelompok awan menyerkup, pada saat itu mereka semua berdoa kepada Allah dengan mengikhlaskan kepercayaan mereka kepadaNya semata-mata. Kemudian bila sahaja Allah menyelamatkan mereka ke darat maka sebahagian sahaja di antara mereka yang bersikap adil (lalu bersyukur kepada Allah serta mengesakanNya). Dan sememangnya tiada yang mengingkari bukti-bukti kemurahan Kami melainkan tiap-tiap orang yang bersifat pemungkir janji, lagi amat tidak mengenang budi."
  },
  {
    "surah": 31,
    "ayat": 33,
    "terjemahan": "Wahai sekalian manusia, bertaqwalah kepada Tuhan kamu, dan takutilah akan hari (akhirat) yang padanya seseorang ibu atau bapa tidak dapat melepaskan anaknya dari azab dosanya, dan seorang anak pula tidak dapat melepaskan ibu atau bapanya dari azab dosa masing-masing sedikit pun. Sesungguhnya janji Allah itu adalah benar, maka janganlah kamu diperdayakan oleh kehidupan dunia, dan jangan pula kamu diperdayakan oleh bisikan dan ajakan Syaitan yang menyebabkan kamu berani melanggar perintah Allah."
  },
  {
    "surah": 31,
    "ayat": 34,
    "terjemahan": "Sesungguhnya di sisi Allah pengetahuan yang tepat tentang hari kiamat. Dan Dia lah jua yang menurunkan hujan, dan yang mengetahui dengan sebenar-benarnya tentang apa yang ada dalam rahim (ibu yang mengandung). Dan tiada seseorang pun yang betul mengetahui apa yang akan diusahakannya esok (sama ada baik atau jahat); dan tiada seorangpun yang dapat mengetahui di bumi negeri manakah ia akan mati. Sesungguhnya Allah Maha Mengetahui, lagi Amat Meliputi pengetahuanNya."
  },
  {
    "surah": 32,
    "ayat": 1,
    "terjemahan": "Alif, Laam Miim."
  },
  {
    "surah": 32,
    "ayat": 2,
    "terjemahan": "Diturunkan Al-Quran ini, dengan tidak ada sebarang syak padanya, dari Tuhan yang memelihara dan mentadbirkan sekalian alam."
  },
  {
    "surah": 32,
    "ayat": 3,
    "terjemahan": "(Orang-orang kafir tidak mengakui hakikat yang demikian) bahkan mereka mengatakan: \"Dia lah (Muhammad) yang mengada-adakan Al-Quran menurut rekaannya\". (Dakwaan mereka itu tidaklah benar) bahkan Al-Quran ialah perkara yang benar dari Tuhanmu (wahai Muhammad), supaya engkau memberi ingatan dan amaran kepada kaum (mu) yang telah lama tidak didatangi sebarang pemberi ingatan dan amaran sebelummu, semoga mereka beroleh hidayah petunjuk."
  },
  {
    "surah": 32,
    "ayat": 4,
    "terjemahan": "Allah Tuhan yang menciptakan langit dan bumi serta segala yang ada di antara keduanya dalam enam masa, kemudian Ia bersemayam di atas Arasy; kamu tidak akan beroleh sebarang penolong dan pemberi syafaat selain dari Allah; oleh itu tidakkah kamu mahu insaf dan mengambil iktibar (untuk mencapai keredaanNya)?"
  },
  {
    "surah": 32,
    "ayat": 5,
    "terjemahan": "Allah mentadbirkan makhluk-makhlukNya; (bagi melaksanakan tadbirNya itu Ia menurunkan segala sebab dan peraturan) dari langit ke bumi; kemudian diangkat naik kepada pengetahuanNya (segala yang berlaku dari perlaksanaan tadbirNya itu untuk dihakimiNya) pada suatu masa yang (dirasai oleh orang-orang yang bersalah) banyak bilangan tahunnya menurut hitungan masa kamu yang biasa."
  },
  {
    "surah": 32,
    "ayat": 6,
    "terjemahan": "Yang demikian sifatnya ialah Tuhan yang mengetahui perkara-perkara yang ghaib dan yang nyata; Yang Maha Kuasa, lagi Maha Mengasihani;"
  },
  {
    "surah": 32,
    "ayat": 7,
    "terjemahan": "Yang menciptakan tiap-tiap sesuatu dengan sebaik-baiknya, dan dimulakanNya kejadian manusia berasal dari tanah;"
  },
  {
    "surah": 32,
    "ayat": 8,
    "terjemahan": "Kemudian Ia menjadikan keturunan manusia itu dari sejenis pati, iaitu dari air (benih) yang sedikit dipandang orang;"
  },
  {
    "surah": 32,
    "ayat": 9,
    "terjemahan": "Kemudian Ia menyempurnakan kejadiannya, serta meniupkan padanya: roh ciptaanNya. Dan Ia mengurniakan kepada kamu pendengaran dan penglihatan serta hati (akal fikiran), (supaya kamu bersyukur, tetapi) amatlah sedikit kamu bersyukur."
  },
  {
    "surah": 32,
    "ayat": 10,
    "terjemahan": "Dan mereka (yang kafir) itu berkata: \"Adakah apabila kami telah hilang lenyap dalam tanah, kami pula akan hidup semula dalam bentuk kejadian yang baharu? Betulkah demikian? \" (Mereka bukan sahaja tidak percaya tentang hidup semula) bahkan mereka tidak percaya tentang pertemuan dengan Tuhannya."
  },
  {
    "surah": 32,
    "ayat": 11,
    "terjemahan": "Katakanlah (wahai Muhammad); \"Nyawa kamu akan diambil oleh Malikil Maut yang ditugaskan berbuat demikian ketika habis ajal kamu, kemudian kamu akan dikembalikan kepada Tuhan kamu (untuk menerima balasan)\"."
  },
  {
    "surah": 32,
    "ayat": 12,
    "terjemahan": "Dan (sungguh ngeri) sekiranya engkau melihat ketika orang-orang yang berdosa itu menundukkan kepalanya di hadapan Tuhan mereka (dalam keadaan malu dan hina, sambil merayu): \"Wahai Tuhan kami, kami telah melihat dan mendengar dengan sejelas-jelasnya (akan segala yang kami ingkari dahulu); maka kembalikanlah kami ke dunia supaya kami mengerjakan amal-amal yang baik; sesungguhnya kami sekarang telah yakin\"."
  },
  {
    "surah": 32,
    "ayat": 13,
    "terjemahan": "Dan (bagi menolak rayuan itu Allah Taala berfirman): \"Kalaulah Kami telah tetapkan persediaan (memberikan hidayah petunjuk untuk beriman dan beramal soleh kepada tiap-tiap seorang dengan ketiadaan usaha dari masing-masing), nescaya Kami berikan kepada tiap-tiap seorang akan hidayah petunjuknya (sebelum masing-masing meninggal dunia, supaya tidak terkena azab di akhirat); tetapi telah tetap hukuman seksa dariKu: ` Demi sesungguhnya! Aku akan memenuhi neraka Jahannam dengan semua jin dan manusia (yang pada masa hidupnya tidak berusaha untuk beriman dan beramal soleh)\"."
  },
  {
    "surah": 32,
    "ayat": 14,
    "terjemahan": "(Lalu dikatakan kepada mereka: \"Oleh sebab kelalaian kamu) maka rasalah azab seksa kerana kamu melupai pertemuan hari kamu ini. Sesungguhnya Kami pun tidak hiraukan keselamatan kamu lagi; dan (dengan yang demikian) rasalah azab yang kekal dengan sebab apa yang kamu telah kerjakan\"."
  },
  {
    "surah": 32,
    "ayat": 15,
    "terjemahan": "Sesungguhnya yang sebenar-benar beriman kepada ayat-ayat keterangan Kami hanyalah orang-orang yang apabila diberi peringatan dan pengajaran dengan ayat-ayat itu, mereka segera merebahkan diri sambil sujud (menandakan taat patuh), dan menggerakkan lidah dengan bertasbih serta memuji Tuhan mereka, dan mereka pula tidak bersikap sombong takbur."
  },
  {
    "surah": 32,
    "ayat": 16,
    "terjemahan": "Mereka merenggangkan diri dari tempat tidur, (sedikit sangat tidur, kerana mengerjakan sembahyang tahajjud dan amal-amal soleh); mereka sentiasa berdoa kepada Tuhan mereka dengan perasaan takut (akan kemurkaanNya) serta dengan perasaan ingin memperolehi lagi (keredaanNya); dan mereka selalu pula mendermakan sebahagian dari apa yang Kami beri kepada mereka."
  },
  {
    "surah": 32,
    "ayat": 17,
    "terjemahan": "Maka tidak ada seseorang pun yang mengetahui satu persatu persediaan yang telah dirahsiakan untuk mereka (dari segala jenis nikmat) yang amat indah dipandang dan mengembirakan, sebagai balasan bagi amal-amal soleh yang mereka telah kerjakan."
  },
  {
    "surah": 32,
    "ayat": 18,
    "terjemahan": "(Jika demikian halnya) maka adakah orang yang beriman sama seperti orang yang fasik? Mereka tidaklah sama (dalam menerima balasan)."
  },
  {
    "surah": 32,
    "ayat": 19,
    "terjemahan": "Adapun orang-orang yang beriman dan beramal soleh, maka mereka akan beroleh Syurga tempat tinggal yang tetap sebagai balasan bagi apa yang mereka telah kerjakan."
  },
  {
    "surah": 32,
    "ayat": 20,
    "terjemahan": "Dan sebaliknya orang-orang yang fasik, maka tempat kediaman mereka ialah neraka; tiap-tiap kali mereka hendak keluar dari neraka itu, mereka dikembalikan kepadanya, serta dikatakan kepada mereka: \"Rasalah azab neraka yang kamu sentiasa mendustakannya di dunia dahulu\"."
  },
  {
    "surah": 32,
    "ayat": 21,
    "terjemahan": "Dan demi sesungguhnya, Kami akan merasakan mereka sedikit dari azab dunia sebelum azab yang besar (di akhirat kelak), supaya mereka rujuk kembali bertaubat."
  },
  {
    "surah": 32,
    "ayat": 22,
    "terjemahan": "Dan tidaklah ada yang lebih zalim daripada orang yang diberi ingat dengan ayat-ayat Tuhannya, kemudian ia berpaling daripadanya (dan tetap mengingkarinya); sesungguhnya Kami tetap membalas."
  },
  {
    "surah": 32,
    "ayat": 23,
    "terjemahan": "Dan demi sesungguhnya! Kami telah memberi kepada Nabi Musa Kitab Taurat (sebagaimana Kami berikan Al-Quran kepadamu wahai Muhammad), maka janganlah engkau ragu-ragu menyambut dan menerimanya; dan Kami jadikan Kitab Taurat itu hidayah penunjuk bagi kaum Bani Israil."
  },
  {
    "surah": 32,
    "ayat": 24,
    "terjemahan": "Dan Kami jadikan dari kalangan mereka beberapa pemimpin, yang membimbing kaum masing-masing kepada hukum ugama Kami, selama mereka bersikap sabar (dalam menjalankan tugas itu) serta mereka tetap yakin akan ayat-ayat keterangan Kami."
  },
  {
    "surah": 32,
    "ayat": 25,
    "terjemahan": "(Pertentangan di antara satu golongan dengan yang lain itu) sesungguhnya Tuhanmu sahajalah yang akan memutuskan hukumNya di antara mereka pada hari kiamat, mengenai apa yang mereka berselisihan padanya."
  },
  {
    "surah": 32,
    "ayat": 26,
    "terjemahan": "Dan belumkah lagi ternyata kepada mereka (yang kafir itu): bahawa Kami telah binasakan berapa banyak dari kaum-kaum yang kufur ingkar dahulu daripada mereka, padahal mereka sekarang berulang-alik melalui tempat-tempat tinggal kaum-kaum itu? Sesungguhnya kebinasaan kaum-kaum itu mengandungi keterangan-keterangan (untuk mengambil iktibar); oleh itu tidakkah mereka mahu mendengar (dan insaf)?"
  },
  {
    "surah": 32,
    "ayat": 27,
    "terjemahan": "Dan tidakkah mereka (yang tidak mahu taat dan bersyukur) itu melihat bahawasanya Kami mengarahkan turunnya hujan ke bumi yang kering kontang, lalu Kami tumbuhkan dengan air hujan itu tanaman-tanaman, yang daripadanya dimakan oleh binatang-binatang ternak mereka dan mereka sendiri? Maka mengapa mereka tidak mahu memerhati (semuanya itu supaya taat dan bersyukur)?"
  },
  {
    "surah": 32,
    "ayat": 28,
    "terjemahan": "Dan mereka bertanya: \"Bilakah datangnya hari pembukaan bicara yang dikatakan itu jika betul kamu orang-orang yang benar?\""
  },
  {
    "surah": 32,
    "ayat": 29,
    "terjemahan": "Katakanlah (wahai Muhammad): \"(Tidak perlu diketahui masa datangnya tetapi mesti dipercayai bahawa) pada hari pembukaan bicara itu, tidak ada gunanya lagi kepada orang-orang kafir kiranya mereka hendak beriman, dan mereka pula tidak akan diberi tempoh (berbuat demikian)\"."
  },
  {
    "surah": 32,
    "ayat": 30,
    "terjemahan": "Oleh itu, janganlah engkau hiraukan mereka, dan tunggulah (kesudahan mereka), sesungguhnya mereka pun menunggu (kesudahanmu)."
  },
  {
    "surah": 33,
    "ayat": 1,
    "terjemahan": "Wahai Nabi! Tetaplah bertaqwa kepada Allah, dan janganlah engkau patuhi kehendak orang-orang kafir dan orang-orang munafik. Sesungguhnya Allah adalah Maha Mengetahui, lagi Maha Bijaksana."
  },
  {
    "surah": 33,
    "ayat": 2,
    "terjemahan": "Dan turutlah akan apa yang diwahyukan kepadamu dari Tuhanmu, (dan janganlah menurut adat resam Jahiliyah); sesungguhnya Allah sentiasa Mengetahui dengan mendalam akan apa yang kamu lakukan."
  },
  {
    "surah": 33,
    "ayat": 3,
    "terjemahan": "Dan berserahlah kepada Allah (dan janganlah menumpukan harapanmu kepada yang lain), kerana cukuplah Allah menjadi Pentadbir urusanmu."
  },
  {
    "surah": 33,
    "ayat": 4,
    "terjemahan": "(Diperintahkan dengan yang demikian kerana) Allah tidak sekali-kali menjadikan seseorang mempunyai dua hati dalam rongga dadanya; dan Ia tidak menjadikan isteri-isteri yang kamu \"zihar\" kan itu sebagai ibu kamu; dan Ia juga tidak menjadikan anak-anak angkat kamu, sebagai anak kamu sendiri. Segala yang kamu dakwakan mengenai perkara-perkara) yang tersebut itu hanyalah perkataan kamu dengan mulut kamu sahaja. Dan (ingatlah) Allah menerangkan yang benar dan Dia lah jua yang memimpin ke jalan yang betul."
  },
  {
    "surah": 33,
    "ayat": 5,
    "terjemahan": "Panggilah anak-anak angkat itu dengan ber\"bin\"kan kepada bapa-bapa mereka sendiri; cara itulah yang lebih adil di sisi Allah. Dalam pada itu, jika kamu tidak mengetahui bapa-bapa mereka, maka panggilah mereka sebagai saudara-saudara kamu yang seugama dan sebagai \"maula-maula\" kamu. Dan kamu pula tidak dikira berdosa dalam perkara yang kamu tersilap melakukannya, tetapi (yang dikira berdosa itu ialah perbuatan) yang disengajakan oleh hati kamu melakukannya. Dan (ingatlah Allah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 33,
    "ayat": 6,
    "terjemahan": "Nabi itu lebih menolong dan lebih menjaga kebaikan orang-orang yang beriman daripada diri mereka sendiri; dan isteri-isterinya adalah menjadi ibu mereka. Dan orang-orang yang mempunyai pertalian kerabat, setengahnya lebih berhak (mewarisi) akan setengahnya yang lain - menurut (hukum) Kitab Allah - daripada orang-orang yang beriman dan orang-orang Muhajirin (yang bukan kerabatnya), kecuali kalau kamu hendak berbuat baik kepada sahabat-sahabat karib kamu. Hukum yang demikian itu adalah tertulis dalam Kitab Allah."
  },
  {
    "surah": 33,
    "ayat": 7,
    "terjemahan": "(Teruslah bertaqwa kepada Kami) dan (ingatlah) ketika Kami mengambil dari Nabi-nabi (umumnya): perjanjian setia mereka, dan (khasnya) dari engkau sendiri (wahai Muhammad), dan dari Nabi Nuh, dan Nabi Ibrahim, dan Nabi Musa, serta. Nabi Isa ibni Maryam; dan Kami telah mengambil dari mereka: perjanjian setia yang teguh (bagi menyempurnakan apa yang ditugaskan kepada mereka);"
  },
  {
    "surah": 33,
    "ayat": 8,
    "terjemahan": "(Tuhan berbuat demikian) supaya Ia menyoal orang-orang yang benar beriman tentang kebenaran iman mereka (untuk menyempurnakan balasan baik mereka); dan (sebaliknya) Ia telah menyediakan bagi orang-orang yang kafir, azab seksa yang tidak terperi sakitnya."
  },
  {
    "surah": 33,
    "ayat": 9,
    "terjemahan": "Wahai orang-orang yang beriman, kenangkanlah nikmat Allah yang dilimpahkanNya kepada kamu. Semasa kamu didatangi tentera (Al-Ahzaab), lalu Kami hantarkan kepada mereka angin ribut (yang kencang) serta angkatan tentera (dari malaikat) yang kamu tidak dapat melihatnya. Dan (ingatlah) Allah sentiasa melihat apa yang kamu lakukan."
  },
  {
    "surah": 33,
    "ayat": 10,
    "terjemahan": "Masa itu ialah masa tentera musuh datang melanggar kamu dari sebelah hulu dan dari sebelah hilir (tempat pertahanan) kamu; dan masa itu ialah masa pemandangan mata kamu tidak berketentuan arah (kerana gempar dan bingung) serta hati pun resah gelisah (kerana cemas takut), dan kamu masing-masing pula menyangka terhadap Allah dengan berbagai-bagai sangkaan."
  },
  {
    "surah": 33,
    "ayat": 11,
    "terjemahan": "Pada saat itulah diuji orang-orang yang beriman, dan digoncangkan perasaan dan pendiriannya dengan goncangan yang amat dahsyat."
  },
  {
    "surah": 33,
    "ayat": 12,
    "terjemahan": "Dan lagi masa itu ialah masa orang-orang munafik dan orang-orang yang tidak sihat dan tidak kuat iman dalam hatinya berkata: \"Allah dan RasulNya tidak menjanjikan kepada kita melainkan perkara yang memperdayakan sahaja\"."
  },
  {
    "surah": 33,
    "ayat": 13,
    "terjemahan": "Dan juga masa itu ialah masa segolongan di antara mereka berkata: \"Wahai penduduk Yathrib, tempat ini bukan tempat bagi kamu (untuk berjuang di sini), oleh itu baliklah\". Dan sebahagian dari mereka pula meminta izin kepada Nabi (hendak balik) sambil berkata: \"Sesungguhnya rumah-rumah kami memerlukan perlindungan\", pada hal ia tidak memerlukan perlindungan. Mereka hanya bertujuan hendak melarikan diri (dari berjuang menegakkan Islam)."
  },
  {
    "surah": 33,
    "ayat": 14,
    "terjemahan": "Dan kalaulah tempat-tempat kediaman mereka itu diserang oleh musuh dari segala penjurunya, kemudian mereka diajak berpaling tadah menentang Islam, sudah tentu mereka akan melakukannya, dan mereka tidak bertangguh lagi tentang itu melainkan sebentar sahaja."
  },
  {
    "surah": 33,
    "ayat": 15,
    "terjemahan": "Pada hal sesungguhnya mereka telahpun mengikat janji dengan Allah sebelum itu, iaitu mereka tidak akan berpaling undur (dari medan perang yang mereka hadiri). Dan (ingatlah) janji setia dengan Allah itu akan ditanya kelak (tentang penyempurnaannya)."
  },
  {
    "surah": 33,
    "ayat": 16,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Kalaulah kamu melarikan diri dari kematian atau dari pembunuhan maka perbuatan melarikan diri itu tidak sekali-kali mendatangkan faedah kepada kamu; dan kalaulah kamu pada hari ini terlepas sekalipun, maka kamu tidak juga akan menikmati kesenangan hidup melainkan sedikit masa sahaja\"."
  },
  {
    "surah": 33,
    "ayat": 17,
    "terjemahan": "Katakanlah: \"Siapakah yang dapat melindungi kamu dari kemurkaan Allah jika Ia mahu menimpakan bala bencana kepada kamu, atau (siapakah yang dapat menahan kemurahan Allah) jika Ia hendak memberikan rahmat kepada kamu? \" Dan (ingatkanlah) mereka (yang munafik) itu: bahawa mereka tidak akan beroleh sesiapapun - yang lain dari Allah - yang akan menjadi pelindung atau penolong mereka."
  },
  {
    "surah": 33,
    "ayat": 18,
    "terjemahan": "Sesungguhnya Allah mengetahui akan orang-orang (munafik) yang menghalangi di antara kamu, dan orang-orang yang berkata kepada saudara-saudaranya: \"Marilah bersatu dengan kami\", sedang mereka tidak turut berperang melainkan sebentar sahaja."
  },
  {
    "surah": 33,
    "ayat": 19,
    "terjemahan": "Mereka bersikap bakhil kedekut terhadap kamu (wahai orang-orang mukmin untuk memberikan sebarang pertolongan); dalam pada itu apabila datang (ancaman musuh yang menimbulkan) ketakutan, engkau melihat mereka memandang kepadamu (wahai Muhammad, meminta pertolonganmu) dengan keadaan mata mereka berputar seperti orang yang pengsan semasa hampir mati. Kemudian apabila hilang perasaan takut itu, mereka mencela kamu dengan lidah yang tajam, sambil mereka tamakan kebaikan (yang diberikan Allah kepada kamu). Mereka itu tidak beriman, lalu Allah gugurkan amal-amal mereka. Dan yang demikian itu adalah mudah bagi Allah melaksanakannya."
  },
  {
    "surah": 33,
    "ayat": 20,
    "terjemahan": "Mereka menyangka bahawa tentera \"Al-Ahzaab\" itu belum pergi; dan kalaulah tentera Al-Ahzaab datang semula, tentulah mereka suka kalau mereka tinggal jauh di desa-desa bersama-sama orang-orang Arab Badwi sambil bertanyakan berita mengenai kamu; dan kalaulah mereka ada bersama-sama kamu (pada ketika itu), mereka tidak akan turut berperang melainkan sebentar sahaja."
  },
  {
    "surah": 33,
    "ayat": 21,
    "terjemahan": "Demi sesungguhnya, adalah bagi kamu pada diri Rasulullah itu contoh ikutan yang baik, iaitu bagi orang yang sentiasa mengharapkan (keredaan) Allah dan (balasan baik) hari akhirat, serta ia pula menyebut dan mengingati Allah banyak-banyak (dalam masa susah dan senang)"
  },
  {
    "surah": 33,
    "ayat": 22,
    "terjemahan": "Dan pada masa orang-orang yang beriman melihat tentera Al-Ahzaab, berkatalah mereka:\" Inilah yang telah dijanjikan Allah dan RasulNya kepada kami dan benarlah (apa yang telah dijanjikan) Allah dan RasulNya\". Dan (angkatan tentera musuh yang mereka lihat) itu tidak memberi sebarang kesan kepada mereka selain daripada menambahkan iman dan penyerahan diri mereka bulat-bulat kepada Allah."
  },
  {
    "surah": 33,
    "ayat": 23,
    "terjemahan": "Di antara orang-orang yang beriman itu, ada yang bersikap benar menunaikan apa yang telah dijanjikannya kepada Allah (untuk berjuang membela Islam); maka di antara mereka ada yang telah selesai menjalankan janjinya itu (lalu gugur syahid), dan di antaranya ada yang menunggu giliran; dan mereka pula tidak mengubah (apa yang mereka janjikan itu) sedikitpun."
  },
  {
    "surah": 33,
    "ayat": 24,
    "terjemahan": "(Berlakunya yang demikian) supaya Allah membalas orang-orang yang benar disebabkan kebenaran mereka, dan menyeksa orang-orang yang munafik jika Ia kehendaki, atau Ia menerima taubat mereka. Sesungguhnya Allah adalah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 33,
    "ayat": 25,
    "terjemahan": "Dan Allah telah menghalau kembali (angkatan tentera) orang-orang yang kafir itu (ke tempat masing-masing) dengan keadaan mereka geram marah (kerana gagal dan hampa), mereka tidak mendapat sebarang keuntungan. Dan Allah selamatkan orang-orang yang beriman dari bencana menghadapi peperangan itu. Dan (ingatlah) adalah Allah Maha Kuat, lagi Maha Kuasa."
  },
  {
    "surah": 33,
    "ayat": 26,
    "terjemahan": "Dan Ia menurunkan golongan Ahli Kitab (kaum Yahudi) yang membantu tentera musuh itu, dari benteng-benteng mereka (menyerah diri), setelah diisikanNya hati mereka dengan perasaan gerun. (Lalu mereka diadili dan dijatuhkan (hukuman); sebahagian di antaranya kamu bunuh, dan sebahagian lagi kamu tawan."
  },
  {
    "surah": 33,
    "ayat": 27,
    "terjemahan": "Dan Ia menjadikan kamu mewarisi tanah-tanah dan rumah-rumah serta harta benda mereka, dan juga tanah-tanah (di negeri-negeri lain) yang belum kamu menjejaknya. Dan (ingatlah) adalah Allah Maha Kuasa atas tiap-tiap sesuatu."
  },
  {
    "surah": 33,
    "ayat": 28,
    "terjemahan": "Wahai Nabi, katakanlah kepada isteri-isterimu: \"Sekiranya kamu semua mahukan kehidupan dunia (yang mewah) dan perhiasannya (yang indah), maka marilah supaya aku berikan kepada kamu pemberian mut'ah (sagu hati), dan aku lepaskan kamu dengan cara yang sebaik-baiknya."
  },
  {
    "surah": 33,
    "ayat": 29,
    "terjemahan": "\"Dan sekiranya kamu semua mahukan (keredaan) Allah dan RasulNya serta (nikmat kemewahan) di negeri akhirat maka sesungguhnya Allah menyediakan bagi orang-orang yang berbuat baik di antara kamu: pahala yang besar\"."
  },
  {
    "surah": 33,
    "ayat": 30,
    "terjemahan": "Wahai isteri-isteri Nabi, sesiapa di antara kamu yang melakukan sesuatu perbuatan keji yang nyata, nescaya akan digandakan azab seksa baginya dua kali ganda. Dan (hukuman) yang demikian itu adalah mudah bagi Allah melaksanakannya."
  },
  {
    "surah": 33,
    "ayat": 31,
    "terjemahan": "Dan sesiapa di antara kamu semua tetap taat kepada Allah dan RasulNya serta mengerjakan amal yang soleh, Kami akan beri kepadanya pahala amalnya itu dua kali ganda, dan Kami sediakan baginya limpah kurnia yang mulia."
  },
  {
    "surah": 33,
    "ayat": 32,
    "terjemahan": "Wahai isteri-isteri Nabi, kamu semua bukanlah seperti mana-mana perempuan yang lain kalau kamu tetap bertaqwa. Oleh itu janganlah kamu berkata-kata dengan lembut manja (semasa bercakap dengan lelaki asing) kerana yang demikian boleh menimbulkan keinginan orang yang ada penyakit dalam hatinya (menaruh tujuan buruk kepada kamu), dan sebaliknya berkatalah dengan kata-kata yang baik (sesuai dan sopan)."
  },
  {
    "surah": 33,
    "ayat": 33,
    "terjemahan": "Dan hendaklah kamu tetap diam di rumah kamu serta janganlah kamu mendedahkan diri seperti yang dilakukan oleh orang-orang Jahiliyah zaman dahulu; dan dirikanlah sembahyang serta berilah zakat; dan taatlah kamu kepada Allah dan RasulNya. Sesungguhnya Allah (perintahkan kamu dengan semuanya itu) hanyalah kerana hendak menghapuskan perkara-perkara yang mencemarkan diri kamu - wahai \"AhlulBait\" dan hendak membersihkan kamu sebersih-bersihnya (dari segala perkara yang keji)."
  },
  {
    "surah": 33,
    "ayat": 34,
    "terjemahan": "Dan ingatlah (serta amalkanlah) apa yang dibaca di rumah kamu dari ayat-ayat Allah (Al-Quran) dan hikmah pengetahuan (hadis-hadis Rasulullah). Sesungguhnya Allah Maha Halus tadbirNya, lagi Maha Mendalam pengetahuanNya."
  },
  {
    "surah": 33,
    "ayat": 35,
    "terjemahan": "Sesungguhnya orang-orang lelaki yang Islam serta orang-orang perempuan yang Islam, dan orang-orang lelaki yang beriman serta orang-orang perempuan yang beriman, dan orang-orang lelaki yang taat serta orang-orang perempuan yang taat, dan orang-orang lelaki yang benar serta orang-orang perempuan yang benar, dan orang-orang lelaki yang sabar serta orang-orang perempuan yang sabar, dan orang-orang lelaki yang merendah diri (kepada Allah) serta orang-orang perempuan yang merendah diri (kepada Allah), dan orang-orang lelaki yang bersedekah serta orang-orang perempuan yang bersedekah, dan orang-orang lelaki yang berpuasa serta orang-orang perempuan yang berpuasa, dan orang-orang lelaki yang memelihara kehormatannya serta orang-orang perempuan yang memelihara kehormatannya, dan orang-orang lelaki yang menyebut nama Allah banyak-banyak serta orang-orang perempuan yang menyebut nama Allah banyak-banyak, Allah telah menyediakan bagi mereka semuanya keampunan dan pahala yang besar."
  },
  {
    "surah": 33,
    "ayat": 36,
    "terjemahan": "Dan tidaklah harus bagi orang-orang yang beriman, lelaki dan perempuan - apabila Allah dan RasulNya menetapkan keputusan mengenai sesuatu perkara - (tidaklah harus mereka) mempunyai hak memilih ketetapan sendiri mengenai urusan mereka. Dan sesiapa yang tidak taat kepada hukum Allah dan RasulNya maka sesungguhnya ia telah sesat dengan kesesatan yang jelas nyata."
  },
  {
    "surah": 33,
    "ayat": 37,
    "terjemahan": "Dan (ingatlah wahai Muhammad) ketika engkau berkata kepada orang yang telah dikurniakan oleh Allah (dengan nikmat Islam) dan yang engkau juga telah berbuat baik kepadanya: \"Jangan ceraikan isterimu itu dan bertaqwalah kepada Allah\", sambil engkau menyembunyikan dalam hatimu perkara yang Allah akan menyatakannya; dan engkau pula takut kepada (cacian manusia padahal Allah jualah yang berhak engkau takuti (melanggar perintahNya). Kemudian setelah Zaid selesai habis kemahuannya terhadap isterinya (dengan menceraikannya), Kami kahwinkan engkau dengannya supaya tidak ada keberatan atas orang-orang yang beriman untuk berkahwin dengan isteri-isteri anak-anak angkat mereka, apabila anak-anak angkat itu telah selesai habis kemahuannya terhadap isterinya (lalu menceraikannya). Dan sememangnya perkara yang dikehendaki Allah itu tetap berlaku."
  },
  {
    "surah": 33,
    "ayat": 38,
    "terjemahan": "Tidaklah ada sebarang keberatan yang ditanggung oleh Nabi dalam melaksanakan perkara yang telah ditetapkan Allah baginya. (Yang demikian itu) adalah menurut peraturan Allah yang tetap, yang berlaku juga kepada Nabi-nabi yang telah lalu. Dan (ingatlah) perintah Allah itu adalah satu ketetapan yang ditentukan berlakunya."
  },
  {
    "surah": 33,
    "ayat": 39,
    "terjemahan": "(Nabi-nabi yang telah lalu itu) ialah orang-orang yang menyampaikan syariat Allah serta mereka takut melanggar perintahNya, dan mereka pula tidak takut kepada sesiapa pun melainkan kepada Allah. Dan cukuplah Allah menjadi Penghitung (segala yang dilakukan oleh makhluk-makhlukNya untuk membalas mereka)."
  },
  {
    "surah": 33,
    "ayat": 40,
    "terjemahan": "Bukanlah Nabi Muhammad itu (dengan sebab ada anak angkatnya) menjadi bapa yang sebenar bagi seseorang dari orang lelaki kamu, tetapi ia adalah Rasul Allah dan kesudahan segala Nabi-nabi. Dan (ingatlah) Allah adalah Maha Mengetahui akan tiap-tiap sesuatu."
  },
  {
    "surah": 33,
    "ayat": 41,
    "terjemahan": "Wahai orang-orang yang beriman, (untuk bersyukur kepada Allah) ingatlah serta sebutlah nama Allah dengan ingatan serta sebutan yang sebanyak-banyaknya;"
  },
  {
    "surah": 33,
    "ayat": 42,
    "terjemahan": "Dan bertasbihlah kamu kepadaNya pada waktu pagi dan petang."
  },
  {
    "surah": 33,
    "ayat": 43,
    "terjemahan": "Dia lah yang memberi rahmat kepada kamu - dan malaikatNya pula (berdoa bagi kamu) - untuk mengeluarkan kamu dari gelap-gelita (kufur dan maksiat) kepada cahaya yang terang-benderang (iman dari taat); dan adalah Ia sentiasa Melimpah-limpah rahmatNya kepada orang-orang yang beriman (di dunia dan di akhirat)."
  },
  {
    "surah": 33,
    "ayat": 44,
    "terjemahan": "Sambutan penghormatan yang akan diberi Tuhan kepada mereka semasa menemuiNya ialah ucapan \"Salam\" (selamat sejahtera); dan Ia telah menyediakan untuk mereka pahala balasan yang mulia."
  },
  {
    "surah": 33,
    "ayat": 45,
    "terjemahan": "Wahai Nabi, sesungguhnya Kami mengutusmu sebagai saksi (terhadap umatmu), dan pembawa berita gembira (kepada orang-orang yang beriman) serta pemberi amaran (kepada orang-orang yang ingkar)."
  },
  {
    "surah": 33,
    "ayat": 46,
    "terjemahan": "Dan juga sebagai penyeru (umat manusia seluruhnya) kepada ugama Allah dengan taufiq yang diberiNya; dan sebagai lampu yang menerangi."
  },
  {
    "surah": 33,
    "ayat": 47,
    "terjemahan": "Dan (dengan itu) sampaikanlah berita yang mengembirakan kepada orang-orang yang beriman, bahawa sesungguhnya mereka akan beroleh limpah kurnia yang besar dari Allah."
  },
  {
    "surah": 33,
    "ayat": 48,
    "terjemahan": "Dan janganlah engkau menurut kehendak orang-orang kafir dan orang-orang munafik dan janganlah engkau hiraukan usikan dan celaan mereka, serta berserahlah kepada Allah (memelihara keadaanmu); dan cukuplah Allah menjadi Pelindung (yang menyelamatkanmu)."
  },
  {
    "surah": 33,
    "ayat": 49,
    "terjemahan": "Wahai orang-orang yang beriman, apabila kamu berkahwin dengan perempuan-perempuan yang beriman, kemudian kamu ceraikan mereka sebelum kamu menyentuhnya, maka tiadalah kamu berhak terhadap mereka mengenai sebarang idah yang kamu boleh hitungkan masanya. Oleh itu, berilah \"mut'ah\" (pemberian sagu hati) kepada mereka, dan lepaskanlah mereka dengan cara yang sebaik-baiknya."
  },
  {
    "surah": 33,
    "ayat": 50,
    "terjemahan": "Wahai Nabi, sesungguhnya Kami telah halalkan bagimu isteri-isterimu yang engkau berikan maskahwinnya, dan hamba-hamba perempuan yang engkau miliki dari apa yang telah dikurniakan Allah kepadamu sebagai tawanan perang; dan (Kami telah halalkan bagimu berkahwin dengan sepupu-sepupumu, iaitu): anak-anak perempuan bapa saudaramu (dari sebelah bapa) serta anak-anak perempuan emak saudaramu (dari sebelah bapa), dan anak-anak perempuan bapa saudaramu (dari sebelah ibu) serta anak-anak perempuan emak saudaramu (dari sebelah ibu) yang telah berhijrah bersama-sama denganmu; dan (Kami telah halalkan bagimu) mana-mana perempuan yang beriman yang memberikan dirinya kepada Nabi (untuk dikahwininya dengan tidak membayar maskahwin) kalaulah Nabi suka berkahwin dengannya; perkahwinan yang demikian adalah khas bagimu semata-mata, buka bagi orang-orang yang beriman umumnya; sesungguhnya Kami telah mengetahui apa yang Kami wajibkan kepada orang-orang mukmin mengenai isteri-isteri mereka dan hamba-hamba perempuan yang mereka miliki; - supaya tidak menjadi keberatan bagimu. Dan (ingatlah) Allah adalah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 33,
    "ayat": 51,
    "terjemahan": "Engkau boleh menangguhkan sesiapa yang engkau kehendaki dari mereka dan engkau boleh mendamping: sesiapa yang engkau kehendaki; dan sesiapa yang engkau hendak mendampinginya kembali dari mereka yang telah engkau jauhi itu maka tidaklah menjadi salah bagimu melakukannya; kebebasan yang diberikan kepadamu itu (bila diketahui oleh mereka) adalah lebih dekat untuk mententeramkan hati mereka, dan menjadikan mereka tidak berdukacita, serta menjadikan mereka pula reda akan apa yang engkau lakukan kepada mereka semuanya. Dan (ingatlah) Allah sedia mengetahui apa yang ada dalam hati kamu; dan Allah adalah Maha Mengetahui, lagi Maha Penyabar."
  },
  {
    "surah": 33,
    "ayat": 52,
    "terjemahan": "Tidak halal bagimu berkahwin dengan perempuan-perempuan yang lain sesudah (isteri-isterimu yang ada) itu, dan engkau juga tidak boleh menggantikan mereka dengan isteri-isteri yang baharu sekalipun engkau tertarik hati kepada kecantikan mereka, kecuali hamba-hamba perempuan yang engkau miliki. Dan (ingatlah) Allah sentiasa Mengawasi tiap-tiap sesuatu."
  },
  {
    "surah": 33,
    "ayat": 53,
    "terjemahan": "Wahai orang-orang yang beriman, janganlah kamu masuk ke rumah Nabi (menunggu makanan masak kerana hendak makan bersama), kecuali kamu dijemput untuk menghadiri jamuan, bukan dengan menunggu-nunggu masa sajiannya; tetapi apabila kamu dijemput maka masuklah (pada waktu yang ditetapkan); kemudian setelah kamu makan maka hendaklah masing-masing bersurai dan janganlah duduk bersenang-senang dengan berbual-bual. Sesungguhnya yang demikian itu menyakiti dan menyusahkan Nabi sehingga ia merasa malu (hendak menyatakan hal itu) kepada kamu, sedang Allah tidak malu daripada menyatakan kebenaran. Dan apabila kamu meminta sesuatu yang harus diminta dari isteri-isteri Nabi maka mintalah kepada mereka dari sebalik tabir. Cara yang demikian lebih suci bagi hati kamu dan hati mereka. Dan kamu tidak boleh sama sekali menyakiti Rasul Allah dan tidak boleh berkahwin dengan isteri-isterinya sesudah ia wafat selama-lamanya. Sesungguhnya segala yang tersebut itu adalah amat besar dosanya di sisi Allah."
  },
  {
    "surah": 33,
    "ayat": 54,
    "terjemahan": "(Awasilah keadaan-keadaan kamu, kerana) jika kamu nyatakan sesuatu atau kamu sembunyikan dia, maka sesungguhnya Allah sentiasa Mengetahui akan segala-galanya."
  },
  {
    "surah": 33,
    "ayat": 55,
    "terjemahan": "Tidak ada salahnya kepada perempuan-perempuan (yang tidak berpakaian yang melindungi anggota yang haram dipandang oleh lelaki asing itu) menemui bapa-bapa mereka, dan anak-anak lelaki mereka, dan saudara-saudara lelaki mereka, dan anak-anak lelaki saudara-saudara lelaki mereka, dan anak-anak lelaki saudara-saudara perempuan mereka, dan perempuan-perempuan Islam mereka, serta hamba-hamba yang dimiliki oleh mereka. Dan bertaqwalah kamu kepada Allah; sesungguhnya Allah sentiasa Menyaksikan tiap-tiap sesuatu."
  },
  {
    "surah": 33,
    "ayat": 56,
    "terjemahan": "Sesungguhnya Allah dan malaikatNya berselawat (memberi segala penghormatan dan kebaikan) kepada Nabi (Muhammad s.a.w); wahai orang-orang yang beriman berselawatlah kamu kepadanya serta ucapkanlah salam sejahtera dengan penghormatan yang sepenuhnya."
  },
  {
    "surah": 33,
    "ayat": 57,
    "terjemahan": "Sesungguhnya orang-orang yang melakukan perkara yang tidak diredai Allah dan RasulNya, Allah melaknatkan mereka di dunia dan di akhirat, dan menyediakan untuk mereka azab seksa yang menghina."
  },
  {
    "surah": 33,
    "ayat": 58,
    "terjemahan": "Dan orang-orang yang mengganggu serta menyakiti orang-orang lelaki yang beriman dan orang-orang perempuan yang beriman dengan perkataan atau perbuatan yang tidak tepat dengan sesuatu kesalahan yang dilakukannya, maka sesungguhnya mereka telah memikul kesalahan menuduh secara dusta, dan berbuat dosa yang amat nyata."
  },
  {
    "surah": 33,
    "ayat": 59,
    "terjemahan": "Wahai Nabi, suruhlah isteri-isterimu dan anak-anak perempuanmu serta perempuan-perempuan yang beriman, supaya melabuhkan pakaiannya bagi menutup seluruh tubuhnya (semasa mereka keluar); cara yang demikian lebih sesuai untuk mereka dikenal (sebagai perempuan yang baik-baik) maka dengan itu mereka tidak diganggu. Dan (ingatlah) Allah adalah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 33,
    "ayat": 60,
    "terjemahan": "Demi sesungguhnya, jika orang-orang munafik, dan orang-orang yang ada penyakit (syak ragu-ragu) dalam hatinya, serta orang-orang yang menyebarkan berita-berita dusta di Madinah itu tidak berhenti (dari perbuatan jahat masing-masing), nescaya Kami akan mendesakmu memerangi mereka; sesudah itu mereka tidak akan tinggal berjiran denganmu di Madinah lagi melainkan sebentar sahaja,"
  },
  {
    "surah": 33,
    "ayat": 61,
    "terjemahan": "serta mereka tetap ditimpa laknat. Di mana sahaja mereka ditemui, mereka ditangkap dan dibunuh habis-habisan."
  },
  {
    "surah": 33,
    "ayat": 62,
    "terjemahan": "Yang demikian adalah menurut \"Sunnatullah\" (undang-undang peraturan Allah yang telah lalu; dan engkau tidak sekali-kali akan mendapati sebarang perubahan bagi \"Sunnatullah\" itu."
  },
  {
    "surah": 33,
    "ayat": 63,
    "terjemahan": "Manusia bertanya kepadamu (wahai Muhammad) tentang kedatangan hari kiamat; katakanlah: \"Sesungguhnya pengetahuan mengenainya hanyalah ada di sisi Allah. \" Dan apa jalannya engkau dapat mengetahui? - boleh jadi masa datangnya tidak lama lagi."
  },
  {
    "surah": 33,
    "ayat": 64,
    "terjemahan": "Sesungguhnya Allah telah melaknat orang-orang kafir dan menyediakan bagi mereka api neraka yang marak menjulang, -"
  },
  {
    "surah": 33,
    "ayat": 65,
    "terjemahan": "kekalah mereka di dalamnya selama-lamanya; mereka pula tidak akan memperoleh sesiapapun yang akan menjadi pelindung atau penolong."
  },
  {
    "surah": 33,
    "ayat": 66,
    "terjemahan": "Pada masa muka mereka dibalik-balikkan dalam neraka, mereka berkata (dengan sesalnya): \"Alangkah baiknya kalau kami dahulu (semasa di dunia) taat kepada Allah serta taat kepada Rasul Allah."
  },
  {
    "surah": 33,
    "ayat": 67,
    "terjemahan": "Dan mereka berkata lagi: \"Wahai Tuhan kami, sesungguhnya kami telah mematuhi kehendak ketua-ketua dan orang-orang besar kami, lalu mereka menyesatkan kami dari jalan yang benar."
  },
  {
    "surah": 33,
    "ayat": 68,
    "terjemahan": "\"Wahai Tuhan kami, berilah mereka azab sengsara dua kali ganda, dan laknatkanlah mereka dengan laknat yang sebesar-besarnya!\""
  },
  {
    "surah": 33,
    "ayat": 69,
    "terjemahan": "Wahai orang-orang yang beriman, janganlah kamu menjadi seperti orang-orang (Yahudi) yang telah mencaci Nabi Musa, lalu Allah membersihkannya dari segala cacian yang mereka katakan; dan adalah dia seorang yang mulia di sisi Allah."
  },
  {
    "surah": 33,
    "ayat": 70,
    "terjemahan": "Wahai orang-orang yang beriman, bertaqwalah kepada Allah, dan katakanlah perkataan yang tepat - benar (dalam segala perkara),"
  },
  {
    "surah": 33,
    "ayat": 71,
    "terjemahan": "Supaya Ia memberi taufiq dengan menjayakan amal-amal kamu, dan mengampunkan dosa-dosa kamu. Dan (ingatlah) sesiapa yang taat kepada Allah dan RasulNya, maka sesungguhnya ia telah berjaya mencapai sebesar-besar kejayaan."
  },
  {
    "surah": 33,
    "ayat": 72,
    "terjemahan": "Sesungguhnya Kami telah kemukakan tanggungjawab amanah (Kami) kepada langit dan bumi serta gunung-ganang (untuk memikulnya), maka mereka enggan memikulnya dan bimbang tidak dapat menyempurnakannya (kerana tidak ada pada mereka persediaan untuk memikulnya); dan (pada ketika itu) manusia (dengan persediaan yang ada padanya) sanggup memikulnya. (Ingatlah) sesungguhnya tabiat kebanyakan manusia adalah suka melakukan kezaliman dan suka pula membuat perkara-perkara yang tidak patut dikerjakan."
  },
  {
    "surah": 33,
    "ayat": 73,
    "terjemahan": "(Dengan kesanggupan manusia memikul amanah itu maka) akibatnya Allah akan menyeksa orang-orang lelaki yang munafik serta orang-orang perempuan yang munafik, dan orang-orang lelaki yang musyrik serta orang-orang perempuan yang musyrik; dan juga Allah akan menerima taubat orang-orang lelaki yang beriman serta orang-orang perempuan yang beriman. Dan sememangnya Allah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 34,
    "ayat": 1,
    "terjemahan": "Segala puji tertentu bagi Allah yang memiliki dan menguasai segala yang ada di langit dan yang ada di bumi, dan bagiNyalah juga segala puji di akhirat; dan Dia lah sahaja Yang Maha Bijaksana, lagi Maha Mendalam pengetahuanNya."
  },
  {
    "surah": 34,
    "ayat": 2,
    "terjemahan": "Ia mengetahui apa yang masuk ke bumi serta apa yang keluar daripadanya, dan apa yang turun dari langit serta apa yang naik kepadanya; dan Dia lah jua yang Maha Mengasihani, lagi Maha Pengampun."
  },
  {
    "surah": 34,
    "ayat": 3,
    "terjemahan": "Dan orang-orang yang kafir berkata:\" Hari kiamat itu tidak akan datang kepada kami\". Katakanlah (wahai Muhammad): \"Bahkan (tetap datang). Demi Tuhanku yang mengetahui segala perkara yang ghaib, hari kiamat itu sesungguhnya akan datang kepada kamu\". Tiada tersembunyi dari pengetahuanNya barang seberat debu yang ada di langit atau di bumi, dan tidak ada yang lebih kecil dari itu atau yang lebih besar melainkan semuanya tertulis di dalam Kitab yang terang nyata."
  },
  {
    "surah": 34,
    "ayat": 4,
    "terjemahan": "(Kedatangan hari kiamat itu) supaya Tuhan membalas orang-orang yang beriman dan beramal soleh; mereka itu akan beroleh keampunan dan limpah kurnia yang mulia."
  },
  {
    "surah": 34,
    "ayat": 5,
    "terjemahan": "Dan (sebaliknya) orang-orang yang berusaha menentang dan membatalkan ayat-ayat keterangan Kami sambil menyangka dapat melepaskan diri (dari hukuman Kami), - mereka itu akan beroleh azab dari jenis azab seksa yang tidak terperi sakitnya."
  },
  {
    "surah": 34,
    "ayat": 6,
    "terjemahan": "Dan orang-orang yang diberi ilmu pengetahuan, mengetahui (dengan yakin, bahawa keterangan-keterangan) yang diturunkan kepadamu dari Tuhanmu (mengenai hari kiamat dan lain-lainnya) itulah yang benar serta yang memimpin ke jalan Allah Yang Maha Kuasa, lagi Maha Terpuji."
  },
  {
    "surah": 34,
    "ayat": 7,
    "terjemahan": "Dan orang-orang yang kafir pula berkata (sesama sendiri secara mengejek-ejek): \"Mahukah, kami tunjukkan kepada kamu seorang lelaki yang memberitakan kepada kamu: ` (Bahawa apabila kamu dihancurkan sehancur-hanurnya sesudah mati), sesungguhnya kamu akan dihidupkan semula dalam bentuk kejadian yang baru? '"
  },
  {
    "surah": 34,
    "ayat": 8,
    "terjemahan": "\"Adakah ia berdusta terhadap Allah, atau ia kena penyakit gila?\" (Tidak ada satupun) bahkan orang-orang yang tidak percaya kepada hari akhirat tetap beroleh (di sana) azab seksa yang seburuk-buruknya dan (di sini) tetap berada dalam kesesatan yang jauh terpesong."
  },
  {
    "surah": 34,
    "ayat": 9,
    "terjemahan": "(Setelah mereka mengejek-ejek dan membuat tuduhan-tuduhan itu) tidakkah mereka melihat apa yang ada di hadapan mereka dan yang ada di belakang mereka dari langit dan bumi (dapatkah mereka melarikan diri)? Jika Kami kehendaki nescaya Kami timbuskan mereka di bumi, atau Kami gugurkan atas mereka ketul-ketul dan serpihan-serpihan dari langit (yang akan membinasakan mereka). Sesungguhnya yang demikian mengandungi satu tanda (yang memberi keinsafan) bagi tiap-tiap hamba Allah yang mahu kembali kepadanya (dengan taat dan berbakti)."
  },
  {
    "surah": 34,
    "ayat": 10,
    "terjemahan": "Dan demi sesungguhnya, Kami telah memberikan kepada Nabi Daud limpah kurnia dari Kami (sambil Kami berfirman): \"Hai gunung-ganang, ulang-ulangilah mengucap tasbih bersama-sama dengan Nabi Daud, dan wahai burung-burung (bertasbihlah bersama-sama dengannya)!\" Dan juga telah melembutkan besi baginya;"
  },
  {
    "surah": 34,
    "ayat": 11,
    "terjemahan": "(Serta Kami wahyukan kepadanya): \"Buatlah baju-baju besi yang luas labuh, dan sempurnakanlah jalinannya sekadar yang dikehendaki; dan kerjakanlah kamu (wahai Daud dan umatmu) amal-amal yang soleh, sesungguhnya Aku Maha Melihat akan segala yang kamu kerjakan\"."
  },
  {
    "surah": 34,
    "ayat": 12,
    "terjemahan": "Dan Kami kurniakan kepada Nabi Sulaiman kuasa menggunakan angin untuk perjalanannya: sepagi perjalanannya adalah menyamai perjalanan biasa sebulan, dan sepetang perjalanannya adalah menyamai perjalanan biasa sebulan; dan Kami alirkan baginya matair dari tembaga; dan (Kami mudahkan) sebahagian dari jin untuk bekerja di hadapannya dengan izin Tuhannya. Dan sesiapa dari jin itu yang menyeleweng dari perintah Kami, Kami akan merasakannya (pukulan) dari azab api neraka."
  },
  {
    "surah": 34,
    "ayat": 13,
    "terjemahan": "Golongan jin itu membuat untuk Nabi Sulaiman apa yang ia kehendaki dari bangunan-bangunan yang tinggi, dan patung-patung, dan pinggan-pinggan hidangan yang besar seperti kolam, serta periuk-periuk besar yang tetap di atas tukunya. (Setelah itu Kami perintahkan): \"Beramalah kamu wahai keluarga Daud untuk bersyukur!\" Dan sememangnya sedikit sekali di antara hamba-hambaKu yang bersyukur."
  },
  {
    "surah": 34,
    "ayat": 14,
    "terjemahan": "Setelah Kami tetapkan berlakunya kematian Nabi Sulaiman, tidak ada yang menunjukkan kepada mereka tentang kematiannya melainkan semut putih (anai-anai) yang telah memakan tongkatnya. Maka apabila ia tumbang, ternyatalah kepada golongan jin itu, bahawa kalaulah mereka sedia, mengetahui perkara yang ghaib nescaya mereka tidak tinggal sedemikian lamanya di dalam azab (kerja berat) yang menghina."
  },
  {
    "surah": 34,
    "ayat": 15,
    "terjemahan": "Demi sesungguhnya, adalah bagi penduduk negeri Saba', satu tanda (yang membuktikan kemurahan Allah) yang terdapat di tempat tinggal mereka, iaitu: dua kumpulan kebun (yang luas lagi subur), yang terletak di sebelah kanan dan di sebelah kiri (kampung mereka). (Lalu dikatakan kepada mereka): \"Makanlah dari rezeki pemberian Tuhan kamu dan bersyukurlah kepadaNya; (negeri kamu ini adalah) negeri yang baik (aman dan makmur), dan (Tuhan kamu adalah) Tuhan yang Maha Pengampun!."
  },
  {
    "surah": 34,
    "ayat": 16,
    "terjemahan": "Maka mereka berpaling ingkar, lalu Kami hantarkan kepada mereka banjir yang membinasakan, dan Kami gantikan dua kumpulan kebun mereka (yang subur) itu dengan dua kumpulan kebun yang berisi dengan pohon-pohon yang pahit buahnya, dan pohon-pohon yang jarang berbuah, serta sedikit pohon-pohon bidara."
  },
  {
    "surah": 34,
    "ayat": 17,
    "terjemahan": "Demikianlah Kami membalas mereka disebabkan kekufuran mereka; dan sebenarnya Kami tidak menimpakan balasan yang demikian melainkan kepada orang-orang yang amat kufur."
  },
  {
    "surah": 34,
    "ayat": 18,
    "terjemahan": "Dan - di antara tempat tinggal mereka (di negeri Yaman) dengan bandar-bandar (di daerah negeri Syam) yang Kami limpahkan berkat kepadanya (dengan kemakmuran), - Kami adakan beberapa buah bandar yang jelas kelihatan (kepada orang-orang yang melalui jalan itu), dan Kami tentukan jarak perjalanan di antaranya (sekadar yang dapat dijadikan tempat-tempat persinggahan), (serta dikatakan kepada mereka): \" Berjalanlah kamu di bandar-bandar itu pada bila-bila masa yang kamu suka, malam dan siang, dalam keadaan yang aman\"."
  },
  {
    "surah": 34,
    "ayat": 19,
    "terjemahan": "(Maka kamakmuran dan kemudahan itu menjadikan mereka sombong dan kufur) lalu berkata: \"Wahai Tuhan kami, jauhkanlah jarak perjalanan kami (di antara sebuah bandar dengan yang lain)\", dan mereka berlaku zalim kepada diri mereka sendiri; lalu Kami jadikan (kisah perbuatan derhaka) mereka: buah mulut orang ramai, serta kami pecah belahkan mereka berkecai-kecai. Sesungguhnya kisah mereka yang tersebut mengandungi tanda-tanda (yang besar pengajarannya bagi tiap-tiap seorang (mukmin) yang sentiasa bersikap sabar, lagi sentiasa bersyukur."
  },
  {
    "surah": 34,
    "ayat": 20,
    "terjemahan": "Dan sesungguhnya Iblis telah dapati sangkaannya tepat terhadap mereka, iaitu mereka menurutnya, kecuali sebahagian dari orang-orang yang beriman (yang tidak terpedaya kepada hasutannya)."
  },
  {
    "surah": 34,
    "ayat": 21,
    "terjemahan": "Dan sememangnya tiadalah bagi Iblis sebarang kuasa untuk menyesatkan mereka, melainkan untuk menjadi ujian bagi melahirkan pengetahuan Kami tentang siapakah yang benar-benar beriman kepada hari akhirat dan siapa pula yang ragu-ragu terhadapnya. Dan (ingatlah) Tuhanmu sentiasa mengawal serta mengawasi tiap-tiap sesuatu."
  },
  {
    "surah": 34,
    "ayat": 22,
    "terjemahan": "Katakanlah (wahai Muhammad kepada kaum musyrik): \"Serukanlah makhluk-makhluk yang kamu dakwakan sebagai tuhan selain dari Allah; mereka tidak memiliki kuasa seberat debu pun di langit dan di bumi, dan mereka tiada sebarang bahagian perkongsian (dengan Allah) dalam (mencipta dan mentadbirkan) langit dan bumi, dan Allah pula tidak mendapat sebarang pertolongan dari mereka\"."
  },
  {
    "surah": 34,
    "ayat": 23,
    "terjemahan": "Dan tidak berfaedah syafaat di sisi Allah kecuali bagi orang yang telah diizinkan Allah, (maka orang-orang yang hendak memohon syafaat terpaksa menunggu izin itu dengan penuh perasaan takut dan bimbang) sehingga apabila dihapuskan Allah perasaan takut dari hati mereka (dengan pemberian izin itu) bersukarialah mereka dengan bertanya-tanyaan sesama sendiri: \"Apakah yang telah dititahkan oleh Tuhan kamu?\" Sebahagian di antara mereka menjawab: \"Tuhan telah menitahkan kebenaran\"; dan Dia lah jua Yang Maha Tinggi keadaanNya, lagi Maha Besar kekuasaanNya."
  },
  {
    "surah": 34,
    "ayat": 24,
    "terjemahan": "Bertanyalah (wahai Muhammad kepada orang-orang musyrik itu): \"Siapakah yang memberi rezeki kepada kamu dari langit dan bumi?\" Terangkanlah jawabnya: \"Ialah Allah; dan sesungguhnya (tiap-tiap satu golongan), sama ada golongan kami ahli tauhid atau golongan kamu ahli syirik - (tidak sunyi daripada salah satu dari dua keadaan): keadaan tetapnya di atas hidayah petunjuk atau tenggelamnya dalam kesesatan yang jelas nyata \"."
  },
  {
    "surah": 34,
    "ayat": 25,
    "terjemahan": "(Oleh itu) katakanlah (wahyu Muhammad): \"Kamu tidak akan bertanggungjawab tentang kesalahan yang kami lakukan, dan kami pula tidak akan bertanggungjawab tentang apa yang kamu kerjakan\"."
  },
  {
    "surah": 34,
    "ayat": 26,
    "terjemahan": "Katakanlah lagi:\" Tuhan kita akan menghimpunkan Kita semua (pada hari kiamat), kemudian Ia akan menyelesaikan perselisihan yang ada di antara kita dengan penyelesaian yang benar; dan Dia lah jua Hakim yang seadil-adilnya, lagi Yang Maha Mengetahui segala-galanya\"."
  },
  {
    "surah": 34,
    "ayat": 27,
    "terjemahan": "Katakanlah lagi: \"Tunjukkanlah kepadaku sifat-sifat ketuhanan yang ada pada makhluk-makhluk yang kamu hubungkan dengan Allah sebagai sekutu-sekutuNya. Tidak ada pada sesuatu makhluk pun sifat-sifat itu, bahkan yang mempunyai sifat-sifat ketuhanan ialah Allah Yang Maha Kuasa, lagi Maha Bijaksana\"."
  },
  {
    "surah": 34,
    "ayat": 28,
    "terjemahan": "Dan tiadalah Kami mengutusmu (wahai Muhammad) melainkan untuk umat manusia seluruhnya, sebagai Rasul pembawa berita gembira (kepada orang-orang yang beriman), dan pemberi amaran (kepada orang-orang yang ingkar); akan tetapi kebanyakan manusia tidak mengetahui (hakikat itu)."
  },
  {
    "surah": 34,
    "ayat": 29,
    "terjemahan": "Dan mereka (yang ingkar) bertanya: \"Bilakah berlakunya azab yang telah dijanjikan itu, jika betul kamu orang-orang yang benar?\""
  },
  {
    "surah": 34,
    "ayat": 30,
    "terjemahan": "Jawablah (wahai Muhammad): \"Untuk kamu disediakan satu hari yang kamu tidak dapat melambatkannya sesaat pun, dan tidak pula kamu dapat menyegerakannya\"."
  },
  {
    "surah": 34,
    "ayat": 31,
    "terjemahan": "Dan orang-orang yang kafir berkata: Kami tidak akan beriman sama sekali kepada Al-Quran ini dan tidak juga kepada Kitab-kitab ugama yang terdahulu daripadanya\". Dan (sungguh ngeri) kalau engkau melihat ketika orang-orang yang zalim itu dibawa berdiri di hadapan Tuhan mereka (untuk dihisab), masing-masing tuduh menuduh antara satu dengan yang lain. Orang-orang yang tertindas berkata kepada orang-orang yang sombong takbur (yang menjadi ketuanya): \"Kalaulah tidak kerana kamu (menindas dan memperdayakan kami), tentulah kami sudah menjadi orang yang beriman\"."
  },
  {
    "surah": 34,
    "ayat": 32,
    "terjemahan": "Orang-orang yang sombong takbur itu menjawab kepada orang-orang yang tertindas: Kamikah yang telah menghalang kamu daripada menerima hidayah petunjuk sesudah ia datang kepada kamu? (Bukan kami yang menghalang) bahkan kamulah yang menyebabkan diri sendiri menjadi orang-orang yang berdosa\"."
  },
  {
    "surah": 34,
    "ayat": 33,
    "terjemahan": "Dan berkata pula orang-orang yang tertindas kepada orang-orang yang sombong takbur itu: \"Tidak! Bahkan (yang menghalang kami daripada beriman ialah) perbuatan kamu memperdaya kami malam dan siang, ketika kamu menyuruh kami berlaku kufur kepada Allah dan mengadakan sekutu-sekutu bagiNya. Akhirnya masing-masing diam sambil memendamkan perasaan sesal dan kecewa semasa mereka melihat azab; dan Kami pasangkan belenggu-belenggu pada leher orang-orang yang kafir itu. Mereka tidak dibalas melainkan dengan apa yang mereka telah kerjakan."
  },
  {
    "surah": 34,
    "ayat": 34,
    "terjemahan": "Dan Kami tidak mengutus kepada sesebuah negeri: seseorang Rasul pemberi amaran melainkan orang-orang yang berada dalam kemewahan di negeri itu berkata: \"Sesungguhnya kami tetap mengingkari apa yang kamu diutuskan membawanya\"."
  },
  {
    "surah": 34,
    "ayat": 35,
    "terjemahan": "Dan mereka berkata lagi: \"Kami lebih banyak harta benda dan anak pinak, dan kami pula tidak akan diseksa\"."
  },
  {
    "surah": 34,
    "ayat": 36,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Sesungguhnya Tuhanku memewahkan rezeki bagi sesiapa yang dikehendakiNya, dan Dia juga yang menyempitkan (bagi sesiapa yang dikehendakiNya); akan tetapi kebanyakan manusia tidak mengetahui (hakikat itu)."
  },
  {
    "surah": 34,
    "ayat": 37,
    "terjemahan": "Dan bukanlah harta benda kamu dan tidak juga anak pinak kamu yang mendampingkan kamu di sisi Kami walau sedikitpun, kecuali orang-orang yang beriman dan beramal soleh, maka mereka itu akan beroleh balasan yang berlipat ganda disebabkan apa yang mereka telah kerjakan; dan mereka pula ditempatkan dalam mahligai-mahligai (di Syurga) dengan aman sentosa."
  },
  {
    "surah": 34,
    "ayat": 38,
    "terjemahan": "Dan orang-orang yang berusaha menentang dan membatalkan ayat-ayat keterangan Kami sambil menyangka dapat melepaskan diri (dari hukuman Kami), mereka itu akan berada di dalam azab seksa."
  },
  {
    "surah": 34,
    "ayat": 39,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Sesungguhnya Tuhanku memewahkan rezeki bagi sesiapa yang dikehendakiNya di antara hamba-hambaNya, dan Ia juga yang menyempitkan baginya; dan apa sahaja yang kamu dermakan maka Allah akan menggantikannya; dan Dia lah jua sebaik-baik Pemberi rezeki\"."
  },
  {
    "surah": 34,
    "ayat": 40,
    "terjemahan": "Dan (ingatkanlah) masa Allah menghimpunkan mereka semua (pada hari kiamat), kemudian Ia bertanya kepada malaikat: \"Adakah orang-orang ini, (kamu setujui) menyembah kamu dahulu?\""
  },
  {
    "surah": 34,
    "ayat": 41,
    "terjemahan": "Malaikat menjawab: \"Maha Suci Engkau (dari adanya sebarang sekutu denganMu). Engkaulah (yang kami hubungi sebagai Pemimpin dan) Pelindung kami bukan mereka. (Tidak ada hubungan dari pihak kami dengan mereka mengenai penyembahan mereka kepada kami), bahkan mereka adalah menyembah Jin Syaitan; kebanyakan mereka pula percaya kepada Jin Syaitan itu (sebagai sekutu Tuhan yang dipuja dan dipatuhi)\"."
  },
  {
    "surah": 34,
    "ayat": 42,
    "terjemahan": "Maka pada hari ini, masing-masing di antara kamu tidak berkuasa memberi sebarang manfaat kepada kawannya, dan tidak pula dapat menolak sesuatu bahaya daripadanya; dan Kami katakan kepada orang-orang yang zalim (yang berlaku syirik) itu: \"Rasalah azab neraka yang kamu dahulu mendustakannya\"."
  },
  {
    "surah": 34,
    "ayat": 43,
    "terjemahan": "Dan apabila dibacakan kepada mereka ayat-ayat keterangan Kami yang jelas nyata, berkatalah mereka (sesama sendiri): \"Orang ini (Muhammad) tidak lain hanyalah seorang lelaki yang hendak menghalang kamu daripada menyembah apa yang telah disembah oleh datuk nenek kamu\"; dan mereka berkata lagi: (Al-Quran) ini tidak lain hanyalah kata-kata dusta yang direka-reka\"; dan berkatalah orang-orang yang kafir terhadap kebenaran ketika datangnya kepada mereka: \"ini tidak lain hanyalah sihir yang terang nyata\"."
  },
  {
    "surah": 34,
    "ayat": 44,
    "terjemahan": "Dan (tidak ada sebarang alasan bagi dakwaan mereka, kerana) Kami tidak pernah memberi kepada mereka Kitab-kitab untuk mereka membaca dan mengkajinya, dan Kami juga tidak pernah mengutus kepada mereka sebelummu (wahai Muhammad) seseorang Rasul pemberi amaran (melarang mereka menerima ajaranmu)."
  },
  {
    "surah": 34,
    "ayat": 45,
    "terjemahan": "Dan (ketahuilah bahawa) umat-umat yang terdahulu sebelum mereka telah juga mendustakan (Rasul-rasulnya), sedang mereka (yang mendustakanmu) itu tidak: mencapai satu persepuluh (dari kekayaan, kepandaian dan kekuatan) yang Kami beri kepada umat-umat yang terdahulu itu; setelah umat-umat itu mendustakan Rasul-rasulKu (mereka pun dibinasakan). Dengan yang demikian perhatikanlah bagaimana buruknya akibat kemurkaanKu (menimpa mereka)."
  },
  {
    "surah": 34,
    "ayat": 46,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Aku hanyalah mengajar dan menasihati kamu dengan satu perkara sahaja, iaitu: hendaklah kamu bersungguh-sungguh berusaha mencari kebenaran kerana Allah semata-mata, sama ada dengan cara berdua (dengan orang lain), atau seorang diri; kemudian hendaklah kamu berfikir sematang-matangnya (untuk mengetahui salah benarnya ajaranKu)\". Sebenarnya tidak ada pada (Muhammad) yang menjadi sahabat kamu sebarang penyakit gila (sebagaimana yang dituduh); ia hanyalah seorang Rasul pemberi amaran kepada kamu, sebelum kamu ditimpa azab yang berat (di akhirat)."
  },
  {
    "surah": 34,
    "ayat": 47,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Apa jua yang aku harap kamu berikan kepadaku sebagai upah maka faedahnya tetap terpulang kepada kamu; balasan yang menjadi upahku yang sebenar hanyalah dari Allah, dan Ia sentiasa Memerhati serta Menyaksikan tiap-tiap sesuatu\"."
  },
  {
    "surah": 34,
    "ayat": 48,
    "terjemahan": "Katakanlah lagi: \"Sesungguhnya TuhanKu, menurunkan wahyu (kepada Nabi-nabi pilihanNya) dengan perkara yang benar; Ia sentiasa Mengetahui akan segala perkara yang ghaib\"."
  },
  {
    "surah": 34,
    "ayat": 49,
    "terjemahan": "Katakanlah lagi: \"Telah datang kebenaran (Al-Quran yang memberi segala kebaikan), dan perkara yang salah tidak memberi sebarang kebaikan di dunia, usahkan hendak mengulanginya di akhirat\"."
  },
  {
    "surah": 34,
    "ayat": 50,
    "terjemahan": "Katakanlah lagi: \"Sekiranya aku sesat maka bahaya kesesatanku akan menimpa diriku sendiri, dan jika aku beroleh hidayah petunjuk maka yang demikian disebabkan apa yang telah diwahyukan oleh Tuhanku kepadaku; sesungguhnya Ia Maha Mendengar, lagi Maha Dekat\"."
  },
  {
    "surah": 34,
    "ayat": 51,
    "terjemahan": "Dan (sungguh ngeri) jika engkau melihat (keadaan orang-orang yang bersalah itu) ketika mereka gelisah takut (menyaksikan azabnya) serta mereka tidak mendapat jalan mengelaknya, dan mereka pun diambil dari tempat mereka berada (untuk dibawa ke tempat azab)."
  },
  {
    "surah": 34,
    "ayat": 52,
    "terjemahan": "Dan (pada ketika itu) mereka berkata: \"Kami sekarang beriman kepada kebenaran yang di bawa oleh Nabi Muhammad (s.a.w)\"; (apa jalannya) dan bagaimana caranya mereka dapat mencapai iman dari tempat yang jauh?"
  },
  {
    "surah": 34,
    "ayat": 53,
    "terjemahan": "Pada hal mereka telah mengingkarinya sebelum itu, dan mereka pula selalu melemparkan tuduhan-tuduhan buta terhadap kebenaran itu dari tempat yang jauh? (sudah tentu salah)."
  },
  {
    "surah": 34,
    "ayat": 54,
    "terjemahan": "Dan disekatlah di antara mereka dengan (iman) yang mereka ingini, sebagaimana yang telah dilakukan kepada orang-orang yang sama keadaannya dengan mereka pada masa yang lalu; sesungguhnya mereka dahulu berada dalam keadaan syak yang meragukan."
  },
  {
    "surah": 35,
    "ayat": 1,
    "terjemahan": "Segala puji tertentu bagi Allah yang menciptakan langit dan bumi, yang menjadikan malaikat utusan-utusan yang bersayap: dua, tiga dan empat; Ia menambah pada bentuk kejadian makhluk yang diciptakanNya apa jua yang dikehendakiNya. Sesungguhnya Allah Maha Kuasa atas tiap-tiap sesuatu."
  },
  {
    "surah": 35,
    "ayat": 2,
    "terjemahan": "Apa jua jenis rahmat yang dibukakan oleh Allah kepada manusia, maka tidak ada sesuatupun yang dapat menahannya; dan apa jua yang ditahan oleh Allah maka tidak ada sesuatupun yang dapat melepaskannya sesudah itu. Dan (ingatlah) Dia lah sahaja yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 35,
    "ayat": 3,
    "terjemahan": "Wahai umat manusia, kenangkanlah nikmat Allah yang telah dikurniakanNya kepada kamu; tidak ada sama sekali yang menciptakan sesuatu selain daripada Allah; Ia memberi rezeki kepada kamu dari langit dan bumi. Tiada Tuhan melainkan Dia, maka mengapa kamu rela dipalingkan (dari menyembahnya)?"
  },
  {
    "surah": 35,
    "ayat": 4,
    "terjemahan": "Dan jika mereka mendustakanmu (wahai Muhammad), maka sesungguhnya Rasul-rasul yang terdahulu sebelummu telah juga didustakan (oleh kaumnya masing-masing). Dan (Ingatlah), kepada Allah jualah dikembalikan segala urusan."
  },
  {
    "surah": 35,
    "ayat": 5,
    "terjemahan": "Wahai umat manusia, sesungguhnya janji Allah (membalas amal kamu) adalah benar; maka janganlah kamu diperdayakan oleh kemewahan hidup di dunia, dan janganlah Syaitan yang menjadi sebesar-besar penipu itu berpeluang menyebabkan kamu terpedaya dengan (kemurahan) Allah (lalu kamu lalai dan menderhaka)."
  },
  {
    "surah": 35,
    "ayat": 6,
    "terjemahan": "Sesungguhnya Syaitan adalah musuh bagi kamu, maka jadikanlah dia musuh (yang mesti dijauhi tipu dayanya); sebenarnya dia hanyalah mengajak golongannya supaya menjadi dari penduduk neraka."
  },
  {
    "surah": 35,
    "ayat": 7,
    "terjemahan": "Orang-orang yang kafir, bagi mereka azab yang berat; dan orang-orang yang beriman serta beramal soleh, bagi mereka keampunan dan pahala yang besar."
  },
  {
    "surah": 35,
    "ayat": 8,
    "terjemahan": "Maka (fikirkanlah) adakah orang yang diperelokkan kepadanya amal buruknya (oleh Syaitan) lalu ia memandangnya dan mempercayainya baik, (bolehkah disifatkan sebagai orang yang menjalankan peraturan yang ditetapkan Allah untuk memberi hidayah kepadanya, atau sebaliknya) ? Kerana sesungguhnya Allah menyesatkan sesiapa yang dikehendakiNya, dan Ia juga memberi hidayah petunjuk kepada sesiapa yang dikehendakiNya. Oleh itu, janganlah engkau membinasakan dirimu (wahai Muhammad) kerana menanggung dukacita terhadap kesesatan mereka. Sesungguhnya Allah Maha Mengetahui akan apa yang mereka kerjakan."
  },
  {
    "surah": 35,
    "ayat": 9,
    "terjemahan": "Dan Allah jualah yang menghantarkan angin, lalu angin itu menggerakkan awan, kemudian Kami halakan awan itu ke negeri yang mati (yang kering kontang); lalu Kami hidupkan bumi sesudah matinya dengan (hujan dari awan) itu. Sedemikian itu pula kebangkitan manusia (hidup semula sesudah mati)."
  },
  {
    "surah": 35,
    "ayat": 10,
    "terjemahan": "Sesiapa yang mahukan kemuliaan (maka hendaklah ia berusaha mencarinya dengan jalan mematuhi perintah Allah), kerana bagi Allah jualah segala kemuliaan. Kepada Allah lah naiknya segala perkataan yang baik (yang menegaskan iman dan tauhid, untuk dimasukkan ke dalam kira-kira balasan), dan amal yang soleh pula di angkatnya naik (sebagai amal yang makbul - yang memberi kemuliaan kepada yang melakukannya). Dan sebaliknya: orang-orang yang merancangkan kejahatan (untuk mendapat kemuliaan), adalah bagi mereka azab seksa yang berat; dan rancangan jahat mereka (kalau berkesan) akan rosak binasa."
  },
  {
    "surah": 35,
    "ayat": 11,
    "terjemahan": "Dan Allah menciptakan kamu dari tanah, kemudian dari (setitis) air benih, kemudian Ia menjadikan kamu berpasangan (lelaki dan perempuan). Dan tiada mengandung seseorang perempuan (juga seekor betina), dan tidak pula satu-satunya melahirkan (anak yang dikandungnya) melainkan dengan keadaan yang diketahui Allah. Dan tidak diberikan seseorang berumur panjang, juga tidak dijadikan seseorang pendek umurnya, melainkan ada kadarnya di dalam Kitab Ilahi. Sesungguhnya yang demikian itu mudah sahaja kepada Allah."
  },
  {
    "surah": 35,
    "ayat": 12,
    "terjemahan": "Dan tidaklah sama keadaan dua laut (sekalipun satu jenisnya), yang satu tawar lagi memuaskan dahaga serta sesuai diminum, sementara yang satu lagi masin lagi pahit. Dan (kedua-duanya itu berfaedah kepada kamu): dari tiap-tiap satunya kamu dapat makan daging yang lembut - hidup-hidup, dan dapat pula kamu mengeluarkan benda-benda perhiasan untuk kamu memakainya; (selain itu) engkau melihat pula kapal-kapal membelah air belayar padanya; (diadakan semuanya itu) supaya kamu dapat mencari rezeki dari limpah kurnia Allah, dan supaya kamu bersyukur."
  },
  {
    "surah": 35,
    "ayat": 13,
    "terjemahan": "Allah jua yang memasukkan malam pada siang dan memasukkan siang pada malam (silih berganti), dan Ia yang memudahkan peredaran matahari dan bulan; tiap-tiap satu dari keduanya beredar untuk suatu masa yang telah ditetapkan. Yang melakukan semuanya itu ialah Allah Tuhan kamu, bagiNyalah kuasa pemerintahan; sedang mereka yang kamu sembah - yang lain dari Allah - tidak mempunyai sesuatu pun walau senipis selaput biji kurma."
  },
  {
    "surah": 35,
    "ayat": 14,
    "terjemahan": "Kalau kamu memohon kepada mereka (yang kamu sembah itu): mereka tidak mendengar permohonan kamu, dan kalaulah mereka mendengar pun, mereka tidak dapat memberikan apa yang kamu pohonkan itu; dan pada hari kiamat pula mereka mengingkari perbuatan syirik kamu. Dan (ingatlah) tidak ada yang dapat memberi tahu kepadamu (wahai Muhammad, akan hakikat yang sebenarnya) seperti yang diberikan Allah Yang Maha Mendalam PengetahuanNya."
  },
  {
    "surah": 35,
    "ayat": 15,
    "terjemahan": "(Oleh kerana Allah menguasai segala-galanya, maka) wahai umat manusia, kamulah yang sentiasa berhajat kepada Allah (dalam segala perkara), sedang Allah Dia lah sahaja Yang Maha Kaya, lagi Maha Terpuji."
  },
  {
    "surah": 35,
    "ayat": 16,
    "terjemahan": "Jika Ia mahu, nescaya Ia membinasakan kamu dan mendatangkan makhluk yang baharu."
  },
  {
    "surah": 35,
    "ayat": 17,
    "terjemahan": "Dan (perlaksanaan) yang demikian itu tidaklah sukar bagi Allah."
  },
  {
    "surah": 35,
    "ayat": 18,
    "terjemahan": "Dan (ketahuilah), seseorang pemikul tldak akan memikul dosa perbuatan orang lain; dan jika seseorang yang berat tanggungnya (dengan dosa), memanggil (orang lain) untuk menolong memikul sama bebanan itu, tidak akan dapat dipikul sedikitpun daripadanya, walaupun orang yang diminta pertolongannya itu dari kerabatnya sendiri. Sesungguhnya engkau (wahai Muhammad) hanyalah memberi peringatan kepada orang-orang yang takut (melanggar hukum-hukum) Tuhan semasa mereka tidak dilihat orang dan semasa mereka tidak melihat azab Tuhan, serta mereka mendirikan sembahyang. Dan sesiapa yang membersihkan dirinya (dari segala yang dilarang) maka sesungguhnya ia melakukan pembersihan itu untuk kebaikan dirinya sendiri dan (ingatlah), kepada Allah jualah tempat kembali."
  },
  {
    "surah": 35,
    "ayat": 19,
    "terjemahan": "Dan tidaklah sama orang buat dengan orang yang melihat."
  },
  {
    "surah": 35,
    "ayat": 20,
    "terjemahan": "Dan tidaklah sama gelap-gelita dengan cahaya yang terang-benderang,"
  },
  {
    "surah": 35,
    "ayat": 21,
    "terjemahan": "Dan tidaklah sama suasana yang teduh dengan yang kencang panasnya."
  },
  {
    "surah": 35,
    "ayat": 22,
    "terjemahan": "Dan (Demikianlah pula) tidaklah sama orang-orang yang hidup dengan orang-orang yang mati. Sesungguhnya Allah, (menurut undang-undang peraturanNya), dapat menjadikan sesiapa yang dikehendakinya mendengar (ajaran-ajaran Kitab Allah serta menerimanya), dan (engkau wahai Muhammad) tidak dapat menjadikan orang-orang yang di dalam kubur mendengar (dan menerimanya)."
  },
  {
    "surah": 35,
    "ayat": 23,
    "terjemahan": "Engkau tidak lain hanyalah seorang Rasul pemberi ingatan dan amaran."
  },
  {
    "surah": 35,
    "ayat": 24,
    "terjemahan": "Sesungguhnya Kami mengutusmu dengan (Ugama) yang benar, sebagai pembawa berita gembira (kepada orang-orang yang beriman) dan pemberi amaran (kepada orang-orang yang ingkar); dan tidak ada, sesuatu umat pun melainkan telah ada dalam kalangannya dahulu seorang Rasul pemberi ingatan dan amaran."
  },
  {
    "surah": 35,
    "ayat": 25,
    "terjemahan": "Dan jika mereka (yang kafir itu) mendustakanmu, (maka yang demikian itu tidaklah menjadi hal) kerana sesungguhnya orang-orang yang terdahulu sebelum mereka telah juga mendustakan (Rasul masing-masing), mereka telah didatangi Rasul-rasulnya dengan membawa keterangan-keterangan (mukjizat) yang nyata dan Kitab-kitab (nasihat pengajaran) serta Kitab-kitab (syariat) yang terang jelas."
  },
  {
    "surah": 35,
    "ayat": 26,
    "terjemahan": "Kemudian Aku timpakan orang-orang kafir itu dengan azab yang membinasakan, maka perhatikanlah bagaimana buruknya akibat kemurkaanKu (menimpa mereka)."
  },
  {
    "surah": 35,
    "ayat": 27,
    "terjemahan": "Tidakkah engkau melihat bahawa Allah menurunkan hujan dari langit, lalu Kami keluarkan dengan air hujan itu buah-buahan yang berlainan jenis dan rupanya; dan di antara gunung-ganang pula ada yang mempunyai jalur-jalur serta lorong-lorong putih dan merah, yang berlainan warnanya (tua dan muda) dan ada juga yang hitam legam;"
  },
  {
    "surah": 35,
    "ayat": 28,
    "terjemahan": "Dan demikian pula di antara manusia dan binatang-binatang yang melata serta binatang-binatang ternak, ada yang berlainan jenis dan warnanya? Sebenarnya yang menaruh bimbang dan takut (melanggar perintah) Allah dari kalangan hamba-hambaNya hanyalah orang-orang yang berilmu. Sesungguhnya Allah Maha Kuasa, lagi Maha Pengampun."
  },
  {
    "surah": 35,
    "ayat": 29,
    "terjemahan": "Sesungguhnya orang-orang yang selalu membaca Kitab Allah dan tetap mendirikan sembahyang serta mendermakan dari apa yang Kami kurniakan kepada mereka, secara bersembunyi atau secara terbuka, mereka (dengan amalan yang demikian) mengharapkan sejenis perniagaan yang tidak akan mengalami kerugian;"
  },
  {
    "surah": 35,
    "ayat": 30,
    "terjemahan": "Supaya Allah menyempurnakan pahala mereka dan menambahi mereka dari limpah kurniaNya. Sesungguhnya Allah Maha Pengampun, lagi sentiasa membalas dengan sebaik-baiknya (akan orang-orang yang bersyukur kepadaNya)."
  },
  {
    "surah": 35,
    "ayat": 31,
    "terjemahan": "Dan Al-Quran yang Kami wahyukan kepadamu (wahai Muhammad) ialah yang benar (segala-galanya) yang tetap mengesahkan Kitab-kitab yang diturunkan sebelumnya. Sesungguhnya Allah Maha Mengetahui dengan sedalam-dalamnya akan keadaan sekalian hambaNya, lagi Maha Melihat dan memerhatikan."
  },
  {
    "surah": 35,
    "ayat": 32,
    "terjemahan": "Kemudian Kami jadikan Al-Quran itu diwarisi oleh orang-orang yang Kami pilih dari kalangan hamba-hamba Kami; maka di antara mereka ada yang berlaku zalim kepada dirinya sendiri (dengan tidak mengindahkan ajaran Al-Quran), dan di antaranya ada yang bersikap sederhana, dan di antaranya pula ada yang mendahului (orang lain) dalam berbuat kebaikan dengan izin Allah. Yang demikian itu ialah limpah kurnia yang besar (dari Allah semata-mata)."
  },
  {
    "surah": 35,
    "ayat": 33,
    "terjemahan": "(Balasan mereka ialah) Syurga - syurga \" Adn \", yang mereka akan masukinya; mereka dihiaskan di dalamnya dengan gelang-gelang tangan dari emas dan mutiara; dan pakaian mereka di situ adalah dari sutera."
  },
  {
    "surah": 35,
    "ayat": 34,
    "terjemahan": "Dan (sebagai bersyukur) berkatalah mereka: \"Segala puji tertentu bagi Allah, yang telah menghapuskan perasaan dukacita dari kami; Sesungguhnya Tuhan kami Maha Pengampun, lagi sentiasa memberi balasan yang sebaik-baiknya (kepada orang-orang yang taat);"
  },
  {
    "surah": 35,
    "ayat": 35,
    "terjemahan": "Tuhan yang telah menempatkan kami di tempat tinggal yang kekal, dengan limpah kurniaNya semata-mata. Kami tidak akan merasa penat lelah di situ, dan Kami juga di situ tidak akan merasa letih lesu\"."
  },
  {
    "surah": 35,
    "ayat": 36,
    "terjemahan": "Dan orang-orang yang kafir, bagi mereka neraka Jahannam; mereka tidak dijatuhkan hukuman bunuh supaya mereka mati (dan terlepas dari seksa), dan tidak pula diringankan azab neraka itu dari mereka; dan demikianlah Kami membalas tiap-tiap orang yang melampau kufurnya."
  },
  {
    "surah": 35,
    "ayat": 37,
    "terjemahan": "Dan mereka menjerit-jerit di dalam neraka itu (sambil merayu): \"Wahai Tuhan kami, keluarkanlah kami (dari azab ini); kami akan mengerjakan amal-amal yang soleh, yang lain dari apa yang kami pernah kerjakan. (lalu Allah menempelak mereka): \"Bukankah Kami telah melanjutkan umur kamu dan memberikan masa yang cukup untuk berfikir dan beringat padanya oleh sesiapa yang suka berfikir dan beringat? Dan kamu pula telah didatangi oleh Rasul (Kami) yang memberi amaran oleh itu, rasalah (azab seksa), kerana orang-orang yang zalim tidak akan beroleh sesiapapun yang dapat memberikan pertolongan\"."
  },
  {
    "surah": 35,
    "ayat": 38,
    "terjemahan": "Sesungguhnya Allah mengetahui segala rahsia di langit dan di bumi; sesungguhnya Ia mengetahui akan segala (isi hati) yang terkandung di dalam dada."
  },
  {
    "surah": 35,
    "ayat": 39,
    "terjemahan": "Dia lah yang menjadikan kamu orang-orang yang berkuasa di muka bumi silih berganti; oleh itu sesiapa yang kufur ingkar maka balasan kufurnya itu akan menimpa dirinya sendiri; dan orang-orang yang kafir, kufurnya tidak menambahkan mereka di sisi Tuhan mereka melainkan kemurkaan dan kehinaan; dan juga orang-orang yang kafir itu, kufurnya tidak menambahkan mereka melainkan kerugian jua."
  },
  {
    "surah": 35,
    "ayat": 40,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Sudahkah kamu mengetahui kekuasaan dan kelayakan makhluk-makhluk yang kamu jadikan sekutu-sekutu, yang kamu seru dan sembah selain Allah? Tunjukkanlah kepadaku apa yang mereka telah ciptakan dari bahagian bumi ini?. Atau adakah mereka mempunyai sebarang perkongsian (dengan Allah) dalam mencipta dan menguruskan langit? Atau pernahkah Kami memberi mereka sebuah Kitab (mengakui mereka menjadi kongsi Kami), maka (dengan itu menjadilah) perkongsian mereka berdasarkan keterangan yang terdapat dari Kitab itu? \"(Tidak ada sesuatu alasan pun) bahkan orang-orang yang zalim itu, terpedaya dengan kata-kata yang disebutkan oleh setengahnya kepada yang lain, kata-kata yang hanya menjanjikan perkara yang tidak benar."
  },
  {
    "surah": 35,
    "ayat": 41,
    "terjemahan": "Sesungguhnya Allah menahan dan memelihara langit dan bumi supaya tidak berganjak dari peraturan dan keadaan yang ditetapkan baginya; dan jika keduanya (ditakdirkan) berganjak maka tidak ada sesiapapun yang dapat menahannya daripada berlaku demikian selain dari Allah. Sesungguhnya Ia Maha Penyabar, lagi Maha Pengampun."
  },
  {
    "surah": 35,
    "ayat": 42,
    "terjemahan": "Dan mereka bersumpah dengan nama Allah dengan sebebar-benar sumpahnya: demi sesungguhnya jika datang kepada mereka seorang Rasul pemberi ingatan dan amaran, sudah tentu mereka akan menjadi orang-orang yang lebih betul jalan ugamanya dari sebarang umat yang lain. Setelah datang kepada mereka seorang Rasul pemberi ingatan dan amaran, (maka kedatangannya itu) hanya menyebabkan mereka bertambah liar dari kebenaran,"
  },
  {
    "surah": 35,
    "ayat": 43,
    "terjemahan": "Sambil bersikap sombong takbur di muka bumi dan berusaha merancangkan rancangan-rancangan jahat (terhadap Rasul itu), sedang rancangan yang jahat itu tidak menimpa melainkan orang yang menjalankannya. (Dengan keadaan yang demikian, maka) tidak ada yang mereka tunggu selain daripada berlakunya kebinasaan menimpa mereka (sebagaimana yang telah menimpa) orang-orang kafir yang telah lalu. Kerana engkau tidak sekali-kali akan mendapati sebarang perubahan bagi \" Sunnatullah \" (undang-undang peraturan Allah), dan engkau tidak sekali-kali akan mendapati sebarang penukaran bagi perjalanan \" Sunnatullah \" itu."
  },
  {
    "surah": 35,
    "ayat": 44,
    "terjemahan": "(Dan sebagai buktinya): tidakkah orang-orang (yang tidak mahu beriman) itu telah mengembara di muka bumi, lalu mereka menyaksikan bagaimana kesudahan orang-orang kafir yang terdahulu dari mereka, sedang orang-orang itu lebih kekuatannya dari mereka? Dan (sudah tetap) bahawa kekuasaan Allah tidak dapat dilemahkan atau dihalangi oleh sesuatupun sama ada di langit atau di bumi; sesungguhnya Ia adalah Maha Mengetahui, lagi Maha Kuasa."
  },
  {
    "surah": 35,
    "ayat": 45,
    "terjemahan": "Dan kalaulah Allah mengirakan kesalahan manusia serta terus menyeksa mereka disebabkan amal-amal jahat yang mereka telah kerjakan, tentulah la tidak membiarkan tinggal di muka bumi sesuatu makhluk yang bergerak; akan tetapi (dia tidak bertindak dengan serta merta, bahkan) Ia memberi tempoh kepada mereka hingga ke suatu masa yang tertentu; kemudian apabila sampai tempoh mereka (maka Allah akan membalas masing-masing dengan adilnya), kerana sesungguhnya Allah sentiasa Melihat keadaan hamba-hambaNya."
  },
  {
    "surah": 36,
    "ayat": 1,
    "terjemahan": "Yaa, Siin."
  },
  {
    "surah": 36,
    "ayat": 2,
    "terjemahan": "Demi Al-Quran yang mengandungi hikmat-hikmat dan kebenaran yang tetap kukuh,"
  },
  {
    "surah": 36,
    "ayat": 3,
    "terjemahan": "Sesungguhnya engkau (wahai Muhammad adalah seorang Rasul) dari Rasul-rasul yang telah diutus,"
  },
  {
    "surah": 36,
    "ayat": 4,
    "terjemahan": "Yang tetap di atas jalan yang lurus (ugama Islam)."
  },
  {
    "surah": 36,
    "ayat": 5,
    "terjemahan": "Al-Quran itu, diturunkan oleh Allah Yang Maha Kuasa, lagi Maha Mengasihani,"
  },
  {
    "surah": 36,
    "ayat": 6,
    "terjemahan": "Supaya engkau memberi peringatan dan amaran kepada kaum yang datuk neneknya telah lama tidak diberikan peringatan dan amaran; sebab itulah mereka lalai."
  },
  {
    "surah": 36,
    "ayat": 7,
    "terjemahan": "Demi sesungguhnya, telah tetap hukuman seksa atas kebanyakan mereka, kerana mereka tidak mahu beriman."
  },
  {
    "surah": 36,
    "ayat": 8,
    "terjemahan": "Sesungguhnya Kami jadikan (kesombongan dan keengganan mereka tunduk kepada kebenaran sebagai) belenggu yang memberkas kedua tangan mereka ke batang leher mereka; (lebarnya belenggu itu) sampai (menongkatkan) dagu mereka lalu menjadilah mereka terdongak."
  },
  {
    "surah": 36,
    "ayat": 9,
    "terjemahan": "Dan Kami jadikan (sifat tamak dan gila mereka kepada harta benda dan pangkat itu sebagai) sekatan (yang menghalang mereka daripada memandang kepada keburukan dan kesingkatan masa dunia yang ada) di hadapan mereka, dan sekatan (yang menghalang mereka daripada memikirkan azab yang ada) di belakang mereka (pada hari kiamat). lalu Kami tutup pandangan mereka; maka dengan itu, mereka tidak dapat melihat (jalan yang benar)."
  },
  {
    "surah": 36,
    "ayat": 10,
    "terjemahan": "Dan (dengan sebab itu) sama sahaja kepada mereka, engkau beri amaran atau engkau tidak beri amaran kepadanya - mereka tidak akan beriman."
  },
  {
    "surah": 36,
    "ayat": 11,
    "terjemahan": "Sesungguhnya peringatan dan amaran (yang berkesan dan mendatangkan faedah) hanyalah yang engkau berikan kepada orang yang sedia menurut ajaran Al-Quran serta ia takut (melanggar perintah Allah) Ar-Rahman semasa ia tidak dilihat orang dan semasa ia tidak melihat azab Tuhan. Oleh itu berilah kepadanya berita yang mengembirakan dengan keampunan dan pahala yang mulia."
  },
  {
    "surah": 36,
    "ayat": 12,
    "terjemahan": "Sesungguhnya Kami menghidupkan orang-orang yang mati, dan Kami tuliskan segala yang mereka telah kerjakan serta segala kesan perkataan dan perbuatan yang mereka tinggalkan. Dan (ingatlah) tiap-tiap sesuatu kami catitkan satu persatu dalam Kitab (ibu Suratan) yang jelas nyata."
  },
  {
    "surah": 36,
    "ayat": 13,
    "terjemahan": "Dan ceritakanlah kepada mereka satu keadaan yang ajaib mengenai kisah penduduk sebuah bandar (yang tertentu) iaitu ketika mereka didatangi Rasul-rasul (Kami),"
  },
  {
    "surah": 36,
    "ayat": 14,
    "terjemahan": "Ketika Kami mengutus kepada mereka dua orang Rasul lalu mereka mendustakannya; kemudian Kami kuatkan (kedua Rasul itu) dengan Rasul yang ketiga, lalu Rasul-rasul itu berkata: ` Sesungguhnya kami ini adalah diutuskan kepada kamu '."
  },
  {
    "surah": 36,
    "ayat": 15,
    "terjemahan": "Penduduk bandar itu menjawab: \"Kamu ini tidak lain hanyalah manusia seperti kami juga, dan Tuhan Yang Maha Pemurah tidak menurunkan sesuatupun (tentang ugama yang kamu dakwakan); Kamu ini tidak lain hanyalah berdusta\"."
  },
  {
    "surah": 36,
    "ayat": 16,
    "terjemahan": "Rasul-rasul berkata: Tuhan Kami mengetahui bahawa sesungguhnya Kami adalah Rasul-rasul yang diutus kepada kamu,"
  },
  {
    "surah": 36,
    "ayat": 17,
    "terjemahan": "\"Dan tugas Kami hanyalah menyampaikan perintah-perintahNya dengan cara yang jelas nyata\"."
  },
  {
    "surah": 36,
    "ayat": 18,
    "terjemahan": "Penduduk bandar itu berkata pula: \"Sesungguhnya kami merasa nahas dan malang dengan sebab kamu. Demi sesungguhnya, kalau kamu tidak berhenti (dari menjalankan tugas yang kamu katakan itu), tentulah kami akan merejam kamu dan sudah tentu kamu akan merasai dari pihak kami azab seksa yang tidak terperi sakitnya\"."
  },
  {
    "surah": 36,
    "ayat": 19,
    "terjemahan": "Rasul-rasul itu menjawab: \"Nahas dan malang kamu itu adalah disebabkan (kekufuran) yang ada pada kamu. Patutkah kerana kamu diberi peringatan dan nasihat pengajaran (maka kamu mengancam kami dengan apa yang kamu katakan itu)? (Kamu bukanlah orang-orang yang mahu insaf) bahkan kamu adalah kaum pelampau\"."
  },
  {
    "surah": 36,
    "ayat": 20,
    "terjemahan": "Dan (semasa Rasul-rasul itu diancam), datanglah seorang lelaki dari hujung bandar itu dengan berlari, lalu memberi nasihat dengan katanya:\" Wahai kaumku! Turutlah Rasul-rasul itu -"
  },
  {
    "surah": 36,
    "ayat": 21,
    "terjemahan": "\"Turutlah orang-orang yang tidak meminta kapada kamu sesuatu balasan, sedang mereka adalah orang-orang mandapat hidayah petunjuk\"."
  },
  {
    "surah": 36,
    "ayat": 22,
    "terjemahan": "Dan (apabila ditanya: Sudahkah engkau menerima ugama mereka? Maka jawabnya): \"Mengapa aku tidak menyembah Tuhan yang menciptakan daku, dan yang kepadaNyalah (aku dan) kamu semua akan dikembalikan?"
  },
  {
    "surah": 36,
    "ayat": 23,
    "terjemahan": "\"Patutkah aku menyembah beberapa tuhan yang lain dari Allah? (Sudah tentu tidak patut, kerana) jika Allah yang Maha Pemurah hendak menimpakan daku dengan sesuatu bahaya, mereka tidak dapat memberikan sebarang syafaat kepadaku, dan mereka juga tidak dapat menyelamatkan daku."
  },
  {
    "surah": 36,
    "ayat": 24,
    "terjemahan": "\"Sesungguhnya aku (kalau melakukan syirik) tentulah aku pada ketika itu berada dalam kesesatan yang nyata."
  },
  {
    "surah": 36,
    "ayat": 25,
    "terjemahan": "\"Sesungguhnya aku telah beriman kepada Tuhan kamu, maka dengarlah (nasihatku)\",."
  },
  {
    "surah": 36,
    "ayat": 26,
    "terjemahan": "(Setelah ia mati) lalu dikatakan kepadanya: \"Masuklah ke dalam Syurga\". Ia berkata; \"Alangkah baiknya kalau kaumku mengetahui -"
  },
  {
    "surah": 36,
    "ayat": 27,
    "terjemahan": "\"Tentang perkara yang menyebabkan daku diampunkan oleh Tuhanku, serta dijadikannya daku dari orang-orang yang dimuliakan\"."
  },
  {
    "surah": 36,
    "ayat": 28,
    "terjemahan": "Dan Kami tidak menurunkan kepada kaumnya sesudah ia (mati) sebarang pasukan tentera dari langit (untuk membinasakan mereka), dan tidak perlu Kami menurunkannya."
  },
  {
    "surah": 36,
    "ayat": 29,
    "terjemahan": "(Kebinasaan mereka) hanyalah dilakukan dengan satu pekikan (yang dahsyat), maka dengan serta merta mereka semua sunyi-sepi tidak hidup lagi."
  },
  {
    "surah": 36,
    "ayat": 30,
    "terjemahan": "Sungguh besar perasaan sesal dan kecewa yang menimpa hamba-hamba (yang mengingkari kebenaran)! Tidak datang kepada mereka seorang Rasul melainkan mereka mengejek-ejek dan memperolok-olokkannya."
  },
  {
    "surah": 36,
    "ayat": 31,
    "terjemahan": "Tidakkah mereka mengetahui berapa banyak umat-umat yang telah Kami binasakan sebelum mereka? Umat-umat yang telah binasa itu tidak kembali lagi kepada mereka (bahkan kembali kepada Kami, untuk menerima balasan)."
  },
  {
    "surah": 36,
    "ayat": 32,
    "terjemahan": "Dan tidak ada satu makhluk pun melainkan dihimpunkan ke tempat perbicaraan Kami, semuanya dibawa hadir (untuk menerima balasan)."
  },
  {
    "surah": 36,
    "ayat": 33,
    "terjemahan": "Dan dalil yang terang untuk mereka (memahami kekuasaan dan kemurahan kami), ialah bumi yang mati; kami hidupkan dia serta kami keluarkan daripadanya biji-bijian, maka daripada biji-bijian itu mereka makan."
  },
  {
    "surah": 36,
    "ayat": 34,
    "terjemahan": "Dan kami jadikan di bumi itu kebun-kebun kurma dan anggur, dan kami pancarkan padanya beberapa matair,"
  },
  {
    "surah": 36,
    "ayat": 35,
    "terjemahan": "Supaya mereka makan dari buah-buahannya dan dari apa yang dikerjakan oleh tangan mereka; maka patutkah mereka tidak bersyukur?"
  },
  {
    "surah": 36,
    "ayat": 36,
    "terjemahan": "Maha Suci Tuhan yang telah menciptakan makhluk-makhluk semuanya berpasangan; sama ada dari yang ditumbuhkan oleh bumi, atau dari diri mereka, ataupun dari apa yang mereka tidak mengetahuinya."
  },
  {
    "surah": 36,
    "ayat": 37,
    "terjemahan": "Dan lagi dalil yang terang untuk mereka (berfikir) ialah malam; Kami hilangkan siang daripadanya, maka dengan serta-merta mereka berada dalam gelap-gelita;"
  },
  {
    "surah": 36,
    "ayat": 38,
    "terjemahan": "Dan (sebahagian dari dalil yang tersebut ialah) matahari; ia kelihatan beredar ke tempat yang ditetapkan baginya; itu adalah takdir Tuhan yang Maha Kuasa, lagi Maha Mengetahui;"
  },
  {
    "surah": 36,
    "ayat": 39,
    "terjemahan": "Dan bulan pula Kami takdirkan dia beredar melalui beberapa peringkat, sehingga di akhir peredarannya kelihatan kembalinya pula ke peringkat awalnya - (berbentuk melengkung) seperti tandan yang kering."
  },
  {
    "surah": 36,
    "ayat": 40,
    "terjemahan": "(Dengan ketentuan yang demikian), matahari tidak mudah baginya mengejar bulan, dan malam pula tidak dapat mendahului siang; kerana tiap-tiap satunya beredar terapung-apung di tempat edarannya masing-masing."
  },
  {
    "surah": 36,
    "ayat": 41,
    "terjemahan": "Dan satu dalil lagi untuk mereka (insaf) ialah, Kami membawa belayar jenis keluarga mereka dalam bahtera yang penuh sarat;"
  },
  {
    "surah": 36,
    "ayat": 42,
    "terjemahan": "Dan Kami ciptakan untuk mereka, jenis-jenis kenderaan yang sama dengannya, yang mereka dapat mengenderainya."
  },
  {
    "surah": 36,
    "ayat": 43,
    "terjemahan": "Dan jika kami kehendaki, kami boleh tenggelamkan mereka; (kiranya Kami lakukan yang demikian) maka tidak ada yang dapat memberi pertolongan kepada mereka, dan mereka juga tidak dapat diselamatkan, -"
  },
  {
    "surah": 36,
    "ayat": 44,
    "terjemahan": "Kecuali dengan kemurahan dari pihak Kami memberi rahmat dan kesenangan hidup kepada mereka hingga ke suatu masa."
  },
  {
    "surah": 36,
    "ayat": 45,
    "terjemahan": "Dan apabila dikatakan kepada mereka: \" berjaga-jagalah kamu akan apa yang ada di hadapan kamu (dari urusan-urusan hidup di dunia ini), dan apa yang ada di belakang kamu (dari huru-hara dan balasan akhirat), supaya kamu beroleh rahmat\", (mereka tidak mengindahkannya)."
  },
  {
    "surah": 36,
    "ayat": 46,
    "terjemahan": "Dan (itulah tabiat mereka) tidak ada sesuatu keterangan yang sampai kepada mereka dari keterangan-keterangan tuhan mereka melainkan mereka selalu berpaling daripadanya (enggan menerimanya)."
  },
  {
    "surah": 36,
    "ayat": 47,
    "terjemahan": "Dan apabila dikatakan kepada mereka:\" Dermakanlah sebahagian dari rezeki yang dikurniakan Allah kepada kamu\", berkatalah orang-orang yang kafir itu kepada orang-orang yang beriman (secara mengejek-ejek): \" Patutkah kami memberi makan kepada orang yang jika Allah kehendaki tentulah Ia akan memberinya makan? Kamu ini hanyalah berada dalam kesesatan yang nyata\"."
  },
  {
    "surah": 36,
    "ayat": 48,
    "terjemahan": "Dan (apabila mereka diingatkan tentang huru-hara dan balasan akhirat) mereka bertanya (secara mempersenda): \" Bilakah datangnya (hari akhirat) yang dijanjikan itu? Jika betul kamu orang-orang yang benar (maka kami sedia menunggu)!\","
  },
  {
    "surah": 36,
    "ayat": 49,
    "terjemahan": "Mereka tidak menunggu melainkan satu pekikan yang - (dengan secara mengejut) akan membinasakan mereka semasa mereka dalam keadaan leka bertengkar (merundingkan urusan dunia masing-masing)."
  },
  {
    "surah": 36,
    "ayat": 50,
    "terjemahan": "Maka dengan itu, mereka tidak berpeluang membuat sebarang pesanan (wasiat atau lainnya), dan (kalau mereka berada di luar) mereka tidak sempat kembali kepada keluarganya."
  },
  {
    "surah": 36,
    "ayat": 51,
    "terjemahan": "Dan sudah tentu akan ditiupkan sangkakala (menghidupkan orang-orang yang telah mati; apabila berlaku yang demikian) maka semuanya segera bangkit keluar dari kubur masing-masing (untuk) mengadap Tuhannya."
  },
  {
    "surah": 36,
    "ayat": 52,
    "terjemahan": "(Pada ketika itu) orang-orang yang tidak percayakan hidup semula berkata: Aduhai celakanya kami! Siapakah yang membangkitkan kami dari kubur tempat tidur kami?,, (Lalu dikatakan kepada mereka): \" Inilah dia yang telah dijanjikan oleh Allah Yang Maha Pemurah dan benarlah berita yang disampaikan oleh Rasul-rasul!,"
  },
  {
    "surah": 36,
    "ayat": 53,
    "terjemahan": "Hanyalah dengan berlakunya satu pekikan sahaja, maka dengan serta merta mereka dihimpunkan ke tempat perbicaraan Kami, semuanya dibawa hadir (untuk menerima balasan)."
  },
  {
    "surah": 36,
    "ayat": 54,
    "terjemahan": "Maka pada hari itu, tidak ada seseorang yang akan dianiaya sedikitpun, dan kamu pula tidak akan dibalas melainkan menurut amal yang kamu telah kerjakan."
  },
  {
    "surah": 36,
    "ayat": 55,
    "terjemahan": "Sesungguhnya penduduk Syurga pada hari itu, berada dalam keadaan sibuk leka menikmati kesenangan;"
  },
  {
    "surah": 36,
    "ayat": 56,
    "terjemahan": "Mereka dengan pasangan-pasangan mereka bersukaria di tempat yang teduh, sambil duduk berbaring di atas pelamin;"
  },
  {
    "surah": 36,
    "ayat": 57,
    "terjemahan": "Mereka beroleh dalam Syurga itu pelbagai jenis buah-buahan, dan mereka beroleh apa sahaja yang mereka kehendaki;"
  },
  {
    "surah": 36,
    "ayat": 58,
    "terjemahan": "(Mereka juga beroleh) ucapan salam sejahtera dari Tuhan Yang Maha Mengasihani."
  },
  {
    "surah": 36,
    "ayat": 59,
    "terjemahan": "Dan (sebaliknya dikatakan kepada orang-orang yang kafir): \"Berpisahlah kamu pada hari ini, hai orang-orang yang berdosa, (dari bercampur gaul dengan orang-orang yang beriman)."
  },
  {
    "surah": 36,
    "ayat": 60,
    "terjemahan": "\"Bukankah Aku telah perintahkan kamu wahai anak-anak Adam, supaya kamu jangan menyembah Syaitan? Sesungguhnya ia musuh yang nyata terhadap kamu!"
  },
  {
    "surah": 36,
    "ayat": 61,
    "terjemahan": "\"Dan (Aku perintahkan): hendaklah kamu menyembahKu; inilah jalan yang lurus."
  },
  {
    "surah": 36,
    "ayat": 62,
    "terjemahan": "\"Dan sesungguhnya Syaitan itu telah menyesatkan golongan yang ramai di antara kamu; (setelah kamu mengetahui akibat mereka) maka tidakkah sepatutnya kamu berfikir dan insaf?"
  },
  {
    "surah": 36,
    "ayat": 63,
    "terjemahan": "\"Yang kamu saksikan sekarang ialah neraka Jahannam, yang kamu selalu diancam memasukinya (kalau kamu tidak taatkan perintah Allah)."
  },
  {
    "surah": 36,
    "ayat": 64,
    "terjemahan": "\"Rasalah kamu bakarannya pada hari ini, disebabkan perbuatan kufur yang kamu telah lakukan!\""
  },
  {
    "surah": 36,
    "ayat": 65,
    "terjemahan": "Pada waktu itu Kami meteraikan mulut mereka (sejurus); dan (memberi peluang kepada) tangan-tangan mereka memberitahu Kami (kesalahan masing-masing), dan kaki mereka pula menjadi saksi tentang apa yang mereka telah usahakan."
  },
  {
    "surah": 36,
    "ayat": 66,
    "terjemahan": "(Matahati orang-orang yang menderhaka itu rosak) dan kalau Kami kehendaki, Kami berkuasa menghapuskan bentuk dan biji mata kepala mereka menjadi rata, sehingga masing-masing menerpa mencari-cari jalan (yang biasa mereka lalui). (Kiranya dijadikan demikian) maka bagaimanakah mereka dapat melihatnya?"
  },
  {
    "surah": 36,
    "ayat": 67,
    "terjemahan": "(Kekuatan akal fikiran mereka juga tidak sihat) dan kalau kami kehendaki, kami berkuasa mangubahkan keadaan jasmani mereka (menjadi kaku beku) di tempat yang mereka berada padanya; maka dengan itu, mereka tidak dapat mara ke hadapan dan juga tidak dapat undur ke belakang."
  },
  {
    "surah": 36,
    "ayat": 68,
    "terjemahan": "Dan (hendaklah diingat bahawa) sesiapa yang Kami panjangkan umurnya, Kami balikkan kembali kejadiannya (kepada keadaan serba lemah; hakikat ini memang jelas) maka mengapa mereka tidak mahu memikirkannya?"
  },
  {
    "surah": 36,
    "ayat": 69,
    "terjemahan": "(Nabi Muhammad bukanlah penyair) dan Kami tidak mengajarkan syair kepadanya, dan kepandaian bersyair itu pula tidak sesuai baginya. Yang Kami wahyukan kepadanya itu tidak lain melainkan nasihat pengajaran dan Kitab Suci yang memberi penerangan;"
  },
  {
    "surah": 36,
    "ayat": 70,
    "terjemahan": "Supaya ia memberi peringatan kepada orang yang sedia hidup (hatinya), dan supaya nyata tetapnya hukuman (azab) terhadap orang-orang yang kufur ingkar."
  },
  {
    "surah": 36,
    "ayat": 71,
    "terjemahan": "Tidakkah mereka melihat dan memikirkan, bahawa Kami telah menciptakan untuk mereka binatang-binatang ternak, di antara jenis-jenis makhluk yang telah Kami ciptakan dengan kekuasaan Kami lalu mereka memilikinya?"
  },
  {
    "surah": 36,
    "ayat": 72,
    "terjemahan": "Dan Kami jinakkan dia untuk kegunaan mereka; maka sebahagian di antaranya menjadi kenderaan mereka, dan sebahagian lagi mereka makan."
  },
  {
    "surah": 36,
    "ayat": 73,
    "terjemahan": "Dan mereka beroleh berbagai faedah dan kegunaan pada binatang ternak itu dan juga beroleh minuman; maka mengapa mereka tidak mahu bersyukur?"
  },
  {
    "surah": 36,
    "ayat": 74,
    "terjemahan": "Dan tergamak mereka menyembah beberapa tuhan yang lain dari Allah, (dengan harapan semoga mereka mendapat pertolongan (dari makhluk-makhluk itu)."
  },
  {
    "surah": 36,
    "ayat": 75,
    "terjemahan": "Benda-benda yang mereka sembah itu tidak dapat sama sekali menolong mereka, sedang benda-benda itu sendiri menjadi tentera yang akan dibawa hadir (pada hari kiamat, untuk memberi azab seksa) kepada mereka."
  },
  {
    "surah": 36,
    "ayat": 76,
    "terjemahan": "Maka janganlah engkau (wahai Muhammad) berdukacita disebabkan tuduhan-tuduhan mereka (terhadapmu). Sesungguhnya Kami sedia mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan."
  },
  {
    "surah": 36,
    "ayat": 77,
    "terjemahan": "Tidakkah manusia itu melihat dan mengetahui, bahawa Kami telah menciptakan dia dari (setitis) air benih? Dalam pada itu (setelah Kami sempurnakan kejadiannya dan tenaga kekuatannya) maka dengan tidak semena-mena menjadilah ia seorang pembantah yang terang jelas bantahannya (mengenai kekuasaan Kami menghidupkan semula orang-orang yang mati),"
  },
  {
    "surah": 36,
    "ayat": 78,
    "terjemahan": "Serta ia mengemukakan satu misal perbandingan kepada Kami (tentang kekuasaan itu), dan ia pula lupakan keadaan Kami menciptakannya sambil ia bertanya: \"Siapakah yang dapat menghidupkan tulang-tulang yang telah hancur seperti debu?\""
  },
  {
    "surah": 36,
    "ayat": 79,
    "terjemahan": "Katakanlah: \"Tulang-tulang yang hancur itu akan dihidupkan oleh Tuhan yang telah menciptakannya pada awal mula wujudnya; dan Ia Maha Mengetahui akan segala keadaan makhluk-makhluk (yang diciptakanNya);"
  },
  {
    "surah": 36,
    "ayat": 80,
    "terjemahan": "\"Tuhan yang telah menjadikan api (boleh didapati) dari pohon-pohon yang hijau basah untuk kegunaan kamu, maka kamu pun selalu menyalakan api dari pohon-pohon itu\"."
  },
  {
    "surah": 36,
    "ayat": 81,
    "terjemahan": "Tidakkah diakui dan tidakkah dipercayai bahawa Tuhan yang telah menciptakan langit dan bumi (yang demikian besarnya) - berkuasa menciptakan semula manusia sebagaimana Ia menciptakan mereka dahulu? Ya! Diakui dan dipercayai berkuasa! Dan Dia lah Pencipta yang tidak ada bandinganNya, lagi Yang Maha Mengetahui."
  },
  {
    "surah": 36,
    "ayat": 82,
    "terjemahan": "Sesungguhnya keadaan kekuasaanNya apabila Ia menghendaki adanya sesuatu, hanyalah Ia berfirman kepada (hakikat) benda itu: \" Jadilah engkau! \". Maka ia terus menjadi."
  },
  {
    "surah": 36,
    "ayat": 83,
    "terjemahan": "Oleh itu akuilah kesucian Allah (dengan mengucap: Subhaanallah!) - Tuhan yang memiliki dan menguasai tiap-tiap sesuatu, dan kepadaNyalah kamu semua dikembalikan."
  },
  {
    "surah": 37,
    "ayat": 1,
    "terjemahan": "Demi (hamba-hambaKu) yang berbaris dengan berderet-deret -"
  },
  {
    "surah": 37,
    "ayat": 2,
    "terjemahan": "(Hamba-hambaKu) yang melarang (dari kejahatan) dengan sesungguh-sungguhnya -"
  },
  {
    "surah": 37,
    "ayat": 3,
    "terjemahan": "(Hamba-hambaKu) yang membaca kandungan Kitab Suci;"
  },
  {
    "surah": 37,
    "ayat": 4,
    "terjemahan": "(Sumpah demi sumpah) sesungguhnya Tuhan kamu hanyalah Satu -"
  },
  {
    "surah": 37,
    "ayat": 5,
    "terjemahan": "Tuhan (yang mencipta serta mentadbirkan) langit dan bumi dan segala yang ada di antara keduanya, dan Tuhan (yang mengatur) tempat-tempat terbit matahari."
  },
  {
    "surah": 37,
    "ayat": 6,
    "terjemahan": "Sesungguhnya Kami telah menghiasi langit yang dekat (pada penglihatan penduduk bumi) dengan hiasan bintang-bintang."
  },
  {
    "surah": 37,
    "ayat": 7,
    "terjemahan": "Dan (Kami pelihara urusan langit itu) dengan serapi-rapi kawalan dari (masuk campur) tiap-tiap Syaitan yang derhaka;"
  },
  {
    "surah": 37,
    "ayat": 8,
    "terjemahan": "(Dengan itu) mereka tidak dapat memasang telinga mendengar (percakapan malaikat) penduduk langit, dan mereka pula direjam (dengan api) dari segala arah dan penjuru,"
  },
  {
    "surah": 37,
    "ayat": 9,
    "terjemahan": "Untuk mengusir mereka; dan mereka pula beroleh azab seksa yang tidak putus-putus."
  },
  {
    "surah": 37,
    "ayat": 10,
    "terjemahan": "Kecuali sesiapa di antara Syaitan-syaitan itu yang curi mendengar mana-mana percakapan (malaikat), maka ia diburu dan diikuti (dengan rejaman) api yang menjulang lagi menembusi."
  },
  {
    "surah": 37,
    "ayat": 11,
    "terjemahan": "(Setelah nyata kekuasaan Kami) maka bertanyalah (wahai Muhammad) kepada mereka (yang ingkarkan hidupnya semula orang-orang mati): Adakah diri mereka lebih sukar hendak diciptakan, atau makhluk-makhluk lain yang Kami telah ciptakan? Sesungguhnya Kami telah mencipta mereka dari tanah liat (yang senang diubah dan diciptakan semula)."
  },
  {
    "surah": 37,
    "ayat": 12,
    "terjemahan": "(Pertanyaan itu tidak juga berfaedah kepada mereka) bahkan engkau merasa hairan (terhadap keingkaran mereka), dan sebaliknya mereka mengejek-ejek (peneranganmu)."
  },
  {
    "surah": 37,
    "ayat": 13,
    "terjemahan": "Dan apabila diperingatkan, mereka tetap tidak mahu menerima peringatan itu."
  },
  {
    "surah": 37,
    "ayat": 14,
    "terjemahan": "Dan apabila mereka melihat sesuatu tanda (yang membuktikan kekuasaan Kami dan kebenaranmu), mereka mencari-cari jalan memperolok-olokkannya, -"
  },
  {
    "surah": 37,
    "ayat": 15,
    "terjemahan": "Serta mereka berkata: \"Ini tidak lain hanyalah sihir yang nyata."
  },
  {
    "surah": 37,
    "ayat": 16,
    "terjemahan": "\"Adakah sesudah kita mati serta menjadi tanah dan tulang, adakah kita akan dibangkitkan hidup semula?"
  },
  {
    "surah": 37,
    "ayat": 17,
    "terjemahan": "\"Dan adakah juga datuk nenek kita yang telah lalu (akan dibangkitkan hidup semula)?\""
  },
  {
    "surah": 37,
    "ayat": 18,
    "terjemahan": "Jawablah (wahai Muhammad): \"Ya, benar !(Kamu semua akan dibangkitkan) dengan keadaan hina-dina \"."
  },
  {
    "surah": 37,
    "ayat": 19,
    "terjemahan": "(Kebangkitan ini mudah) kerana sesungguhnya ia boleh berlaku hanyalah dengan suara sahaja, maka dengan serta mereka semuanya (bangkit) melihat (apa yang akan jadi)."
  },
  {
    "surah": 37,
    "ayat": 20,
    "terjemahan": "Dan (pada saat itu) mereka berkata:\" Wahai celakanya kami, ini ialah hari balasan!\""
  },
  {
    "surah": 37,
    "ayat": 21,
    "terjemahan": "(Lalu malaikat berkata kepada mereka): \" Ini ialah hari memutuskan hukum untuk memberi balasan yang dahulu kamu mendustakannya \"."
  },
  {
    "surah": 37,
    "ayat": 22,
    "terjemahan": "(Allah berfirman kepada malaikat):\" Himpunkanlah orang-orang yang zalim itu, dan orang-orang yang berkeadaan seperti mereka, serta benda-benda yang mereka sembah -"
  },
  {
    "surah": 37,
    "ayat": 23,
    "terjemahan": "\"Yang lain dari Allah serta hadapkanlah mereka ke jalan yang membawa ke neraka."
  },
  {
    "surah": 37,
    "ayat": 24,
    "terjemahan": "\"Dan hentikanlah mereka (menunggu), kerana sesungguhnya mereka akan disoal:"
  },
  {
    "surah": 37,
    "ayat": 25,
    "terjemahan": "\"Mengapa kamu tidak bertolong-tolongan (sebagaimana yang kamu dakwakan dahulu?\""
  },
  {
    "surah": 37,
    "ayat": 26,
    "terjemahan": "(Mereka pada ketika itu tidak dapat berbuat apa-apa) bahkan mereka pada hari itu menyerah diri dengan hina (untuk diadili);"
  },
  {
    "surah": 37,
    "ayat": 27,
    "terjemahan": "Dan masing-masing pun mengadap satu sama lain, sambil kata mengata dan cela mencela."
  },
  {
    "surah": 37,
    "ayat": 28,
    "terjemahan": "Pengikut-pengikut berkata (kepada ketuanya):\" Sesungguhnya kamu dahulu selalu datang menyekat kami (daripada beriman) dengan menggunakan kuasa kamu\"."
  },
  {
    "surah": 37,
    "ayat": 29,
    "terjemahan": "Ketua-ketuanya menjawab: \" (Tidak!) Bahkan kamulah sendiri tidak mahu menjadi orang-orang yang beriman!"
  },
  {
    "surah": 37,
    "ayat": 30,
    "terjemahan": "\"Dan kami (selain daripada mengajak kamu (tidak mempunyai sebarang kuasa memerintah kamu, bahkan kamu sememangnya kaum yang melampaui batas."
  },
  {
    "surah": 37,
    "ayat": 31,
    "terjemahan": "(Dengan keadaan diri kita yang sedemikian) maka tetaplah di atas kita janji seksa (yang dijanjikan) oleh Tuhan kita, bahawa kita semua tentu akan merasai (azab itu)."
  },
  {
    "surah": 37,
    "ayat": 32,
    "terjemahan": "\"(Dengan sebab ketentuan yang tersebut) maka kami pun mengajak kamu menjadi sesat, kerana sebenarnya kami adalah orang-orang sesat\""
  },
  {
    "surah": 37,
    "ayat": 33,
    "terjemahan": "Maka sesungguhnya mereka semua pada hari itu, menderita azab bersama."
  },
  {
    "surah": 37,
    "ayat": 34,
    "terjemahan": "Sesungguhnya demikianlah Kami melakukan kepada orang-orang yang berdosa."
  },
  {
    "surah": 37,
    "ayat": 35,
    "terjemahan": "Sebenarnya mereka dahulu apabila dikatakan kepadanya;\" (ketahuilah, bahawa) tiada Tuhan yang sebenar-benarnya melainkan Allah\" - mereka bersikap takbur mengingkarinya, -"
  },
  {
    "surah": 37,
    "ayat": 36,
    "terjemahan": "Serta mereka berkata: \" Patutkah kami mesti meninggalkan tuhan-tuhan yang kami sembah, kerana mendengar ajakan seorang penyair gila?\""
  },
  {
    "surah": 37,
    "ayat": 37,
    "terjemahan": "(Tidak! Nabi Muhammad bukan penyair dan bukan pula seorang gila) bahkan ia telah membawa kebenaran (tauhid), dan mengesahkan kebenaran (tauhid) yang dibawa oleh Rasul-rasul (yang terdahulu daripadanya)."
  },
  {
    "surah": 37,
    "ayat": 38,
    "terjemahan": "Sesungguhnya kamu (wahai orang-orang musyrik) akan merasai azab seksa yang tidak terperi sakitnya."
  },
  {
    "surah": 37,
    "ayat": 39,
    "terjemahan": "Dan kamu tidak dibalas melainkan (dengan balasan yang sepadan) dengan apa yang kamu telah kerjakan;"
  },
  {
    "surah": 37,
    "ayat": 40,
    "terjemahan": "Kecuali hamba-hamba Allah yang dibersihkan dari sebarang syirik,"
  },
  {
    "surah": 37,
    "ayat": 41,
    "terjemahan": "Mereka itu beroleh limpah kurnia yang termaklum,"
  },
  {
    "surah": 37,
    "ayat": 42,
    "terjemahan": "Iaitu buah-buahan (yang lazat), serta mereka mendapat penghormatan,"
  },
  {
    "surah": 37,
    "ayat": 43,
    "terjemahan": "Di dalam syurga-syurga yang penuh melimpah dengan berjenis-jenis nikmat."
  },
  {
    "surah": 37,
    "ayat": 44,
    "terjemahan": "Mereka duduk berhadap-hadapan di atas pelamin-pelamin kebesaran;"
  },
  {
    "surah": 37,
    "ayat": 45,
    "terjemahan": "Diedarkan kepada mereka piala yang berisi arak (yang diambil) dari sungainya yang mengalir,"
  },
  {
    "surah": 37,
    "ayat": 46,
    "terjemahan": "Minuman itu putih bersih, lagi lazat rasanya, bagi orang-orang yang meminumnya,"
  },
  {
    "surah": 37,
    "ayat": 47,
    "terjemahan": "Ia tidak mengandungi sesuatu yang membahayakan, dan tidak pula mereka mabuk kerana menikmatinya."
  },
  {
    "surah": 37,
    "ayat": 48,
    "terjemahan": "Sedang di sisi mereka ada pula bidadari-bidadari yang tidak menumpukan pandangannya melainkan kepada mereka, lagi yang amat indah luas matanya;"
  },
  {
    "surah": 37,
    "ayat": 49,
    "terjemahan": "(Putih kekuning-kuningan) seolah-olah mereka telur (burung kasuari) yang tersimpan dengan sebaik-baiknya."
  },
  {
    "surah": 37,
    "ayat": 50,
    "terjemahan": "(Tinggalah penduduk Syurga itu menikmati kesenangan), lalu setengahnya mengadap yang lain, sambil berbincang dan bertanya-tanyaan."
  },
  {
    "surah": 37,
    "ayat": 51,
    "terjemahan": "Seorang di antaranya berkata: \" Sesungguhnya aku (di dunia) dahulu, ada seorang rakan (yang menempelak daku)."
  },
  {
    "surah": 37,
    "ayat": 52,
    "terjemahan": "\"katanya: Adakah engkau juga salah seorang dari golongan yang mengakui benarnya (kebangkitan orang-orang mati pada hari akhirat)?"
  },
  {
    "surah": 37,
    "ayat": 53,
    "terjemahan": "\"Adakah sesudah kita mati dan menjadi tanah dan tulang, adakah kita akan (dihidupkan semula serta) dibalas apa yang telah kita lakukan? \" '"
  },
  {
    "surah": 37,
    "ayat": 54,
    "terjemahan": "(Setelah menceritakan perihal rakannya itu) ia berkata lagi: \" Adakah kamu hendak melihat (keadaan rakanku yang ingkar itu)?\""
  },
  {
    "surah": 37,
    "ayat": 55,
    "terjemahan": "Maka ia pun memandang (ke arah neraka), lalu dilihatnya rakannya itu berada ditengah-tengah neraka yang menjulang-julang."
  },
  {
    "surah": 37,
    "ayat": 56,
    "terjemahan": "Ia pun (menempelaknya dengan) berkata:\" Demi Allah! Nyaris-nyaris engkau menceburkan daku dalam kebinasaan."
  },
  {
    "surah": 37,
    "ayat": 57,
    "terjemahan": "\"Dan kalaulah tidak disebabkan nikmat pemberian Tuhanku (dengan hidayah petunjuk), nescaya akan menjadilah daku dari orang-orang yang dibawa hadir (untuk menerima balasan azab) \"."
  },
  {
    "surah": 37,
    "ayat": 58,
    "terjemahan": "(Kemudian ia berkata kepada rakan-rakanya yang sedang menikmati kesenangan di Syurga bersama): \" Bukankah kita (setelah mendapat nikmat-nikmat ini) tidak akan mati lagi, -"
  },
  {
    "surah": 37,
    "ayat": 59,
    "terjemahan": "\"Selain dari kematian kita yang dahulu, dan kita juga tidak akan terkena seksa?\""
  },
  {
    "surah": 37,
    "ayat": 60,
    "terjemahan": "Sesungguhnya (nikmat-nikmat kesenangan Syurga) yang demikian, ialah sebenar-benar pendapatan dan kemenangan yang besar."
  },
  {
    "surah": 37,
    "ayat": 61,
    "terjemahan": "Untuk memperoleh (kejayaan) yang seperti inilah hendaknya orang-orang yang beramal melakukan amal usahanya dengan bersungguh-sungguh (di dunia)."
  },
  {
    "surah": 37,
    "ayat": 62,
    "terjemahan": "Manakah yang lebih baik, limpah kurniaan yang termaklum itu atau pokok zaqqum?"
  },
  {
    "surah": 37,
    "ayat": 63,
    "terjemahan": "Sesungguhnya Kami jadikan pokok zaqqum itu satu ujian bagi orang-orang yang zalim (di dunia dan azab seksa bagi mereka di akhirat)."
  },
  {
    "surah": 37,
    "ayat": 64,
    "terjemahan": "Sebenarnya ia sebatang pohon yang tumbuh di dasar neraka yang marak menjulang;"
  },
  {
    "surah": 37,
    "ayat": 65,
    "terjemahan": "Buahnya seolah-olah kepala Syaitan-syaitan;"
  },
  {
    "surah": 37,
    "ayat": 66,
    "terjemahan": "Maka sudah tentu mereka akan makan dari buahnya (sekalipun pahit dan busuk), sehingga mereka memenuhi perut darinya."
  },
  {
    "surah": 37,
    "ayat": 67,
    "terjemahan": "Kemudian, sesungguhnya mereka akan beroleh lagi - selain itu- satu minuman campuran dari air panas yang menggelegak."
  },
  {
    "surah": 37,
    "ayat": 68,
    "terjemahan": "Setelah (mereka dibawa minum) maka tempat kembali mereka tetaplah ke dalam neraka yang menjulang-julang."
  },
  {
    "surah": 37,
    "ayat": 69,
    "terjemahan": "Sebenarnya mereka telah mendapati datuk nenek mereka berada dalam kesesatan;"
  },
  {
    "surah": 37,
    "ayat": 70,
    "terjemahan": "Lalu mereka terburu-buru menurut jejak langkah datuk neneknya."
  },
  {
    "surah": 37,
    "ayat": 71,
    "terjemahan": "Dan demi sesungguhnya, telah sesat juga - sebelum kaummu (wahai Muhammad) - kebanyakan kaum-kaum yang telah lalu."
  },
  {
    "surah": 37,
    "ayat": 72,
    "terjemahan": "Pada hal, demi sesungguhnya, Kami telahpun mengutus dalam kalangan kaum-kaum itu, Rasul-rasul pemberi amaran."
  },
  {
    "surah": 37,
    "ayat": 73,
    "terjemahan": "Maka lihatlah bagaimana kesudahan orang-orang (yang mendustakan Rasul-rasul Kami) setelah diberi amaran, -"
  },
  {
    "surah": 37,
    "ayat": 74,
    "terjemahan": "Kecuali hamba-hamba Allah yang dibersihkan dari sebarang syirik (maka mereka akan terselamat dan mendapat sebaik-baik balasan)."
  },
  {
    "surah": 37,
    "ayat": 75,
    "terjemahan": "Dan demi sesungguhnya, Nabi Nuh telah berdoa merayu kepada Kami (memohon pertolongan), maka Kami adalah sebaik-baik yang kabulkan doa permohonan."
  },
  {
    "surah": 37,
    "ayat": 76,
    "terjemahan": "Dan Kami telah selamatkan dia bersama-sama dengan keluarga dan pengikut-pengikutnya, dari kesusahan yang besar."
  },
  {
    "surah": 37,
    "ayat": 77,
    "terjemahan": "Dan Kami jadikan zuriat keturunannya sahaja orang-orang yang tinggal hidup (setelah Kami binasakan kaumnya yang ingkar)."
  },
  {
    "surah": 37,
    "ayat": 78,
    "terjemahan": "Dan Kami kekalkan baginya (nama yang harum) dalam kalangan orang-orang yang datang kemudian:"
  },
  {
    "surah": 37,
    "ayat": 79,
    "terjemahan": "\"Salam sejahtera kepada Nabi Nuh dalam kalangan penduduk seluruh alam ! \""
  },
  {
    "surah": 37,
    "ayat": 80,
    "terjemahan": "Demikianlah sebenarnya Kami membalas orang-orang yang berusaha mengerjakan amal-amal yang baik."
  },
  {
    "surah": 37,
    "ayat": 81,
    "terjemahan": "Sesungguhnya Nabi Nuh itu dari hamba-hamba Kami yang beriman."
  },
  {
    "surah": 37,
    "ayat": 82,
    "terjemahan": "Kemudian Kami tenggelamkan golongan yang lain (yang mendustakannya)."
  },
  {
    "surah": 37,
    "ayat": 83,
    "terjemahan": "Dan sesungguhnya di antara orang-orang yang menegakkan (ajaran yang dibawa oleh) Nabi Nuh ialah Nabi Ibrahim."
  },
  {
    "surah": 37,
    "ayat": 84,
    "terjemahan": "Ketika ia mematuhi perintah tuhannya dengan hati yang suci murni."
  },
  {
    "surah": 37,
    "ayat": 85,
    "terjemahan": "Ketika ia berkata kepada bapanya dan kaumnya: \" Apa yang kamu sembah?"
  },
  {
    "surah": 37,
    "ayat": 86,
    "terjemahan": "\"Patutkah kamu menyembah tuhan-tuhan yang lain dari Allah, kerana kamu memutar belitkan kebenaran semata-mata (bukan kerana benarnya)?"
  },
  {
    "surah": 37,
    "ayat": 87,
    "terjemahan": "\"Maka bagaimana fikiran kamu pula terhadap Allah Tuhan sekalian alam?\""
  },
  {
    "surah": 37,
    "ayat": 88,
    "terjemahan": "Kemudian ia memandang dengan satu renungan kepada bintang-bintang (yang bertaburan di langit),"
  },
  {
    "surah": 37,
    "ayat": 89,
    "terjemahan": "Lalu berkata: \"Sesungguhnya aku merasa sakit (tak dapat turut berhari raya sama)\"."
  },
  {
    "surah": 37,
    "ayat": 90,
    "terjemahan": "Setelah (mendengar kata-katanya) itu, mereka berpaling meninggalkan dia."
  },
  {
    "surah": 37,
    "ayat": 91,
    "terjemahan": "Lalu ia pergi kepada berhala-berhala mereka secara bersembunyi, serta ia bertanya (kepada berhala-berhala itu, secara mengejek-ejek): \"Mengapa kamu tidak makan?"
  },
  {
    "surah": 37,
    "ayat": 92,
    "terjemahan": "\"Mengapa kamu tidak menjawab?\""
  },
  {
    "surah": 37,
    "ayat": 93,
    "terjemahan": "Lalu ia memukul berhala-berhala itu dengan tangan kanannya (sehingga pecah berketul-ketul)."
  },
  {
    "surah": 37,
    "ayat": 94,
    "terjemahan": "(Setelah kaumnya mengetahui hal itu) maka datanglah mereka beramai-ramai kepadanya."
  },
  {
    "surah": 37,
    "ayat": 95,
    "terjemahan": "(Bagi menjawab bantahan mereka), ia berkata: \"Patutkah kamu menyembah benda-benda yang kamu pahat?"
  },
  {
    "surah": 37,
    "ayat": 96,
    "terjemahan": "\"Padahal Allah yang mencipta kamu dan benda-benda yang kamu buat itu!\""
  },
  {
    "surah": 37,
    "ayat": 97,
    "terjemahan": "(Setelah tak dapat berhujah lagi, ketua-ketua) mereka berkata: \"Binalah untuk Ibrahim sebuah tempat (untuk membakarnya), kemudian campakkan dia ke dalam api yang menjulang-julang itu\"."
  },
  {
    "surah": 37,
    "ayat": 98,
    "terjemahan": "Maka mereka (dengan perbuatan membakar Nabi Ibrahim itu) hendak melakukan angkara yang menyakitinya, lalu Kami jadikan mereka orang-orang yang terkebawah (yang tidak berjaya maksudnya)."
  },
  {
    "surah": 37,
    "ayat": 99,
    "terjemahan": "Dan Nabi Ibrahim pula berkata: \"Aku hendak (meninggalkan kamu) pergi kepada Tuhanku, Ia akan memimpinku (ke jalan yang benar)."
  },
  {
    "surah": 37,
    "ayat": 100,
    "terjemahan": "\" Wahai Tuhanku! Kurniakanlah kepadaku anak yang terhitung dari orang-orang yang soleh!\""
  },
  {
    "surah": 37,
    "ayat": 101,
    "terjemahan": "Lalu Kami berikan kepadanya berita yang mengembirakan, bahawa ia akan beroleh seorang anak yang penyabar."
  },
  {
    "surah": 37,
    "ayat": 102,
    "terjemahan": "Maka ketika anaknya itu sampai (ke peringkat umur yang membolehkan dia) berusaha bersama-sama dengannya, Nabi Ibrahim berkata: \"Wahai anak kesayanganku! Sesungguhnya aku melihat dalam mimpi bahawa aku akan menyembelihmu; maka fikirkanlah apa pendapatmu?\". Anaknya menjawab: \"Wahai ayah, jalankanlah apa yang diperintahkan kepadamu; Insya Allah, ayah akan mendapati daku dari orang-orang yang sabar\"."
  },
  {
    "surah": 37,
    "ayat": 103,
    "terjemahan": "Setelah keduanya berserah bulat-bulat (menjunjung perintah Allah itu), dan Nabi Ibrahim merebahkan anaknya dengan meletakkan iringan mukanya di atas tompok tanah, (Kami sifatkan Ibrahim - dengan kesungguhan azamnya itu telah menjalankan perintah Kami),"
  },
  {
    "surah": 37,
    "ayat": 104,
    "terjemahan": "Serta Kami menyerunya: \"Wahai Ibrahim!"
  },
  {
    "surah": 37,
    "ayat": 105,
    "terjemahan": "\"Engkau telah menyempurnakan maksud mimpi yang engkau lihat itu\". Demikianlah sebenarnya Kami membalas orang-orang yang berusaha mengerjakan kebaikan."
  },
  {
    "surah": 37,
    "ayat": 106,
    "terjemahan": "Sesungguhnya perintah ini adalah satu ujian yang nyata;"
  },
  {
    "surah": 37,
    "ayat": 107,
    "terjemahan": "Dan Kami tebus anaknya itu dengan seekor binatang sembelihan yang besar;"
  },
  {
    "surah": 37,
    "ayat": 108,
    "terjemahan": "Dan Kami kekalkan baginya (nama yang harum) dalam kalangan orang-orang yang datang kemudian:"
  },
  {
    "surah": 37,
    "ayat": 109,
    "terjemahan": "\"Salam sejahtera kepada Nabi Ibrahim!\"."
  },
  {
    "surah": 37,
    "ayat": 110,
    "terjemahan": "Demikianlah Kami membalas orang-orang yang berusaha mengerjakan kebaikan."
  },
  {
    "surah": 37,
    "ayat": 111,
    "terjemahan": "Sesungguhnya Nabi Ibrahim itu dari hamba-hamba Kami yang beriman."
  },
  {
    "surah": 37,
    "ayat": 112,
    "terjemahan": "Dan Kami pula berikan kepadanya berita yang mengembirakan, bahawa ia akan beroleh (seorang anak): Ishak, yang akan menjadi Nabi, yang terhitung dari orang-orang yang soleh."
  },
  {
    "surah": 37,
    "ayat": 113,
    "terjemahan": "Dan Kami limpahi berkat kepadanya dan kepada (anaknya): Ishak; dan di antara zuriat keturunan keduanya ada yang mengerjakan kebaikan, dan ada pula yang berlaku zalim dengan nyata, terhadap dirinya sendiri."
  },
  {
    "surah": 37,
    "ayat": 114,
    "terjemahan": "Dan demi sesungguhnya! kami telah melimpahkan nikmat pemberian kepada Nabi Musa dan Nabi Harun."
  },
  {
    "surah": 37,
    "ayat": 115,
    "terjemahan": "Dan Kami selamatkan keduanya dan kaumnya dari kesusahan yang besar;"
  },
  {
    "surah": 37,
    "ayat": 116,
    "terjemahan": "Dan Kami menolong mereka sehingga menjadilah mereka orang-orang yang berjaya mengalahkan (lawannya);"
  },
  {
    "surah": 37,
    "ayat": 117,
    "terjemahan": "Dan Kami berikan kepada keduanya Kitab Suci yang amat jelas keterangannya;"
  },
  {
    "surah": 37,
    "ayat": 118,
    "terjemahan": "Dan Kami berikan hidayah petunjuk kepada keduanya ke jalan yang lurus."
  },
  {
    "surah": 37,
    "ayat": 119,
    "terjemahan": "Dan Kami kekalkan bagi keduanya (nama yang harum) dalam kalangan orang-orang yang datang kemudian:"
  },
  {
    "surah": 37,
    "ayat": 120,
    "terjemahan": "\"Salam sejahtera kepada Nabi Musa dan Nabi Harun!\""
  },
  {
    "surah": 37,
    "ayat": 121,
    "terjemahan": "Demikianlah sebenarnya Kami membalas orang-orang yang berusaha mengerjakan kebaikan."
  },
  {
    "surah": 37,
    "ayat": 122,
    "terjemahan": "Sesungguhnya mereka berdua adalah dari hamba-hamba Kami yang beriman."
  },
  {
    "surah": 37,
    "ayat": 123,
    "terjemahan": "Dan sesungguhnya Nabi Ilyas adalah dari Rasul-rasul (Kami) yang diutus."
  },
  {
    "surah": 37,
    "ayat": 124,
    "terjemahan": "(Ingatkanlah peristiwa) ketika ia berkata kepada kaumnya: \"Hendaklah kamu mematuhi suruhan Allah dan menjauhi laranganNya."
  },
  {
    "surah": 37,
    "ayat": 125,
    "terjemahan": "\"Patutkah kamu menyembah berhala Ba'la, dan kamu meninggalkan (ibadat kepada) sebijak-bijak pencipta?"
  },
  {
    "surah": 37,
    "ayat": 126,
    "terjemahan": "\"Iaitu Allah Tuhan kamu, dan Tuhan datuk nenek kamu yang telah lalu!\""
  },
  {
    "surah": 37,
    "ayat": 127,
    "terjemahan": "Maka mereka mendustakannya; akibatnya mereka tetap akan dibawa hadir (untuk diseksa),"
  },
  {
    "surah": 37,
    "ayat": 128,
    "terjemahan": "Kecuali hamba-hamba Allah yang dibersihkan dari sebarang syirik (maka mereka akan terselamat, dan mendapat sebaik-baik balasan)."
  },
  {
    "surah": 37,
    "ayat": 129,
    "terjemahan": "Dan Kami kekalkan bagi Nabi Ilyas (nama yang harum) dalam kalangan orang-orang yang datang kemudian:"
  },
  {
    "surah": 37,
    "ayat": 130,
    "terjemahan": "\"Salam sejahtera kepada Nabi Ilyas!\""
  },
  {
    "surah": 37,
    "ayat": 131,
    "terjemahan": "Demikianlah sebenarnya Kami membalas orang-orang yang berusaha mengerjakan kebaikan."
  },
  {
    "surah": 37,
    "ayat": 132,
    "terjemahan": "Sesungguhnya Nabi Ilyas itu dari hamba-hamba Kami yang beriman."
  },
  {
    "surah": 37,
    "ayat": 133,
    "terjemahan": "Dan sesungguhnya Nabi Lut adalah dari Rasul-rasul (Kami) yang diutus."
  },
  {
    "surah": 37,
    "ayat": 134,
    "terjemahan": "(ingatkanlah peristiwa) ketika kami selamatkan dia dan keluarga serta pengikut-pengikutnya semuanya,"
  },
  {
    "surah": 37,
    "ayat": 135,
    "terjemahan": "Kecuali seorang perempuan tua tertinggal dalam golongan yang dibinasakan."
  },
  {
    "surah": 37,
    "ayat": 136,
    "terjemahan": "Kemudian Kami hancurkan yang lain (dari pengikut-pengikut Nabi Lut)."
  },
  {
    "surah": 37,
    "ayat": 137,
    "terjemahan": "Dan sesungguhnya kamu (yang menentang Nabi Muhammad): berulang-alik (melalui bekas-bekas tempat tinggal) mereka, semasa kamu berada pada waktu pagi."
  },
  {
    "surah": 37,
    "ayat": 138,
    "terjemahan": "Dan juga pada waktu malam; maka mengapa kamu tidak mahu memikirkannya?."
  },
  {
    "surah": 37,
    "ayat": 139,
    "terjemahan": "Dan sesungguhnya Nabi Yunus adalah dari Rasul-rasul (Kami) yang diutus."
  },
  {
    "surah": 37,
    "ayat": 140,
    "terjemahan": "(Ingatkanlah peristiwa) ketika ia melarikan diri ke kapal yang penuh sarat."
  },
  {
    "surah": 37,
    "ayat": 141,
    "terjemahan": "(Dengan satu keadaan yang memaksa) maka dia pun turut mengundi, lalu menjadilah ia dari orang-orang yang kalah yang digelunsurkan (ke laut)."
  },
  {
    "surah": 37,
    "ayat": 142,
    "terjemahan": "Setelah itu ia ditelan oleh ikan besar, sedang ia berhak ditempelak."
  },
  {
    "surah": 37,
    "ayat": 143,
    "terjemahan": "Maka kalaulah ia bukan dari orang-orang yang sentiasa mengingati Allah (dengan zikir dan tasbih),"
  },
  {
    "surah": 37,
    "ayat": 144,
    "terjemahan": "Tentulah ia akan tinggal di dalam perut ikan itu hingga ke hari manusia dibangkitkan keluar dari kubur."
  },
  {
    "surah": 37,
    "ayat": 145,
    "terjemahan": "Oleh itu Kami campakkan dia keluar (dari perut ikan) ke tanah yang tandus (di tepi pantai), sedang ia berkeadaan sakit."
  },
  {
    "surah": 37,
    "ayat": 146,
    "terjemahan": "Dan Kami tumbuhkan (untuk melindunginya) sebatang pokok yang berdaun lebar."
  },
  {
    "surah": 37,
    "ayat": 147,
    "terjemahan": "Dan (Nabi Yunus yang tersebut kisahnya itu) Kami utuskan kepada (kaumnya yang seramai) seratus ribu atau lebih."
  },
  {
    "surah": 37,
    "ayat": 148,
    "terjemahan": "(Setelah berlaku apa yang berlaku) maka mereka pun beriman, lalu Kami biarkan mereka menikmati kesenangan hidup hingga ke suatu masa (yang ditetapkan bagi masing-masing)."
  },
  {
    "surah": 37,
    "ayat": 149,
    "terjemahan": "(Oleh sebab ada di antara kaum musyrik Arab yang mendakwa bahawa malaikat itu anak-anak perempuan Allah) maka bertanyalah (wahai Muhammad) kepada mereka itu: Adilkah mereka membahagi untuk Tuhanmu anak-anak perempuan, dan untuk mereka anak-anak lelaki?"
  },
  {
    "surah": 37,
    "ayat": 150,
    "terjemahan": "Atau adakah mereka hadir sendiri menyaksikan Kami mencipta malaikat-malaikat itu - perempuan?"
  },
  {
    "surah": 37,
    "ayat": 151,
    "terjemahan": "Ketahuilah! Bahawa sesungguhnya, dengan sebab terpesongnya dari kebenaran, mereka berkata:"
  },
  {
    "surah": 37,
    "ayat": 152,
    "terjemahan": "\"Allah beranak\"; sedang mereka, sesungguhnya adalah orang-orang yang berdusta!"
  },
  {
    "surah": 37,
    "ayat": 153,
    "terjemahan": "(Patutkah kamu mendakwa bahawa Tuhan mempunyai anak, dan anak itu pula ialah anak-anak perempuan yang kamu tidak sukai?) Adakah Tuhan memilih serta mengutamakan anak-anak perempuan dari anak-anak lelaki (sedang kedua-dua jenis itu Dia lah yang menciptakannya)?"
  },
  {
    "surah": 37,
    "ayat": 154,
    "terjemahan": "Apa sudah jadi kamu? Bagaimana kamu menetapkan hukum (yang terang-terang salahnya itu)?"
  },
  {
    "surah": 37,
    "ayat": 155,
    "terjemahan": "Setelah ditegur, maka tidakkah kamu mahu berusaha mengingatkan (bahawa Allah mustahil bagiNya anak-pinak)?"
  },
  {
    "surah": 37,
    "ayat": 156,
    "terjemahan": "Atau adakah kamu mempunyai sebarang bukti yang nyata (menerangkan bahawa malaikat itu anak-anak perempuan Allah)?"
  },
  {
    "surah": 37,
    "ayat": 157,
    "terjemahan": "(Kiranya ada) maka bawalah kitab kamu (yang menerangkan demikian), jika betul kamu orang-orang yang benar."
  },
  {
    "surah": 37,
    "ayat": 158,
    "terjemahan": "(Mereka telah mengatakan perkara yang mustahil) serta mengadakan pertalian kerabat di antara Allah dan malaikat, padahal demi sesungguhnya malaikat itu sedia mengetahui bahawa sebenarnya orang-orang yang melakukan demikian akan dibawa hadir (ke dalam azab pada hari akhirat)."
  },
  {
    "surah": 37,
    "ayat": 159,
    "terjemahan": "Maha Suci Allah dari apa yang mereka katakan itu!"
  },
  {
    "surah": 37,
    "ayat": 160,
    "terjemahan": "Kecuali hamba-hamba Allah yang dibersihkan dari sebarang syirik, (maka mereka akan terselamat, dan akan mendapat sebaik-baik balasan)."
  },
  {
    "surah": 37,
    "ayat": 161,
    "terjemahan": "Maka sebenarnya kamu (wahai orang-orang musyrik), dan apa yang kamu sembah itu."
  },
  {
    "surah": 37,
    "ayat": 162,
    "terjemahan": "Tidak akan dapat merosakkan perhubungan seseorang dengan Tuhannya,"
  },
  {
    "surah": 37,
    "ayat": 163,
    "terjemahan": "kecuali orang-orang yang telah ditetapkan bahawa dia akan dibakar di dalam neraka yang menjulang-julang."
  },
  {
    "surah": 37,
    "ayat": 164,
    "terjemahan": "(Malaikat pula menegaskan pendirian mereka dengan berkata): \"Dan tiada sesiapapun dari kalangan kami melainkan ada baginya darjat kedudukan yang tertentu (dalam menyempurnakan tugasnya);"
  },
  {
    "surah": 37,
    "ayat": 165,
    "terjemahan": "\"Dan sesungguhnya kamilah yang sentiasa berbaris (menjunjung perintah dan beribadat),"
  },
  {
    "surah": 37,
    "ayat": 166,
    "terjemahan": "\"Dan sesungguhnya kamilah yang sentiasa bertasbih (mensucikan Allah dari sebarang sifat kekurangan)!\""
  },
  {
    "surah": 37,
    "ayat": 167,
    "terjemahan": "Dan sebenarnya mereka (yang musyrik) itu dahulu pernah berkata:"
  },
  {
    "surah": 37,
    "ayat": 168,
    "terjemahan": "\"Kalaulah ada di sisi kami Kitab Suci dari (bawaan Rasul-rasul) yang telah lalu"
  },
  {
    "surah": 37,
    "ayat": 169,
    "terjemahan": "\"Tentulah kami akan menjadi hamba-hamba Allah yang dibersihkan dari sebarang syirik!\""
  },
  {
    "surah": 37,
    "ayat": 170,
    "terjemahan": "(Setelah Al-Quran diturunkan kepada mereka) mereka mengingkarinya; oleh itu mereka akan mengetahui kelak (akibat kekufurannya)."
  },
  {
    "surah": 37,
    "ayat": 171,
    "terjemahan": "Dan demi sesungguhnya! Telah ada semenjak dahulu lagi, ketetapan Kami, bagi hamba-hamba Kami yang diutus menjadi Rasul -"
  },
  {
    "surah": 37,
    "ayat": 172,
    "terjemahan": "Bahawa sesungguhnya merekalah orang-orang yang diberikan pertolongan mencapai kemenangan"
  },
  {
    "surah": 37,
    "ayat": 173,
    "terjemahan": "Dan bahawasanya tentera Kami (pengikut-pengikut Rasul), merekalah orang-orang yang mengalahkan (golongan yang menentang kebenaran)."
  },
  {
    "surah": 37,
    "ayat": 174,
    "terjemahan": "Oleh itu berpalinglah (wahai Muhammad) dari mereka, (jangan hiraukan celaan mereka serta bersabarlah) hingga ke suatu masa."
  },
  {
    "surah": 37,
    "ayat": 175,
    "terjemahan": "Dan lihat (apa yang akan menimpa) mereka; tidak lama kemudian mereka akan melihat (kemenangan yang telah Kami tetapkan untukmu)."
  },
  {
    "surah": 37,
    "ayat": 176,
    "terjemahan": "Maka tidaklah patut mereka meminta disegerakan azab (yang telah ditetapkan oleh) Kami!"
  },
  {
    "surah": 37,
    "ayat": 177,
    "terjemahan": "Kerana apabila azab itu turun dalam daerah dan kawasan mereka, sudah tentu buruklah hari orang-orang yang tidak mengindahkan amaran yang telah diberikan."
  },
  {
    "surah": 37,
    "ayat": 178,
    "terjemahan": "Dan berpalinglah (wahai Muhammad) dari mereka, (jangan hiraukan celaan mereka serta bersabarlah) hingga ke suatu masa."
  },
  {
    "surah": 37,
    "ayat": 179,
    "terjemahan": "Dan lihatlah (apa yang akan jadi); tidak lama kemudian, mereka pun akan melihat juga."
  },
  {
    "surah": 37,
    "ayat": 180,
    "terjemahan": "Akuilah kesucian Tuhanmu, - Tuhan yang mempunyai keagungan dan kekuasaan, - dari apa yang mereka katakan!"
  },
  {
    "surah": 37,
    "ayat": 181,
    "terjemahan": "Dan (ucaplah) salam sejahtera kepada sekalian Rasul."
  },
  {
    "surah": 37,
    "ayat": 182,
    "terjemahan": "Serta (ingatlah bahawa) segala puji tertentu bagi Allah, Tuhan yang memelihara dan mentadbirkan seluruh alam."
  },
  {
    "surah": 38,
    "ayat": 1,
    "terjemahan": "Saad; demi Al-Quran yang mempunyai kemuliaan serta mengandungi peringatan dan pengajaran."
  },
  {
    "surah": 38,
    "ayat": 2,
    "terjemahan": "(Orang-orang yang mengingkari kerasulanmu - wahai Muhammad - tidak berdasarkan kebenaran) bahkan mereka yang kafir itu bersifat sombong angkuh dan suka menentang kebenaran."
  },
  {
    "surah": 38,
    "ayat": 3,
    "terjemahan": "(Tidakkah mereka menyedari) berapa banyak umat-umat (yang ingkar) yang terdahulu dari mereka, Kami binasakan? Lalu mereka meminta pertolongan, padahal saat itu bukanlah saat meminta pertolongan melepaskan diri dari azab."
  },
  {
    "surah": 38,
    "ayat": 4,
    "terjemahan": "Dan mereka (yang mengingkari kerasulan Nabi Muhammad itu) merasa hairan, bahawa mereka didatangi oleh seorang Rasul pemberi amaran, dari kalangan mereka sendiri. Dan mereka yang kafir itu berkata: \"Orang ini adalah seorang ahli sihir, lagi pendusta."
  },
  {
    "surah": 38,
    "ayat": 5,
    "terjemahan": "\" Patutkah ia menafikan tuhan-tuhan yang berbilang itu dengan mengatakan: Tuhan hanya Satu? Sesungguhnya ini adalah satu perkara yang menakjubkan!\""
  },
  {
    "surah": 38,
    "ayat": 6,
    "terjemahan": "Dan (ketika itu) keluarlah ketua-ketua dari kalangan mereka (memberi peransang dengan berkata): \"Jalan terus (menurut cara penyembahan datuk nenek kamu) dan tetap tekunlah menyembah tuhan-tuhan kamu. Sebenarnya sikap ini adalah satu perkara yang amat dikehendaki."
  },
  {
    "surah": 38,
    "ayat": 7,
    "terjemahan": "\" Kami tidak pernah mendengar tentang (soal mengesakan Tuhan) itu dalam ugama yang terakhir; perkara ini tidak lain hanyalah rekaan dan dusta semata-mata\"."
  },
  {
    "surah": 38,
    "ayat": 8,
    "terjemahan": "(Mereka berkata lagi): Patutkah wahyu peringatan itu diturunkan kepada Muhammad (padahal orang-orang yang lebih layak ada) di antara kita?\" (Mereka bukan sahaja ingkarkan kelayakan Nabi Muhammad menerima wahyu) bahkan mereka berada dalam keraguan tentang peringatan yang Aku wahyukan (kepada Nabi Muhammad) itu, bahkan mereka belum lagi merasai azab."
  },
  {
    "surah": 38,
    "ayat": 9,
    "terjemahan": "Adakah di sisi mereka perbendaharaan rahmat Tuhanmu Yang Maha Kuasa, lagi Yang Maha Melimpah pemberianNya?."
  },
  {
    "surah": 38,
    "ayat": 10,
    "terjemahan": "Atau adakah mereka menguasai langit dan bumi serta segala yang ada di antara keduanya?. (Kalau ada kekuasaan yang demikian) maka biarlah mereka naik mendaki langit menurut jalan-jalan yang membawa mereka ke situ (untuk mentadbirkan seluruh alam)."
  },
  {
    "surah": 38,
    "ayat": 11,
    "terjemahan": "(Sebenarnya mereka hanyalah) satu pasukan tentera dari kumpulan-kumpulan (yang menentang kebenaran), yang pada suatu masa kelak tetap akan dikalahkan."
  },
  {
    "surah": 38,
    "ayat": 12,
    "terjemahan": "Sebelum mereka itu, kaum Nabi Nuh, dan Aad (kaum Nabi Hud), serta Firaun yang mempunyai kerajaan yang kuat, telah juga mendustakan Rasul masing-masing."
  },
  {
    "surah": 38,
    "ayat": 13,
    "terjemahan": "Dan juga Thamud (kaum Nabi Soleh), dan kaum Nabi Lut, serta penduduk Aikah; merekalah kumpulan-kumpulan (yang menentang kebenaran)."
  },
  {
    "surah": 38,
    "ayat": 14,
    "terjemahan": "Tidak ada satupun dari kaum-kaum yang tersebut, melainkan telah mendustakan Rasul-rasul; maka berhaklah mereka ditimpa azab."
  },
  {
    "surah": 38,
    "ayat": 15,
    "terjemahan": "Dan orang-orang ini (yang menentang Nabi Muhammad), tidak menunggu melainkan satu jeritan suara yang tidak akan berulang lagi."
  },
  {
    "surah": 38,
    "ayat": 16,
    "terjemahan": "Dan mereka pula berkata (secara mengejek-ejek): \" Wahai Tuhan kami! Segerakanlah azab yang ditetapkan untuk kami, sebelum datangnya hari hitungan amal (yang dikatakan oleh Muhammad itu)\"."
  },
  {
    "surah": 38,
    "ayat": 17,
    "terjemahan": "Bersabarlah (wahai Muhammad) terhadap apa sahaja yang mereka katakan, dan ingatlah akan hamba Kami Nabi Daud, yang mempunyai kekuatan (dalam pegangan ugamanya); sesungguhnya ia adalah sentiasa rujuk kembali (kepada Kami dengan bersabar mematuhi perintah Kami)."
  },
  {
    "surah": 38,
    "ayat": 18,
    "terjemahan": "Sesungguhnya Kami telah mudahkan gunung-ganang turut bertasbih memuji Kami bersama-sama dengannya; pada waktu petang dan ketika terbit matahari."
  },
  {
    "surah": 38,
    "ayat": 19,
    "terjemahan": "Dan (Kami mudahkan juga) unggas turut berhimpun (untuk bertasbih memuji Kami bersama-sama dengannya); tiap-tiap satunya mengulangi tasbih masing-masing menurutnya."
  },
  {
    "surah": 38,
    "ayat": 20,
    "terjemahan": "Dan Kami kuatkan kerajaannya, serta Kami kurniakan kepadanya hikmah kebijaksanaan dan kepitahan berkata-kata (dalam menjalankan hukum dan menjatuhkan hukuman)."
  },
  {
    "surah": 38,
    "ayat": 21,
    "terjemahan": "Dan sudahkah sampai kepadamu (wahai Muhammad) berita (perbicaraan dua) orang yang berselisihan? Ketika mereka memanjat tembok tempat ibadat;"
  },
  {
    "surah": 38,
    "ayat": 22,
    "terjemahan": "Iaitu ketika mereka masuk kepada Nabi Daud, lalu ia terkejut melihat mereka; mereka berkata kepadanya: \" Janganlah takut, (kami ini) adalah dua orang yang berselisihan, salah seorang dari kami telah berlaku zalim kepada yang lain; oleh itu hukumkanlah di antara kami dengan adil, dan janganlah melampaui (batas keadilan), serta pimpinlah kami ke jalan yang lurus."
  },
  {
    "surah": 38,
    "ayat": 23,
    "terjemahan": "\" Sebenarnya orang ini ialah (seorang sahabat sebagai) saudaraku; ia mempunyai sembilan puluh sembilan ekor kambing betina dan aku mempunyai seekor sahaja; dalam pada itu ia (mendesakku dengan) berkata: ' Serahkanlah yang seekor itu kepadaku ', dan dia telah mengalahkan daku dalam merundingkan perkara itu\"."
  },
  {
    "surah": 38,
    "ayat": 24,
    "terjemahan": "Nabi Daud berkata: \" Sesungguhnya ia telah berlaku zalim kepadamu dengan meminta kambingmu itu (sebagai tambahan) kepada kambing-kambingnya; dan sesungguhnya kebanyakan dari orang-orang yang bergaul dan berhubungan (dalam berbagai-bagai lapangan hidup), setengahnya berlaku zalim kepada setengahnya yang lain, kecuali orang-orang yang beriman dan beramal soleh; sedang mereka amatlah sedikit!\" Dan Nabi Daud (setelah berfikir sejurus), mengetahui sebenarnya Kami telah mengujinya (dengan peristiwa itu), lalu ia memohon ampun kepada Tuhannya sambil merebahkan dirinya sujud, serta ia rujuk kembali (bertaubat)."
  },
  {
    "surah": 38,
    "ayat": 25,
    "terjemahan": "Maka Kami ampunkan kesalahannya itu; dan sesungguhnya ia mempunyai kedudukan yang dekat di sisi Kami serta tempat kembali yang sebaik-baiknya (pada hari akhirat kelak)."
  },
  {
    "surah": 38,
    "ayat": 26,
    "terjemahan": "Wahai Daud, sesungguhnya Kami telah menjadikanmu khalifah di bumi, maka jalankanlah hukum di antara manusia dengan (hukum syariat) yang benar (yang diwahyukan kepadamu); dan janganlah engkau menurut hawa nafsu, kerana yang demikian itu akan menyesatkanmu dari jalan Allah. Sesungguhnya orang-orang yang sesat dari jalan Allah, akan beroleh azab yang berat pada hari hitungan amal, disebabkan mereka melupakan (jalan Allah) itu."
  },
  {
    "surah": 38,
    "ayat": 27,
    "terjemahan": "Dan tiadalah Kami menciptakan langit dan bumi serta segala yang ada di antara keduanya sebagai ciptaan yang tidak mengandungi hikmah dan keadilan; yang demikian adalah sangkaan orang-orang yang kafir! Maka kecelakaanlah bagi orang-orang yang kafir itu dari azab neraka."
  },
  {
    "surah": 38,
    "ayat": 28,
    "terjemahan": "Patutkah Kami jadikan orang-orang yang beriman dan beramal soleh itu sama seperti orang-orang yang melakukan kerosakan di muka bumi? Atau patutkah Kami jadikan orang-orang yang bertaqwa sama seperti orang-orang yang berdosa?"
  },
  {
    "surah": 38,
    "ayat": 29,
    "terjemahan": "(Al-Quran ini) sebuah Kitab yang Kami turunkan kepadamu (dan umatmu wahai Muhammad), -Kitab yang banyak faedah-faedah dan manfaatnya, untuk mereka memahami dengan teliti kandungan ayat-ayatnya, dan untuk orang-orang yang berakal sempurna beringat mengambil iktibar."
  },
  {
    "surah": 38,
    "ayat": 30,
    "terjemahan": "Dan Kami telah kurniakan kepada Nabi Daud (seorang anak bernama) Sulaiman ia adalah sebaik-baik hamba (yang kuat beribadat), lagi sentiasa rujuk kembali (bertaubat)."
  }
]