[
  {
    "surah": 56,
    "ayat": 22,
    "terjemahan": "Dan (mereka dilayani) bidadari-bidadari yang cantik parasnya,"
  },
  {
    "surah": 56,
    "ayat": 23,
    "terjemahan": "Seperti mutiara yang tersimpan dengan sebaik-baiknya."
  },
  {
    "surah": 56,
    "ayat": 24,
    "terjemahan": "(Semuanya itu) sebagai balasan bagi (amal-amal baik) yang mereka telah kerjakan."
  },
  {
    "surah": 56,
    "ayat": 25,
    "terjemahan": "Mereka tidak akan mendengar dalam Syurga itu perkataan yang sia-sia dan tiada pula sesuatu yang menyebabkan dosa; -"
  },
  {
    "surah": 56,
    "ayat": 26,
    "terjemahan": "Mereka hanya mendengar ucapan: \" Selamat! Selamat! \" (dari satu kepada yang lain)."
  },
  {
    "surah": 56,
    "ayat": 27,
    "terjemahan": "Dan puak kanan, - alangkah bahagianya keadaan puak kanan itu?"
  },
  {
    "surah": 56,
    "ayat": 28,
    "terjemahan": "Mereka bersenang-lenang di antara pohon-pohon bidara yang tidak berduri."
  },
  {
    "surah": 56,
    "ayat": 29,
    "terjemahan": "Dan pokok-pokok pisang yang tersusun rapi buahnya,"
  },
  {
    "surah": 56,
    "ayat": 30,
    "terjemahan": "Dan naungan yang tetap terbentang,"
  },
  {
    "surah": 56,
    "ayat": 31,
    "terjemahan": "Dan air yang sentiasa mengalir,"
  },
  {
    "surah": 56,
    "ayat": 32,
    "terjemahan": "Serta buah-buahan yang banyak,"
  },
  {
    "surah": 56,
    "ayat": 33,
    "terjemahan": "Yang tidak putus-putus dan tidak pula terlarang mendapatnya,"
  },
  {
    "surah": 56,
    "ayat": 34,
    "terjemahan": "Dan tempat-tempat tidur yang tertinggi keadaannya."
  },
  {
    "surah": 56,
    "ayat": 35,
    "terjemahan": "Sesungguhnya Kami telah menciptakan isteri-isteri mereka dengan ciptaan istimewa,"
  },
  {
    "surah": 56,
    "ayat": 36,
    "terjemahan": "Serta Kami jadikan mereka sentiasa dara (yang tidak pernah disentuh),"
  },
  {
    "surah": 56,
    "ayat": 37,
    "terjemahan": "Yang tetap mencintai jodohnya, serta yang sebaya umurnya."
  },
  {
    "surah": 56,
    "ayat": 38,
    "terjemahan": "(Semuanya itu disediakan) bagi puak kanan;"
  },
  {
    "surah": 56,
    "ayat": 39,
    "terjemahan": "Iaitu sebilangan besar dari orang-orang yang terdahulu,"
  },
  {
    "surah": 56,
    "ayat": 40,
    "terjemahan": "Dan sebilangan besar dari orang-orang yang datang kemudian."
  },
  {
    "surah": 56,
    "ayat": 41,
    "terjemahan": "Dan puak kiri, - alangkah seksanya keadaan puak kiri itu?"
  },
  {
    "surah": 56,
    "ayat": 42,
    "terjemahan": "Mereka diseksa dalam angin yang membakar dan air yang menggelegak"
  },
  {
    "surah": 56,
    "ayat": 43,
    "terjemahan": "Serta naungan dari asap hitam,"
  },
  {
    "surah": 56,
    "ayat": 44,
    "terjemahan": "Yang tidak sejuk, dan tidak pula memberi kesenangan."
  },
  {
    "surah": 56,
    "ayat": 45,
    "terjemahan": "Sesungguhnya mereka sebelum itu dilalaikan oleh kemewahan (dunia, dari mengingati hukum Tuhan)."
  },
  {
    "surah": 56,
    "ayat": 46,
    "terjemahan": "Dan mereka pula sentiasa melakukan dosa yang besar,"
  },
  {
    "surah": 56,
    "ayat": 47,
    "terjemahan": "Dan juga mereka selalu berkata: \"Adakah sesudah kita mati serta menjadi tanah dan tulang, betulkah kita akan dibangkitkan hidup semula?"
  },
  {
    "surah": 56,
    "ayat": 48,
    "terjemahan": "\"Dan adakah juga datuk nenek kita yang telah lalu, (akan dibangkitkan hidup semula)? \""
  },
  {
    "surah": 56,
    "ayat": 49,
    "terjemahan": "Katakanlah (kepada mereka): \"Sesungguhnya orang-orang yang telah lalu dan orang-orang yang terkemudian,"
  },
  {
    "surah": 56,
    "ayat": 50,
    "terjemahan": "\"Tetap akan dihimpunkan pada masa yang ditentukan - pada hari kiamat yang termaklum."
  },
  {
    "surah": 56,
    "ayat": 51,
    "terjemahan": "\"Kemudian, sesungguhnya kamu wahai orang-orang yang sesat yang mendustakan (kedatangan hari kiamat),"
  },
  {
    "surah": 56,
    "ayat": 52,
    "terjemahan": "Tetap akan memakan (pada hari itu) dari sebatang pokok, iaitu pokok zaqqum,"
  },
  {
    "surah": 56,
    "ayat": 53,
    "terjemahan": "\"Maka kamu akan memenuhi perut kamu dari pokok (yang pahit buahnya) itu,"
  },
  {
    "surah": 56,
    "ayat": 54,
    "terjemahan": "\"Selepas itu kamu akan meminum pula dari air panas yang menggelegak,"
  },
  {
    "surah": 56,
    "ayat": 55,
    "terjemahan": "\"Iaitu kamu akan minum seperti unta yang berpenyakit sentiasa dahaga dan tidak puas-puas\"."
  },
  {
    "surah": 56,
    "ayat": 56,
    "terjemahan": "Inilah (jenis-jenis azab) yang disediakan untuk menyambut mereka pada hari Pembalasan itu."
  },
  {
    "surah": 56,
    "ayat": 57,
    "terjemahan": "Kamilah yang telah menciptakan kamu (dari tiada kepada ada - wahai golongan yang ingkar), maka ada baiknya kalau kamu percaya (akan kebangkitan kamu hidup semula pada hari kiamat)."
  },
  {
    "surah": 56,
    "ayat": 58,
    "terjemahan": "(Mengapa kamu masih berdegil?) Tidakkah kamu memikirkan keadaan air mani yang kamu pancarkan (ke dalam rahim)?"
  },
  {
    "surah": 56,
    "ayat": 59,
    "terjemahan": "Adakah kamu yang menciptakannya atau Kami yang menciptakannya?"
  },
  {
    "surah": 56,
    "ayat": 60,
    "terjemahan": "Kamilah yang menentukan (dan menetapkan masa) kematian (tiap-tiap seorang) di antara kamu, dan Kami tidak sekali-kali dapat dikalahkan atau dilemahkan;"
  },
  {
    "surah": 56,
    "ayat": 61,
    "terjemahan": "(Bahkan Kami berkuasa) menggantikan (kamu dengan) orang-orang yang serupa kamu (tetapi tidak seperti bawaan kamu), dan berkuasa menciptakan kamu dalam bentuk kejadian yang kamu tidak mengetahuinya."
  },
  {
    "surah": 56,
    "ayat": 62,
    "terjemahan": "Dan demi sesungguhnya, kamu telah sedia mengetahui tentang ciptaan diri kamu kali pertama, maka ada baiknya kalau kamu mengambil ingatan (bahawa Allah yang telah menciptakan kamu dari tiada kepada ada, berkuasa membangkitkan kamu hidup semula pada hari akhirat kelak)."
  },
  {
    "surah": 56,
    "ayat": 63,
    "terjemahan": "Maka (mengapa kamu masih berdegil?) Tidakkah kamu melihat apa yang kamu tanam?"
  },
  {
    "surah": 56,
    "ayat": 64,
    "terjemahan": "Kamukah yang menumbuhkannya atau Kami yang menumbuhkannya?"
  },
  {
    "surah": 56,
    "ayat": 65,
    "terjemahan": "Kalau Kami kehendaki, sudah tentu Kami akan jadikan tanaman itu kering hancur (sebelum ia berbuah), maka dengan itu tinggalah kamu dalam keadaan hairan dan menyesal,"
  },
  {
    "surah": 56,
    "ayat": 66,
    "terjemahan": "(Sambil berkata): \"Sesungguhnya kami menanggung kerugian."
  },
  {
    "surah": 56,
    "ayat": 67,
    "terjemahan": "\"Bahkan kami hampa (dari mendapat sebarang hasil) \""
  },
  {
    "surah": 56,
    "ayat": 68,
    "terjemahan": "Selain dari itu, tidakkah kamu melihat air yang kamu minum?"
  },
  {
    "surah": 56,
    "ayat": 69,
    "terjemahan": "Kamukah yang menurunkannya dari awan (sebagai hujan), atau Kami yang menurunkannya?"
  },
  {
    "surah": 56,
    "ayat": 70,
    "terjemahan": "Kalau Kami kehendaki, Kami akan jadikan dia masin, maka ada baiknya kalau kamu bersyukur."
  },
  {
    "surah": 56,
    "ayat": 71,
    "terjemahan": "Akhirnya, tidakkah kamu melihat api yang kamu nyalakan (dengan cara digesek)?"
  },
  {
    "surah": 56,
    "ayat": 72,
    "terjemahan": "Kamukah yang menumbuhkan pokok kayunya, atau Kami yang menumbuhkannya?"
  },
  {
    "surah": 56,
    "ayat": 73,
    "terjemahan": "Kami jadikan api (yang tercetus dari kayu basah) itu sebagai peringatan (bagi orang-orang yang lalaikan kebenaran hari akhirat) dan sebagai benda yang memberi kesenangan kepada orang-orang musafir."
  },
  {
    "surah": 56,
    "ayat": 74,
    "terjemahan": "Oleh yang demikian - (wahai orang yang lalai) - bertasbihlah dengan memuji nama Tuhanmu Yang Maha Besar (sebagai bersyukur akan nikmat-nikmatNya itu)."
  },
  {
    "surah": 56,
    "ayat": 75,
    "terjemahan": "Maka Aku bersumpah: Demi tempat-tempat dan masa-masa turunnya bahagian-bahagian Al-Quran, -"
  },
  {
    "surah": 56,
    "ayat": 76,
    "terjemahan": "Dan sebenarnya sumpah itu adalah sumpah yang besar, kalaulah kamu mengetahuinya, -"
  },
  {
    "surah": 56,
    "ayat": 77,
    "terjemahan": "Bahawa sesungguhnya (yang dibacakan kepada kamu) itu ialah Al-Quran yang mulia, (yang sentiasa memberi ajaran dan pimpinan),"
  },
  {
    "surah": 56,
    "ayat": 78,
    "terjemahan": "Yang tersimpan dalam Kitab yang cukup terpelihara,"
  },
  {
    "surah": 56,
    "ayat": 79,
    "terjemahan": "Yang tidak disentuh melainkan oleh makhluk-makhluk yang diakui bersih suci;"
  },
  {
    "surah": 56,
    "ayat": 80,
    "terjemahan": "Al-Quran itu diturunkan dari Allah Tuhan sekalian alam."
  },
  {
    "surah": 56,
    "ayat": 81,
    "terjemahan": "Patutkah kamu (wahai golongan yang kufur ingkar) bersikap sambilewa terhadap keterangan-keterangan Al-Quran ini?"
  },
  {
    "surah": 56,
    "ayat": 82,
    "terjemahan": "Dan kamu jadikan sikap kamu mendustakannya (sebagai ganti) bahagian dan nasib kamu (menerima dan bersyukur akan ajarannya)?"
  },
  {
    "surah": 56,
    "ayat": 83,
    "terjemahan": "Maka alangkah eloknya kalau semasa (roh seseorang dari kamu yang hampir mati) sampai ke kerongkongnya, -"
  },
  {
    "surah": 56,
    "ayat": 84,
    "terjemahan": "Sedang kamu pada masa itu (berada di sekelilingnya) menyaksikan keadaannya, -"
  },
  {
    "surah": 56,
    "ayat": 85,
    "terjemahan": "Dan Kami lebih dekat kepadanya daripada kamu, tetapi kamu tidak melihat,"
  },
  {
    "surah": 56,
    "ayat": 86,
    "terjemahan": "Maka bukankah elok kalau kamu orang-orang yang tidak dikuasai (dan tidak tunduk kepada kekuasaan Kami), -"
  },
  {
    "surah": 56,
    "ayat": 87,
    "terjemahan": "Kamu kembalikan roh itu (kepada keadaan sebelumnya) jika betul kamu orang-orang yang benar ?"
  },
  {
    "surah": 56,
    "ayat": 88,
    "terjemahan": "Kesudahannya: jika ia (yang mati itu) dari orang-orang \" Muqarrabiin \","
  },
  {
    "surah": 56,
    "ayat": 89,
    "terjemahan": "Maka (ia akan beroleh) rehat kesenangan, dan rahmat kesegaran, serta Syurga kenikmatan."
  },
  {
    "surah": 56,
    "ayat": 90,
    "terjemahan": "Dan jika ia dari puak kanan,"
  },
  {
    "surah": 56,
    "ayat": 91,
    "terjemahan": "Maka (akan dikatakan kepadanya):\" Selamat sejahtera kepadamu, (kerana engkau) dari puak kanan\"."
  },
  {
    "surah": 56,
    "ayat": 92,
    "terjemahan": "Dan jika ia dari (puak kiri) yang mendustakan (Rasulnya), lagi sesat,"
  },
  {
    "surah": 56,
    "ayat": 93,
    "terjemahan": "Maka sambutan yang disediakan baginya adalah dari air panas yang menggelegak,"
  },
  {
    "surah": 56,
    "ayat": 94,
    "terjemahan": "Serta bakaran api neraka."
  },
  {
    "surah": 56,
    "ayat": 95,
    "terjemahan": "Sesungguhnya (segala yang disebutkan) itu adalah kebenaran yang diyakini."
  },
  {
    "surah": 56,
    "ayat": 96,
    "terjemahan": "Oleh itu, bertasbihlah dengan memuji nama Tuhanmu Yang Maha Besar."
  },
  {
    "surah": 57,
    "ayat": 1,
    "terjemahan": "Segala yang ada di langit dan di bumi tetap mengucap tasbih kepada Allah; dan Dia lah Yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 57,
    "ayat": 2,
    "terjemahan": "Dia lah sahaja yang menguasai dan memiliki langit dan bumi; Ia menghidupkan dan mematikan; dan Ia Maha Kuasa atas tiap-tiap sesuatu."
  },
  {
    "surah": 57,
    "ayat": 3,
    "terjemahan": "Dia lah Yang Awal dan Yang Akhir; dan Yang Zahir serta Yang Batin; dan Dia lah Yang Maha Mengetahui akan tiap-tiap sesuatu."
  },
  {
    "surah": 57,
    "ayat": 4,
    "terjemahan": "Dia lah yang telah menciptakan langit dan bumi dalam enam masa, kemudian Ia bersemayam di atas Arasy; Ia mengetahui apa yang masuk ke bumi serta apa yang keluar daripadanya; dan apa yang diturunkan dari langit serta apa yang naik padanya. Dan Ia tetap bersama-sama kamu di mana sahaja kamu berada, dan Allah Maha Melihat akan apa yang kamu kerjakan."
  },
  {
    "surah": 57,
    "ayat": 5,
    "terjemahan": "Dia lah sahaja yang menguasai dan memiliki langit dan bumi; dan kepada Allah jualah dikembalikan segala urusan."
  },
  {
    "surah": 57,
    "ayat": 6,
    "terjemahan": "Dia lah yang memasukkan waktu malam ke dalam waktu siang, dan memasukkan waktu siang ke dalam waktu malam (silih berganti); dan Dia lah yang Maha Mengetahui akan segala (isi hati) yang terkandung di dalam dada."
  },
  {
    "surah": 57,
    "ayat": 7,
    "terjemahan": "Berimanlah kamu kepada Allah dan RasulNya, dan belanjakanlah (pada jalan kebajikan) sebahagian dari harta benda (pemberian Allah) yang dijadikannya kamu menguasainya sebagai wakil. Maka orang-orang yang beriman di antara kamu serta mereka membelanjakan (sebahagian dari harta itu pada jalan Allah); mereka tetap beroleh pahala yang besar."
  },
  {
    "surah": 57,
    "ayat": 8,
    "terjemahan": "Dan mengapa kamu tidak beriman kepada Allah? Sedang Rasulullah mengajak kamu untuk beriman kepada Tuhan kamu, dan Allah telah mengambil janji setia dari kamu (untuk beriman); jika kamu hendak beriman (maka telah jelaslah dalil-dalilnya)."
  },
  {
    "surah": 57,
    "ayat": 9,
    "terjemahan": "Dia lah yang menurunkan kepada hambaNya (Nabi Muhammad) keterangan-keterangan Al-Quran yang terang nyata, kerana Ia hendak mengeluarkan kamu dari gelap-gelita (kekufuran) kepada cahaya (iman) yang terang-benderang. Dan (ingatlah) sesungguhnya Allah Maha Belas, lagi Maha Mengasihani, terhadap kamu."
  },
  {
    "surah": 57,
    "ayat": 10,
    "terjemahan": "Dan mengapa kamu tidak membelanjakan harta benda kamu pada jalan Allah? - Padahal Allah jualah yang mewarisi langit dan bumi (serta segala isinya). Tidaklah sama di antara kamu, orang-orang yang membelanjakan hartanya serta turut berperang sebelum kemenangan (Nabi menguasai Makkah). Mereka itu lebih besar darjatnya daripada orang-orang yang membelanjakan hartanya serta turut berperang sesudah itu. Dan tiap-tiap satu puak dari keduanya, Allah janjikan (balasan) yang sebaik-baiknya. Dan (ingatlah), Allah Maha Mendalam PengetahuanNya akan apa yang kamu kerjakan."
  },
  {
    "surah": 57,
    "ayat": 11,
    "terjemahan": "Siapakah orangnya yang mahu memberikan pinjaman kepada Allah, sebagai pinjaman yang baik (ikhlas) supaya Allah melipat-gandakan balasannya? Dan (selain itu) ia akan beroleh pahala yang besar!"
  },
  {
    "surah": 57,
    "ayat": 12,
    "terjemahan": "(Ingatlah) ketika engkau melihat (pada hari kiamat): orang-orang yang beriman, lelaki dan perempuan, cahaya (iman dan amal soleh) mereka bergerak cepat di hadapan mereka dan di sebelah kanan mereka (semasa mereka berjalan, serta dikatakan kepada mereka): \"Berita yang mengembirakan kamu pada hari ini, (kamu akan beroleh) Syurga yang mengalir di bawahnya beberapa sungai, kekal kamu di dalamnya; yang demikian itu adalah kemenangan yang besar\"."
  },
  {
    "surah": 57,
    "ayat": 13,
    "terjemahan": "(Ingatlah) semasa orang-orang munafik, lelaki dan perempuan (yang sedang meraba-raba dalam gelap-gelita pada hari kiamat), berkata kepada orang-orang yang beriman: \"Tunggulah kami, biarlah kami mengambil sedikit dari cahaya kamu\". (Lalu) dikatakan (kepada mereka secara mengejek-ejek): \"Baliklah kamu ke belakang, kemudian carilah cahaya (di sana)\", serta diadakanlah di antara mereka (yang beriman dan yang munafik itu) sebuah tembok yang mempunyai pintu, di sebelah dalamnya mengandungi rahmat (Syurga dan nikmat), dan di sebelah luarnya, dari situ terdapat (neraka) dan azab seksa."
  },
  {
    "surah": 57,
    "ayat": 14,
    "terjemahan": "(Pada saat itu) mereka (yang munafik) menyeru orang-orang yang beriman (sambil berkata): \"Bukankah kami bercampur gaul dengan kamu (di dunia dahulu)?\" Orang-orang yang beriman menjawab: \"Benar! Akan tetapi kamu telah membinasakan diri kamu (dengan perbuatan munafik) dan kamu telah menunggu-nunggu (kebinasaan umat Islam), dan kamu pula ragu-ragu (terhadap perkara-perkara ugama) serta kamu diperdayakan oleh angan-angan kosong (untuk mencapai maksud kamu), sehinggalah datangnya (maut) yang ditetapkan oleh Allah (kepada kamu). Dan (selain itu), kamu pula diperdayakan oleh bisikan Syaitan dengan (pengampunan) Allah (semata-mata dan melupakan azabNya)."
  },
  {
    "surah": 57,
    "ayat": 15,
    "terjemahan": "\"Oleh itu, pada hari ini tidak diterima penebus diri dari kamu, dan tidak juga dari orang-orang kafir. Tempat tinggal kamu ialah neraka, nerakalah sahaja penolong kamu, dan itulah seburuk-buruk tempat kesudahan kamu!\""
  },
  {
    "surah": 57,
    "ayat": 16,
    "terjemahan": "Belum sampaikah lagi masanya bagi orang-orang yang beriman, untuk khusyuk hati mereka mematuhi peringatan dan pengajaran Allah serta mematuhi kebenaran (Al-Quran) yang diturunkan (kepada mereka)? Dan janganlah pula mereka menjadi seperti orang-orang yang telah diberikan Kitab sebelum mereka, setelah orang-orang itu melalui masa yang lanjut maka hati mereka menjadi keras, dan banyak di antaranya orang-orang yang fasik - derhaka."
  },
  {
    "surah": 57,
    "ayat": 17,
    "terjemahan": "Ketahuilah kamu, bahawa Allah menghidupkan bumi sesudah matinya; sesungguhnya Kami telah menjelaskan kepada kamu keterangan-keterangan dan bukti, supaya kamu memahaminya."
  },
  {
    "surah": 57,
    "ayat": 18,
    "terjemahan": "Sesungguhnya orang-orang lelaki yang bersedekah dan orang-orang perempuan yang bersedekah, serta mereka memberikan pinjaman kepada Allah, sebagai pinjaman yang baik (ikhlas), akan digandakan balasannya (dengan berganda-ganda banyaknya), dan mereka pula akan beroleh pahala yang mulia."
  },
  {
    "surah": 57,
    "ayat": 19,
    "terjemahan": "Dan orang-orang yang beriman kepada Allah dan Rasul-rasulNya, merekalah pada sisi (hukum) Tuhan mereka, (orang-orang yang mempunyai kedudukan yang tinggi darjatnya) seperti orang-orang \"Siddiqiin\" dan orang-orang yang mati Syahid; mereka akan beroleh pahala dan cahaya orang-orang Siddiqiin dan orang-orang yang mati syahid itu; dan (sebaliknya) orang yang kufur ingkar serta mendustakan ayat-ayat keterangan Kami, merekalah ahli neraka."
  },
  {
    "surah": 57,
    "ayat": 20,
    "terjemahan": "Ketahuilah bahawa (yang dikatakan) kehidupan dunia itu tidak lain hanyalah (bawaan hidup yang berupa semata-mata) permainan dan hiburan (yang melalaikan) serta perhiasan (yang mengurang), juga (bawaan hidup yang bertujuan) bermegah-megah di antara kamu (dengan kelebihan, kekuatan, dan bangsa keturunan) serta berlumba-lumba membanyakkan harta benda dan anak pinak; (semuanya itu terhad waktunya) samalah seperti hujan yang (menumbuhkan tanaman yang menghijau subur) menjadikan penanamnya suka dan tertarik hati kepada kesuburannya, kemudian tanaman itu bergerak segar (ke suatu masa yang tertentu), selepas itu engkau melihatnya berupa kuning; akhirnya ia menjadi hancur bersepai; dan (hendaklah diketahui lagi, bahawa) di akhirat ada azab yang berat (di sediakan bagi golongan yang hanya mengutamakan kehidupan dunia itu), dan (ada pula) keampunan besar serta keredaan dari Allah (disediakan bagi orang-orang yang mengutamakan akhirat). Dan (ingatlah, bahawa) kehidupan dunia ini tidak lain hanyalah kesenangan bagi orang-orang yang terpedaya."
  },
  {
    "surah": 57,
    "ayat": 21,
    "terjemahan": "Berlumba-lumbalah kamu (mengerjakan amal-amal yang baik) untuk mendapat keampunan dari Tuhan kamu, dan mendapat Syurga yang bidangnya seluas segala langit dan bumi, yang disediakan bagi orang-orang yang beriman kepada Allah dan Rasul-rasulNya; yang demikian ialah limpah kurnia Allah, diberikanNya kepada sesiapa yang dikehendakiNya; dan Allah sememangnya mempunyai limpah kurnia yang besar."
  },
  {
    "surah": 57,
    "ayat": 22,
    "terjemahan": "Tidak ada sesuatu kesusahan (atau bala bencana) yang ditimpakan di bumi, dan tidak juga yang menimpa diri kamu, melainkan telah sedia ada di dalam Kitab (pengetahuan Kami) sebelum Kami menjadikannya; sesungguhnya mengadakan yang demikian itu adalah mudah bagi Allah."
  },
  {
    "surah": 57,
    "ayat": 23,
    "terjemahan": "(Kamu diberitahu tentang itu) supaya kamu tidak bersedih hati akan apa yang telah luput daripada kamu, dan tidak pula bergembira (secara sombong dan bangga) dengan apa yang diberikan kepada kamu. Dan (ingatlah), Allah tidak suka kepada tiap-tiap orang yang sombong takbur, lagi membanggakan diri."
  },
  {
    "surah": 57,
    "ayat": 24,
    "terjemahan": "Orang-orang yang bakhil dan menyuruh manusia supaya berlaku bakhil, (akan mendapat balasan yang menghina); dan sesiapa yang berpaling (dari mematuhi hukum Allah maka padahnya tertimpa atas dirinya sendiri), kerana sesungguhnya Allah, Dia lah Yang Maha Kaya, lagi Maha Terpuji."
  },
  {
    "surah": 57,
    "ayat": 25,
    "terjemahan": "Demi sesungguhnya! Kami telah mengutus Rasul-rasul Kami dengan membawa bukti-bukti dan mukjizat yang jelas nyata, dan Kami telah menurunkan bersama-sama mereka Kitab Suci dan keterangan yang menjadi neraca keadilan, supaya manusia dapat menjalankan keadilan dan kami telah menciptakan besi dengan keadaannya mengandungi kekuatan yang handal serta berbagai faedah lagi bagi manusia. (Dijadikan besi dengan keadaan yang demikian, supaya manusia menggunakan faedah-faedah itu dalam kehidupan mereka sehari-hari) dan supaya ternyata pengetahuan Allah tentang orang yang (menggunakan kekuatan handalnya itu untuk) menegak dan mempertahankan ugama Allah serta menolong Rasul-rasulNya, padahal balasan baiknya tidak kelihatan (kepadanya); sesungguhnya Allah Maha Kuat, lagi Maha Kuasa."
  },
  {
    "surah": 57,
    "ayat": 26,
    "terjemahan": "Dan demi sesungguhnya! Kami telah mengutus Nabi Nuh dan Nabi Ibrahim, dan Kami jadikan pada keturunan keduanya orang-orang yang berpangkat Nabi dan menerima Kitab-kitab ugama; maka sebahagian di antara mereka: orang yang beroleh hidayah petunjuk, dan kebanyakan mereka orang-orang yang fasik - derhaka"
  },
  {
    "surah": 57,
    "ayat": 27,
    "terjemahan": "Kemudian Kami iringi sesudah - mereka: Rasul-rasul Kami silih berganti, dan Kami iringi lagi dengan Nabi Isa ibni Maryam, serta Kami berikan kepadanya: Kitab Injil; dan Kami jadikan dalam hati orang-orang yang mengikutnya perasaan belas kasihan (sesama sendiri). Dan (perbuatan mereka beribadat secara) \"Rahbaniyyah\" - merekalah sahaja yang mengadakan dan merekanya; Kami tidak mewajibkannya atas mereka; (mereka berbuat demikian) kerana mencari keredaan Allah; dalam pada itu mereka tidak menjaga dan memeliharanya menurut yang sewajibnya. Oleh itu, orang-orang yang beriman (kepada Nabi Muhammad) di antara mereka, kami berikan pahalanya, dan (sebaliknya) banyak di antara mereka yang fasik - derhaka."
  },
  {
    "surah": 57,
    "ayat": 28,
    "terjemahan": "Wahai orang-orang yang beriman! Bertaqwalah kamu kepada Allah dan tetaplah beriman kepada RasulNya (Muhammad), supaya Allah memberi kepada kamu dua bahagian dari rahmatNya, dan menjadikan bagi kamu cahaya untuk kamu berjalan dengannya (pada hari kiamat kelak), serta diampunkannya dosa kamu; dan (ingatlah), Allah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 57,
    "ayat": 29,
    "terjemahan": "(Ditetapkan pemberian yang demikian kepada kamu) supaya golongan ahli Kitab (Yahudi dan Nasrani - yang menentang Islam) mengetahui, bahawa sesungguhnya mereka tidak mempunyai sebarang kuasa untuk mendapat (atau menyekat) sesuatu dari limpah kurnia Allah, dan bahawa sesungguhnya limpah kurnia itu terletak dalam kekuasaan Allah, diberikanNya kepada sesiapa yang dikehendakiNya. Dan (ingatlah), Allah jualah yang mempunyai limpah kurnia yang besar."
  },
  {
    "surah": 58,
    "ayat": 1,
    "terjemahan": "Sesungguhnya Allah telah mendengar (dan memperkenan) aduan perempuan yang bersoal jawab denganmu (wahai Muhammad) mengenai suaminya, sambil ia berdoa merayu kepada Allah (mengenai perkara yang menyusahkannya), sedang Allah sedia mendengar perbincangan kamu berdua. Sesungguhnya Allah Maha Mendengar, lagi Maha Melihat."
  },
  {
    "surah": 58,
    "ayat": 2,
    "terjemahan": "Orang-orang yang \"ziharkan\" isterinya dari kalangan kamu (adalah orang-orang yang bersalah, kerana) isteri-isteri mereka bukanlah ibu-ibu mereka. Ibu-ibu mereka tidak lain hanyalah perempuan-perempuan yang melahirkan mereka. Dan sesungguhnya mereka (dengan melakukan yang demikian) memperkatakan suatu perkara yang mungkar dan dusta. Dan (ingatlah), sesungguhnya Allah Maha Pemaaf, lagi Maha Pengampun."
  },
  {
    "surah": 58,
    "ayat": 3,
    "terjemahan": "Dan orang-orang yang \"ziharkan\" isterinya, kemudian mereka berbalik dari apa yang mereka ucapkan (bahawa isterinya itu haram kepadanya), maka hendaklah (suami itu) memerdekakan seorang hamba sebelum mereka berdua (suami isteri) bercampur. Dengan hukum yang demikian, kamu diberi pengajaran (supaya jangan mendekati perkara yang mungkar itu). Dan (ingatlah), Allah Maha Mendalam PengetahuanNya akan apa yang kamu lakukan."
  },
  {
    "surah": 58,
    "ayat": 4,
    "terjemahan": "Kemudian, sesiapa yang tidak dapat (memerdekakan hamba), maka hendaklah ia berpuasa dua bulan berturut-turut sebelum mereka (suami isteri) itu bercampur. Akhirnya sesiapa yang tidak sanggup berpuasa, maka hendaklah ia memberi makan enam puluh orang miskin. Ditetapkan hukum itu untuk membuktikan iman kamu kepada Allah dan RasulNya (dengan mematuhi perintahNya serta menjauhi adat Jahiliyah). Dan itulah batas-batas hukum Allah; dan bagi orang-orang yang kafir disediakan azab seksa yang tidak terperi sakitnya."
  },
  {
    "surah": 58,
    "ayat": 5,
    "terjemahan": "Sesungguhnya orang-orang yang menentang (perintah) Allah dan RasulNya, mereka tetap ditimpa kehinaan sebagaimana orang-orang yang terdahulu dari mereka ditimpa kehinaan; kerana sesungguhnya Kami telah menurunkan keterangan-keterangan yang jelas nyata. Dan bagi orang-orang yang kafir disediakan azab seksa yang menghina,"
  },
  {
    "surah": 58,
    "ayat": 6,
    "terjemahan": "Semasa mereka semuanya dibangkitkan hidup semula oleh Allah (pada hari kiamat), lalu diterangkan kepada mereka segala yang mereka telah kerjakan. Allah telah menghitung amal-amal mereka itu satu persatu, sedang mereka telah melupakannya. Dan (ingatlah), Allah menjadi Saksi akan tiap-tiap sesuatu."
  },
  {
    "surah": 58,
    "ayat": 7,
    "terjemahan": "Tidakkah engkau memikirkan, bahawa sesungguhnya Allah mengetahui segala yang ada di langit dan yang ada di bumi? Tiada berlaku bisikan antara tiga orang melainkan Dia lah yang keempatnya, dan tiada (berlaku antara) lima orang melainkan Dia lah yang keenamnya, dan tiada yang kurang dari bilangan itu dan tiada yang lebih ramai, melainkan Ia ada bersama-sama mereka di mana sahaja mereka berada. Kemudian Ia akan memberi tahu kepada mereka - pada hari kiamat - apa yang mereka telah kerjakan. Sesungguhnya Allah Maha Mengetahui akan tiap-tiap sesuatu."
  },
  {
    "surah": 58,
    "ayat": 8,
    "terjemahan": "Tidakkah engkau memerhatikan (wahai Muhammad) akan orang-orang (Yahudi) yang telah dilarang daripada perbuatan berbisik-bisik, kemudian mereka berbalik melakukan perbuatan yang telah dilarang itu serta mereka berbisik-bisik berkenaan dengan melakukan dosa dan pencerobohan serta kederhakaan kepada Rasulullah? Dan lagi apabila mereka datang kepadamu, mereka memberi salam hormat bukan dengan lafaz salam hormat yang diberikan Allah kepadamu; dan mereka berkata sesama sendiri: \"(Kalau benar Muhammad utusan Tuhan, maka) sepatutnya kami diseksa oleh Allah disebabkan (kata-kata buruk) yang kami ucapkan itu?\" Cukuplah untuk mereka neraka Jahannam, yang mereka akan dibakar di dalamnya; maka itulah seburuk-buruk tempat kembali."
  },
  {
    "surah": 58,
    "ayat": 9,
    "terjemahan": "Wahai orang-orang yang beriman! Apabila kamu berbisik-bisik sesama sendiri, maka janganlah kamu berbisik-bisik untuk melakukan dosa dan pencerobohan serta perbuatan derhaka kepada Rasulullah; dan (sebaliknya) berbisiklah untuk berbuat kebajikan dan bertaqwa. Dan hendaklah kamu tetap bertaqwa kepada Allah yang kepadaNya kamu semua akan dihimpunkan (pada hari kiamat untuk dihitung amal kamu dan menerima balasan)."
  },
  {
    "surah": 58,
    "ayat": 10,
    "terjemahan": "Sesungguhnya perbuatan berbisik (dengan kejahatan) itu adalah dari (hasutan) Syaitan, untuk menjadikan orang-orang yang beriman berdukacita; sedang bisikan itu tidak akan dapat membahayakan mereka sedikitpun melainkan dengan izin Allah; dan kepada Allah jualah hendaknya orang-orang yang beriman berserah diri."
  },
  {
    "surah": 58,
    "ayat": 11,
    "terjemahan": "Wahai orang-orang yang beriman! Apabila diminta kepada kamu memberi lapang dari tempat duduk kamu (untuk orang lain) maka lapangkanlah seboleh-bolehnya supaya Allah melapangkan (segala halnya) untuk kamu. Dan apabila diminta kamu bangun maka bangunlah, supaya Allah meninggikan darjat orang-orang yang beriman di antara kamu, dan orang-orang yang diberi ilmu pengetahuan ugama (dari kalangan kamu) - beberapa darjat. Dan (ingatlah), Allah Maha Mendalam PengetahuanNya tentang apa yang kamu lakukan."
  },
  {
    "surah": 58,
    "ayat": 12,
    "terjemahan": "Wahai orang-orang yang beriman! Apabila kamu hendak mengadap dan bertanyakan sesuatu kepada Rasulullah, maka hendaklah kamu bersedekah (kepada fakir miskin) sebelum kamu mengadapnya; (pemberian sedekah) itu adalah lebih baik bagi kamu dan lebih bersih. Dalam pada itu, kalau kamu tidak ada benda yang hendak disedekahkan, (kamu dibenarkan juga mengadapnya mengenai perkara yang tak dapat dielak), kerana sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 58,
    "ayat": 13,
    "terjemahan": "Adakah kamu takut (akan kemiskinan) kerana kerap kali kamu memberi sedekah sebelum kamu mengadap? Kalau kamu tidak melakukan (perintah) itu, dan Allah pun memaafkan kamu (kerana kamu tidak mampu), maka dirikanlah sembahyang dan berikanlah zakat (sebagaimana yang sewajibnya), serta taatlah kamu kepada Allah dan RasulNya. Dan (ingatlah), Allah Maha Mendalam PengetahuanNya akan segala amalan yang kamu lakukan."
  },
  {
    "surah": 58,
    "ayat": 14,
    "terjemahan": "Tidakkah engkau melihat (bagaimana jahatnya) orang-orang yang bersahabat karib dengan kaum yang telah dimurkai Allah (dengan sebab kekufuran dan khianatnya)? Mereka itu bukanlah dari golongan kamu dan bukan pula dari golongan kaum yang tersebut itu (kerana mereka ialah golongan munafik); dan lagi mereka selalu bersumpah dengan dusta, sedang mereka mengetahui (bahawa mereka adalah berdusta)."
  },
  {
    "surah": 58,
    "ayat": 15,
    "terjemahan": "Allah telah menyediakan bagi mereka azab seksa yang berat; sesungguhnya amatlah buruk apa yang mereka telah lakukan."
  },
  {
    "surah": 58,
    "ayat": 16,
    "terjemahan": "Mereka menjadikan sumpahnya sebagai perisai (untuk menyelamatkan diri dan harta bendanya daripada dirampas atau dibunuh), maka dengan yang demikian dapatlah mereka menghalang (dirinya dan orang lain) dari jalan Allah; oleh itu mereka beroleh azab seksa yang menghina."
  },
  {
    "surah": 58,
    "ayat": 17,
    "terjemahan": "harta benda mereka dan anak pinak mereka tidak sekali-kali akan dapat memberikan sebarang pertolongan kepada mereka dari azab Allah. Merekalah ahli neraka, mereka tetap kekal di dalamnya."
  },
  {
    "surah": 58,
    "ayat": 18,
    "terjemahan": "(Setelah nyata kepada orang-orang munafik itu bahawa harta benda dan anak pinaknya tidak dapat memberikan pertolongan), ketika mereka semuanya dibangkitkan oleh Allah (pada hari kiamat), maka mereka bersumpah kepadaNya (bahawa mereka adalah orang-orang mukmin) sebagaimana biasanya mereka bersumpah kepada kamu; dan mereka menyangka bahawa (dengan berbuat demikian) mereka akan mendapat sesuatu (yang berfaedah kepada mereka). Ketahuilah! Bahawa sesungguhnya merekalah golongan pendusta."
  },
  {
    "surah": 58,
    "ayat": 19,
    "terjemahan": "Syaitan telah menguasai dan mempengaruhi mereka, sehingga menyebabkan mereka lupa mengingati (ajaran dan amaran) Allah; mereka itulah puak Syaitan. Ketahuilah! Bahawa puak Syaitan itu sebenarnya orang-orang yang rugi."
  },
  {
    "surah": 58,
    "ayat": 20,
    "terjemahan": "Sesungguhnya orang-orang yang menentang (perintah) Allah dan RasulNya, mereka termasuk dalam golongan yang amat hina."
  },
  {
    "surah": 58,
    "ayat": 21,
    "terjemahan": "Allah telah menetapkan: \"Sesungguhnya Aku dan Rasul-rasulKu tetap mengalahkan (golongan yang menentang) \". Sesungguhnya Allah Maha Kuat, lagi Maha kuasa."
  },
  {
    "surah": 58,
    "ayat": 22,
    "terjemahan": "Engkau tidak akan dapati sesuatu kaum yang beriman kepada Allah dan hari akhirat, tergamak berkasih-mesra dengan orang-orang yang menentang (perintah) Allah dan RasulNya, sekalipun orang-orang yang menentang itu ialah bapa-bapa mereka, atau anak-anak mereka, atau saudara-saudara mereka, ataupun keluarga mereka. Mereka (yang setia) itu, Allah telah menetapkan iman dalam hati mereka, dan telah menguatkan mereka dengan semangat pertolongan daripadaNya; dan Dia akan memasukkan mereka ke dalam Syurga yang mengalir di bawahnya beberapa sungai, mereka tetap kekal di dalamnya. Allah reda akan mereka dan mereka reda (serta bersyukur) akan nikmat pemberianNya. Merekalah penyokong-penyokong (ugama) Allah. Ketahuilah! Sesungguhnya penyokong-penyokong (ugama) Allah itu ialah orang-orang yang berjaya."
  },
  {
    "surah": 59,
    "ayat": 1,
    "terjemahan": "Segala yang ada di langit dan di bumi tetap mengucap tasbih kepada Allah; dan Dia lah Yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 59,
    "ayat": 2,
    "terjemahan": "Dia lah yang telah mengeluarkan orang-orang kafir di antara Ahli Kitab - dari kampung halaman mereka pada julung-julung kali mereka berhimpun hendak memerangi Rasulullah. Kamu (wahai umat Islam) tidak menyangka bahawa mereka akan keluar (disebabkan bilangannya yang ramai dan pertahanannya yang kuat), dan mereka pula menyangka bahawa benteng-benteng mereka akan dapat menahan serta memberi perlindungan kepada mereka (dari azab) Allah. Maka Allah menimpakan (azabNya) kepada mereka dari arah yang tidak terlintas dalam fikiran mereka, serta dilemparkanNya perasaan cemas takut ke dalam hati mereka, (lalu) mereka membinasakan rumah-rumah mereka dengan tangan mereka sendiri (dari dalam) sambil tangan orang-orang yang beriman (yang mengepung mereka berbuat demikian dari luar). Maka insaflah dan ambilah pelajaran (dari peristiwa itu) wahai orang-orang yang berakal fikiran serta celik mata hatinya."
  },
  {
    "surah": 59,
    "ayat": 3,
    "terjemahan": "Dan kalaulah tidak kerana Allah telah menetapkan pengusiran (yang demikian buruknya) terhadap mereka, tentulah Ia akan menyeksa mereka di dunia; dan mereka pula akan beroleh azab seksa neraka pada hari akhirat kelak."
  },
  {
    "surah": 59,
    "ayat": 4,
    "terjemahan": "(Mereka ditimpakan azab) yang demikian, kerana mereka mereka menentang (perintah) Allah dan RasulNya. Dan (ingatlah), sesiapa yang menentang (perintah) Allah, maka sesungguhnya Allah amatlah berat azab seksaNya."
  },
  {
    "surah": 59,
    "ayat": 5,
    "terjemahan": "Mana-mana jua pohon kurma (kepunyaan musuh) yang kamu tebang atau kamu biarkan tegak berdiri seperti keadaannya yang asal, maka yang demikian adalah dengan izin Allah (kerana Ia hendak memberi kemenangan kepada orang-orang mukmin), dan kerana Ia hendak menimpakan kehinaan kepada orang-orang yang fasik."
  },
  {
    "surah": 59,
    "ayat": 6,
    "terjemahan": "Dan apajua yang Allah kurniakan kepada RasulNya dari peninggalan harta benda mereka (yang telah diusir itu, maka kamu tidak berhak mendapatnya), kerana kamu tidak memecut seekor kuda pun dan tidak menunggang seekor unta pun (untuk berperang mengalahkan mereka); tetapi Allah memberikan kekuasaan kepada Rasul-rasulNya mengalahkan sesiapa yang dikehendakiNya (dengan tidak payah berperang); dan Allah Maha Kuasa atas tiap-tiap sesuatu."
  },
  {
    "surah": 59,
    "ayat": 7,
    "terjemahan": "Apa yang Allah kurniakan kepada RasulNya (Muhammad) dari harta penduduk negeri, bandar atau desa dengan tidak berperang, maka adalah ia tertentu bagi Allah, dan bagi Rasulullah, dan bagi kaum kerabat (Rasulullah), dan anak-anak yatim, dan orang-orang miskin, serta orang-orang musafir (yang keputusan). (Ketetapan yang demikian) supaya harta itu tidak hanya beredar di antara orang-orang kaya dari kalangan kamu. Dan apa jua perintah yang dibawa oleh Rasulullah (s.a.w) kepada kamu maka terimalah serta amalkan, dan apa jua yang dilarangNya kamu melakukannya maka patuhilah laranganNya. Dan bertaqwalah kamu kepada Allah; sesungguhnya Allah amatlah berat azab seksaNya (bagi orang-orang yang melanggar perintahNya)."
  },
  {
    "surah": 59,
    "ayat": 8,
    "terjemahan": "(Pemberian itu hendaklah diuntukkan) kepada orang-orang fakir yang berhijrah, yang telah diusir keluar dari kampung halamannya dan harta bendanya (kerana berpegang teguh kepada ajaran Islam), untuk mencari limpah kurnia dari Allah dan keredaanNya, serta menolong (ugama) Allah dan RasulNya; mereka itulah orang-orang yang benar (imannya dan amalnya)."
  },
  {
    "surah": 59,
    "ayat": 9,
    "terjemahan": "Dan orang-orang (Ansar) yang mendiami negeri (Madinah) serta beriman sebelum mereka, mengasihi orang-orang yang berhijrah ke negeri mereka, dan tidak ada pula dalam hati mereka perasaan berhajatkan apa yang telah diberi kepada orang-orang yang berhijrah itu; dan mereka juga mengutamakan orang-orang yang berhijrah itu lebih daripada diri mereka sendiri, sekalipun mereka dalam keadaan kekurangan dan amat berhajat. Dan (ingatlah), sesiapa yang menjaga serta memelihara dirinya daripada dipengaruhi oleh tabiat bakhilnya, maka merekalah orang-orang yang berjaya."
  },
  {
    "surah": 59,
    "ayat": 10,
    "terjemahan": "Dan orang-orang (Islam) yang datang kemudian daripada mereka (berdoa dengan) berkata: \"Wahai Tuhan Kami! Ampunkanlah dosa kami dan dosa saudara-saudara kami yang mendahului kami dalam iman, dan janganlah Engkau jadikan dalam hati perasaan hasad dengki dan dendam terhadap orang-orang yang beriman. Wahai Tuhan kami! Sesungguhnya Engkau Amat Melimpah Belas kasihan dan RahmatMu\"."
  },
  {
    "surah": 59,
    "ayat": 11,
    "terjemahan": "Tidakkah engkau melihat dan merasa hairan (wahai Muhammad) terhadap sikap orang-orang munafik itu? Mereka tergamak berkata kepada saudara-saudara mereka yang kafir dari kalangan (kaum Yahudi) ahli Kitab: \"Sesungguhnya, kalau kamu dihalau keluar sudah tentu kami akan keluar bersama-sama kamu, dan kami tidak akan tunduk taat kepada sesiapapun untuk menentang kamu selama-lamanya; dan kalau kamu diperangi, sudah tentu kami akan membela kamu!\" Padahal Allah mengetahui dan menyaksikan bahawa sebenarnya mereka adalah pendusta."
  },
  {
    "surah": 59,
    "ayat": 12,
    "terjemahan": "Demi sesungguhnya! Jika orang-orang (Yahudi) itu dihalau keluar (dari Madinah), mereka (yang munafik) ini tidak akan keluar bersama-samanya; dan demi sesungguhnya, jika orang-orang (Yahudi) itu diperangi, mereka (yang munafik) ini tidak akan membelanya; dan demi sesungguhnya, jika ditakdirkan mereka membelanya sekalipun, sudah tentu mereka (semuanya - Yahudi dan munafik) akan melarikan diri; kemudian mereka tidak akan mendapat pertolongan, -"
  },
  {
    "surah": 59,
    "ayat": 13,
    "terjemahan": "(Kerana) sesungguhnya kamu - dalam hati mereka, - sangat ditakuti lebih dari Allah; yang demikian itu, kerana mereka ialah kaum yang tidak mengerti (akan kekuasaan Allah dan kebesaranNya)."
  },
  {
    "surah": 59,
    "ayat": 14,
    "terjemahan": "(Orang-orang Yahudi dan orang-orang munafik) dengan keadaan bersatu padu sekalipun, tidak berani memerangi kamu melainkan di kampung-kampung yang berbenteng kukuh, atau dari sebalik tembok. (Sebabnya): permusuhan di antara mereka sesama sendiri amatlah keras; engkau menyangka mereka bersatu padu, sedang hati mereka berpecah belah (disebabkan berlainan kepercayaan mereka). Yang demikian itu, kerana mereka adalah kaum yang tidak memahami (perkara yang sebenarnya yang memberi kebaikan kepada mereka)."
  },
  {
    "surah": 59,
    "ayat": 15,
    "terjemahan": "(Keadaan kaum Yahudi itu) samalah seperti orang-orang (dari suku Yahudi) yang terdahulu sedikit dari mereka, yang telah merasai akibat yang buruk (di dunia) dengan sebab bawaan kufur mereka; dan mereka pula akan beroleh azab seksa yang tidak terperi sakitnya (pada hari akhirat kelak)."
  },
  {
    "surah": 59,
    "ayat": 16,
    "terjemahan": "(Sikap kaum munafik dengan kaum Yahudi) itu samalah seperti (sikap) Syaitan ketika ia berkata kepada manusia: \"Berlaku kufurlah engkau!\" Setelah orang itu berlaku kufur (dan tetap terkena azab), berkatalah Syaitan kepadanya: \"Sesungguhnya aku adalah berlepas diri daripadamu, kerana sebenarnya aku takut kepada Allah, Tuhan yang menguasai seluruh alam!\""
  },
  {
    "surah": 59,
    "ayat": 17,
    "terjemahan": "Maka kesudahan keduanya, bahawa mereka ditempatkan di dalam neraka, kekal mereka di dalamnya. Dan yang demikian itulah balasan makhluk-makhluk yang zalim."
  },
  {
    "surah": 59,
    "ayat": 18,
    "terjemahan": "Wahai orang-orang yang beriman! Bertaqwalah kepada Allah (dengan mengerjakan suruhanNya dan meninggalkan laranganNya); dan hendaklah tiap-tiap diri melihat dan memerhatikan apa yang ia telah sediakan (dari amal-amalnya) untuk hari esok (hari akhirat). Dan (sekali lagi diingatkan): Bertaqwalah kepada Allah, sesungguhnya Allah Amat Meliputi PengetahuanNya akan segala yang kamu kerjakan."
  },
  {
    "surah": 59,
    "ayat": 19,
    "terjemahan": "Dan janganlah kamu menjadi seperti orang-orang yang telah melupakan (perintah-perintah) Allah, lalu Allah menjadikan mereka melupakan (amal-amal yang baik untuk menyelamatkan) diri mereka. Mereka itulah orang-orang yang fasik - derhaka."
  },
  {
    "surah": 59,
    "ayat": 20,
    "terjemahan": "Tidaklah sama ahli neraka dan ahli Syurga; ahli Syurgalah orang-orang yang beroleh kemenangan (mendapat segala yang diingini)."
  },
  {
    "surah": 59,
    "ayat": 21,
    "terjemahan": "Sekiranya Kami turunkan Al-Quran ini ke atas sebuah gunung, nescaya engkau melihat gunung itu khusyuk serta pecah belah kerana takut kepada Allah. Dan (ingatlah), misal-misal perbandingan ini Kami kemukakan kepada umat manusia, supaya mereka memikirkannya."
  },
  {
    "surah": 59,
    "ayat": 22,
    "terjemahan": "Dia lah Allah, yang tidak ada Tuhan melainkan Dia; Yang Mengetahui perkara yang ghaib dan yang nyata; Dia lah Yang Maha Pemurah, lagi Maha Mengasihani."
  },
  {
    "surah": 59,
    "ayat": 23,
    "terjemahan": "Dia lah Allah, yang tidak ada Tuhan melainkan Dia; Yang Menguasai (sekalian alam); Yang Maha Suci; Yang Maha Selamat Sejahtera (dari segala kekurangan); Yang Maha Melimpahkan Keamanan; Yang Maha Pengawal serta Pengawas; Yang Maha Kuasa; Yang Maha Kuat (menundukkan segala-galanya); Yang Melengkapi segala KebesaranNya. Maha Suci Allah dari segala yang mereka sekutukan denganNya."
  },
  {
    "surah": 59,
    "ayat": 24,
    "terjemahan": "Dia lah Allah, Yang Menciptakan sekalian makhluk; Yang Mengadakan (dari tiada kepada ada); Yang Membentuk rupa (makhluk-makhlukNya menurut yang dikehendakiNya); bagiNyalah nama-nama yang sebaik-baiknya dan semulia-mulianya; bertasbih kepadaNya segala yang ada di langit dan di bumi; dan Dia lah Yang tiada bandingNya, lagi Maha Bijaksana."
  },
  {
    "surah": 60,
    "ayat": 1,
    "terjemahan": "Wahai orang-orang yang beriman! Janganlah kamu mengambil musuhKu dan musuh kamu menjadi teman rapat, dengan cara kamu sampaikan kepada mereka (berita-berita rahsia orang-orang mukmin) dengan sebab hubungan baik dan kasih mesra yang ada di antara kamu dengan mereka, sedang mereka telah kufur ingkar terhadap kebenaran (Islam) yang sampai kepada kamu; mereka pula telah mengeluarkan Rasulullah (s.a.w) dan juga mengeluarkan kamu (dari Tanah Suci Makkah) disebabkan kamu beriman kepada Allah Tuhan kamu. (Janganlah kamu berbuat demikian) jika betul kamu keluar untuk berjihad pada jalanKu dan untuk mencari keredaanKu. (Tidak ada sebarang faedahnya) kamu mengadakan hubungan kasih mesra dengan mereka secara rahsia, sedang Aku amat mengetahui akan apa yang kamu rahsiakan dan apa yang kamu zahirkan. Dan (ingatlah), sesiapa di antara kamu yang melakukan perkara yang demikian, maka sesungguhnya telah sesatlah ia dari jalan yang betul."
  },
  {
    "surah": 60,
    "ayat": 2,
    "terjemahan": "Jika mereka dapat menguasai kamu, nescaya mereka menjadi musuh yang membahayakan kamu, dan mereka akan membebaskan tangan mereka dan lidah mereka terhadap kamu dengan kejahatan, serta mereka suka kalaulah kamu juga menjadi kafir (seperti mereka)."
  },
  {
    "surah": 60,
    "ayat": 3,
    "terjemahan": "Kaum kerabat kamu dan anak-anak kamu (yang tidak menurut kamu beriman) tidak sekali-kali akan mendatangkan sebarang faedah kepada kamu pada hari kiamat; Allah akan memisahkan di antara kamu semua (pada hari itu). Dan (ingatlah), Allah Maha Melihat segala yang kamu kerjakan."
  },
  {
    "surah": 60,
    "ayat": 4,
    "terjemahan": "Sesungguhnya adalah bagi kamu pada bawaan Nabi Ibrahim (a.s) dan pengikut-pengikutnya - contoh ikutan yang baik, semasa mereka berkata kepada kaumnya (yang kufur ingkar): \"Sesungguhnya kami berlepas diri daripada kamu dan daripada apa yang kamu sembah yang lain dari Allah; kami kufur ingkarkan (segala penyembahan) kamu dan (dengan ini) nyatalah perasaan permusuhan dan kebencian di antara kami dengan kamu selama-lamanya, sehingga kamu menyembah Allah semata-mata\", tetapi janganlah dicontohi perkataan Nabi Ibrahim kepada bapanya (katanya): \"Aku akan memohon kepada Tuhanku mengampun dosamu, dan aku tidak berkuasa menahan (azab seksa) dari Allah sedikit juapun daripada menimpamu\". (Berdoalah wahai orang-orang yang beriman sebagaimana Nabi Ibrahim dan pengikut-pengikutnya berdoa ketika mereka memusuhi kaumnya yang kafir, dengan berkata): \"Wahai Tuhan kami! Kepada Engkaulah sahaja kami berserah diri, dan kepada Engkaulah kami rujuk bertaubat, serta kepada Engkaulah jua tempat kembali!"
  },
  {
    "surah": 60,
    "ayat": 5,
    "terjemahan": "\"Wahai Tuhan kami! Janganlah Engkau jadikan pendirian dan keyakinan kami terpesong kerana penindasan orang-orang kafir, dan ampunkanlah dosa kami wahai Tuhan kami; sesungguhnya Engkaulah sahaja Yang Maha Kuasa, lagi Maha Bijaksana\"."
  },
  {
    "surah": 60,
    "ayat": 6,
    "terjemahan": "Demi sesungguhnya! Adalah bagi kamu pada bawaan Nabi Ibrahim dan pengikut-pengikutnya itu contoh ikutan yang baik, iaitu bagi orang yang sentiasa mengharapkan keredaan Allah dan (balasan baik) hari akhirat. Dan sesiapa yang berpaling daripada mencontohi mereka, (maka padahnya akan menimpa dirinya sendiri), kerana sesungguhnya Allah Dia lah Yang Maha Kaya, lagi Maha Terpuji."
  },
  {
    "surah": 60,
    "ayat": 7,
    "terjemahan": "Semoga Allah akan mengadakan perasaan kasih sayang antara kamu dengan orang-orang yang kamu musuhi dari kerabat kamu itu (dengan jalan menjadikan mereka insaf dan memeluk Islam). Dan (ingatlah), Allah Maha Kuasa (atas tiap-tiap sesuatu), dan Allah Maha pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 60,
    "ayat": 8,
    "terjemahan": "Allah tidak melarang kamu daripada berbuat baik dan berlaku adil kepada orang-orang yang tidak memerangi kamu kerana ugama (kamu), dan tidak mengeluarkan kamu dari kampung halaman kamu; sesungguhnya Allah mengasihi orang-orang yang berlaku adil."
  },
  {
    "surah": 60,
    "ayat": 9,
    "terjemahan": "Sesungguhnya Allah hanyalah melarang kamu daripada menjadikan teman rapat orang-orang yang memerangi kamu kerana ugama (kamu), dan mengeluarkan kamu dari kampung halaman kamu, serta membantu (orang lain) untuk mengusir kamu. Dan (ingatlah), sesiapa yang menjadikan mereka teman rapat, maka mereka itulah orang-orang yang zalim."
  },
  {
    "surah": 60,
    "ayat": 10,
    "terjemahan": "Wahai orang-orang yang beriman! Apabila orang-orang perempuan yang mengaku beriman datang berhijrah kepada kamu, maka ujilah (iman) mereka: Allah lebih mengetahui akan iman mereka: dengan yang demikian, sekiranya kamu mengetahui bahawa mereka beriman, maka janganlah kamu mengembalikan mereka kepada orang-orang yang kafir. Mereka tidak halal bagi orang-orang kafir itu (sebagai isteri), dan orang-orang kafir itu pula tidak halal bagi mereka (sebagai suami). Dan berilah kepada suami-suami (yang kafir) itu apa yang mereka telah belanjakan. Dan tidaklah menjadi salah kamu berkahwin dengan mereka (perempuan-perempuan yang berhijrah itu) apabila kamu memberi kepada mereka maskahwinnya. Dan janganlah kamu (wahai orang-orang Islam) tetap berpegang kepada akad perkahwinan kamu dengan perempuan-perempuan yang (kekal dalam keadaan) kafir, dan mintalah balik maskahwin yang kamu telah berikan, dan biarkanlah mereka (suami-suami yang kafir itu) meminta balik apa yang mereka telah belanjakan. Demikianlah hukum Allah; Ia hukumkan di antara kamu (dengan adil). Dan (ingatlah), Allah Maha Mengetahui, lagi Maha Bijaksana."
  },
  {
    "surah": 60,
    "ayat": 11,
    "terjemahan": "Dan sekiranya kamu tidak dapat menerima balik sesuatu dari maskahwin isteri-isteri kamu (yang menjadi murtad serta) melarikan diri ke pihak orang-orang kafir, kemudian kamu menyerang puak yang kafir itu serta mendapat harta rampasan maka berikanlah kepada orang-orang (Islam) yang lari isterinya itu ganti maskahwinnya sebanyak yang mereka telah bayar. Dan bertaqwalah kamu kepada Allah yang kamu beriman kepadaNya."
  },
  {
    "surah": 60,
    "ayat": 12,
    "terjemahan": "Wahai Nabi! Apabila orang-orang perempuan yang beriman datang kepadamu untuk memberi pengakuan taat setia, bahawa mereka tidak akan melakukan syirik kepada Allah dengan sesuatu pun, dan mereka tidak akan mencuri, dan mereka tidak akan berzina, dan mereka tidak akan membunuh anak-anaknya, dan mereka tidak akan melakukan sesuatu perkara dusta yang mereka ada-adakan dari kemahuan hati mereka, dan mereka tidak akan menderhaka kepadamu dalam sesuatu perkara yang baik, - maka terimalah pengakuan taat setia mereka dan pohonkanlah kepada Allah mengampuni dosa mereka; sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 60,
    "ayat": 13,
    "terjemahan": "Wahai orang-orang yang beriman! Janganlah kamu jadikan teman rapat mana-mana kaum yang dimurkai Allah, mereka telah berputus asa daripada mendapat kebaikan akhirat, sebagaimana berputus asanya orang-orang kafir yang ada di dalam kubur."
  },
  {
    "surah": 61,
    "ayat": 1,
    "terjemahan": "Segala yang ada di langit dan yang ada di bumi, tetap mengucap tasbih kepada Allah; dan Dia lah Yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 61,
    "ayat": 2,
    "terjemahan": "Wahai orang-orang yang beriman! Mengapa kamu memperkatakan apa yang kamu tidak melakukannya!"
  },
  {
    "surah": 61,
    "ayat": 3,
    "terjemahan": "Amat besar kebenciannya di sisi Allah - kamu memperkatakan sesuatu yang kamu tidak melakukannya."
  },
  {
    "surah": 61,
    "ayat": 4,
    "terjemahan": "Sesungguhnya Allah mengasihi orang-orang yang berperang untuk membela ugamaNya, dalam barisan yang teratur rapi, seolah-olah mereka sebuah bangunan yang tersusun kukuh."
  },
  {
    "surah": 61,
    "ayat": 5,
    "terjemahan": "Dan (ingatlah peristiwa) ketika Nabi Musa berkata kepada kaumnya: \" Wahai kaumku! Mengapa kamu menyakiti daku, sedang kamu mengetahui bahawa sesungguhnya aku ini Pesuruh Allah kepada kamu?\" Maka ketika mereka menyeleweng (dari kebenaran yang mereka sedia mengetahuinya), Allah selewengkan hati mereka (dari mendapat hidayah petunjuk); dan sememangnya Allah tidak memberi hidayah petunjuk kepada kaum yang fasik - derhaka."
  },
  {
    "surah": 61,
    "ayat": 6,
    "terjemahan": "Dan (ingatlah juga peristiwa) ketika Nabi Isa ibni Maryam berkata: \"Wahai Bani Israil, sesungguhnya aku ini Pesuruh Allah kepada kamu, mengesahkan kebenaran Kitab yang diturunkan sebelumku, iaitu Kitab Taurat, dan memberikan berita gembira dengan kedatangan seorang Rasul yang akan datang kemudian daripadaku - bernama: Ahmad\". Maka ketika ia datang kepada mereka membawa keterangan-keterangan yang jelas nyata, mereka berkata: \"Ini ialah sihir yang jelas nyata!\""
  },
  {
    "surah": 61,
    "ayat": 7,
    "terjemahan": "Dan tidak ada yang lebih zalim daripada orang yang mengada-adakan perkara dusta terhadap Allah, sedang ia diajak kepada memeluk Islam; dan (ingatlah), Allah tidak memberi hidayah petunjuk kepada orang-orang yang zalim."
  },
  {
    "surah": 61,
    "ayat": 8,
    "terjemahan": "Mereka sentiasa berusaha hendak memadamkan cahaya Allah (ugama Islam) dengan mulut mereka, sedang Allah tetap menyempurnakan cahayaNya, sekalipun orang-orang kafir tidak suka (akan yang demikian)."
  },
  {
    "surah": 61,
    "ayat": 9,
    "terjemahan": "Dia lah yang telah mengutus RasulNya (Muhammad s.a.w) dengan membawa hidayah petunjuk dan ugama yang benar (ugama Islam), supaya Ia memenangkannya dan meninggikannya atas segala ugama yang lain, walaupun orang-orang musyrik tidak menyukainya."
  },
  {
    "surah": 61,
    "ayat": 10,
    "terjemahan": "Wahai orang-orang yang beriman! Mahukah Aku tunjukkan sesuatu perniagaan yang boleh menyelamatkan kamu dari azab seksa yang tidak terperi sakitnya?"
  },
  {
    "surah": 61,
    "ayat": 11,
    "terjemahan": "Iaitu, kamu beriman kepada Allah dan rasulNya, serta kamu berjuang membela dan menegakkan ugama Allah dengan harta benda dan diri kamu; yang demikian itulah yang lebih baik bagi kamu, jika kamu hendak mengetahui (hakikat yang sebenarnya)."
  },
  {
    "surah": 61,
    "ayat": 12,
    "terjemahan": "(Dengan itu) Allah akan mengampunkan dosa-dosa kamu, dan memasukkan kamu ke dalam taman-taman yang mengalir di bawahnya beberapa sungai, serta ditempatkan kamu di tempat-tempat tinggal yang baik dalam Syurga \" Adn \". Itulah kemenangan yang besar."
  },
  {
    "surah": 61,
    "ayat": 13,
    "terjemahan": "Dan ada lagi limpah kurnia yang kamu sukai, iaitu pertolongan dari Allah dan kemenangan yang cepat (masa berlakunya). Dan sampaikanlah berita yang mengembirakan itu kepada orang-orang yang beriman."
  },
  {
    "surah": 61,
    "ayat": 14,
    "terjemahan": "Wahai orang-orang yang beriman! Jadikanlah diri kamu pembela-pembela (ugama) Allah sebagaimana (keadaan penyokong-penyokong) Nabi Isa ibni Maryam (ketika ia) berkata kepada penyokong-penyokongnya itu: \"Siapakah penolong-penolongku (dalam perjalananku) kepada Allah (dengan menegakkan ugamaNya)?\" Mereka menjawab: \"Kamilah pembela-pembela (ugama) Allah!\" (Setelah Nabi Isa tidak berada di antara mereka) maka sepuak dari kaum Bani Israil beriman, dan sepuak lagi (tetap) kafir. Lalu Kami berikan pertolongan kepada orang-orang yang beriman untuk mengalahkan musuhnya, maka menjadilah mereka orang-orang yang menang."
  },
  {
    "surah": 62,
    "ayat": 1,
    "terjemahan": "Segala yang ada di langit dan yang ada di bumi sentiasa mengucap tasbih kepada Allah Yang Menguasai (sekalian alam), Yang Maha Suci, Yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 62,
    "ayat": 2,
    "terjemahan": "Dia lah yang telah mengutuskan dalam kalangan orang-orang (Arab) yang Ummiyyin, seorang Rasul (Nabi Muhammad s.a.w) dari bangsa mereka sendiri, yang membacakan kepada mereka ayat-ayat Allah (yang membuktikan keesaan Allah dan kekuasaanNya), dan membersihkan mereka (dari iktiqad yang sesat), serta mengajarkan mereka Kitab Allah (Al-Quran) dan Hikmah (pengetahuan yang mendalam mengenai hukum-hukum syarak). Dan sesungguhnya mereka sebelum (kedatangan Nabi Muhammad) itu adalah dalam kesesatan yang nyata."
  },
  {
    "surah": 62,
    "ayat": 3,
    "terjemahan": "Dan juga (telah mengutuskan Nabi Muhammad kepada) orang-orang yang lain dari mereka, yang masih belum (datang lagi dan tetap akan datang) menghubungi mereka; dan (ingatlah), Allah jualah Yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 62,
    "ayat": 4,
    "terjemahan": "(Pengutusan Nabi Muhammad s.a.w, kepada umat manusia seluruhnya) itu (yang menjadi rahmat) adalah limpah kurnia Allah, diberikanNya kepada sesiapa yang dikehendakiNya; dan sememangnya Allah mempunyai limpah kurnia yang besar."
  },
  {
    "surah": 62,
    "ayat": 5,
    "terjemahan": "(Sifat-sifat Nabi Muhammad itu telahpun diterangkan dalam Kitab Taurat tetapi orang-orang Yahudi tidak juga mempercayainya, maka) bandingan orang-orang (Yahudi) yang ditanggungjawab dan ditugaskan (mengetahui dan melaksanakan hukum) Kitab Taurat, kemudian mereka tidak menyempurnakan tanggungjawab dan tugas itu, samalah seperti keldai yang memikul bendela Kitab-kitab besar (sedang ia tidak mengetahui kandungannya). Buruk sungguh bandingan kaum yang mendustakan ayat-ayat keterangan Allah; dan (ingatlah), Allah tidak memberi hidayah petunjuk kepada kaum yang zalim."
  },
  {
    "surah": 62,
    "ayat": 6,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Wahai orang-orang yang berugama Yahudi, kalau kamu anggap bahawa kamulah sahaja orang-orang yang dikasihi Allah tidak termasuk umat-umat manusia yang lain, maka bercita-citalah hendakkan mati (dengan meminta kepada Allah supaya kamu dimatikan sekarang juga), jika betul kamu orang-orang yang benar!\""
  },
  {
    "surah": 62,
    "ayat": 7,
    "terjemahan": "Dan (sudah tentu) mereka tidak akan bercita-cita hendakkan mati itu selama-lamanya, dengan sebab dosa-dosa yang mereka telah lakukan; dan Allah sentiasa mengetahui akan orang-orang yang zalim itu."
  },
  {
    "surah": 62,
    "ayat": 8,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Sebenarnya maut yang kamu melarikan diri daripadanya itu, tetaplah ia akan menemui kamu; kemudian kamu akan dikembalikan kepada Allah yang mengetahui segala yang ghaib dan yang nyata, lalu Ia memberitahu kepada kamu apa yang kamu telah lakukan (serta membalasnya)\"."
  },
  {
    "surah": 62,
    "ayat": 9,
    "terjemahan": "Wahai orang-orang yang beriman! Apabila diserukan azan (bang) untuk mengerjakan sembahyang pada hari Jumaat, maka segeralah kamu pergi (ke masjid) untuk mengingati Allah (dengan mengerjakan sembahyang jumaat) dan tinggalkanlah berjual-beli (pada saat itu); yang demikian adalah baik bagi kamu, jika kamu mengetahui (hakikat yang sebenarnya),"
  },
  {
    "surah": 62,
    "ayat": 10,
    "terjemahan": "Kemudian setelah selesai sembahyang, maka bertebaranlah kamu di muka bumi (untuk menjalankan urusan masing-masing), dan carilah apa yang kamu hajati dari limpah kurnia Allah, serta ingatlah akan Allah banyak-banyak (dalam segala keadaan), supaya kamu berjaya (di dunia dan di akhirat)."
  },
  {
    "surah": 62,
    "ayat": 11,
    "terjemahan": "Dan apabila mereka mengetahui kedatangan barang-barang dagangan (yang baharu tiba) atau (mendengar) sesuatu hiburan, mereka bersurai (lalu pergi) kepadanya dengan meninggalkan engkau berdiri (di atas mimbar - berkhutbah). Katakanlah (wahai Muhammad:\" Pahala - balasan) yang ada di sisi Allah, lebih baik dari hiburan dan barang-barang dagangan itu; dan Allah sebaik-baik pemberi rezeki."
  },
  {
    "surah": 63,
    "ayat": 1,
    "terjemahan": "Apabila orang-orang munafik datang kepadamu (wahai Muhammad), mereka berkata: \"Kami mengakui bahawa sesungguhnya engkau - sebenar-benarnya Rasul Allah\". Dan Allah sememangnya mengetahui bahawa engkau ialah RasulNya, serta Allah menyaksikan bahawa sesungguhnya pengakuan mereka adalah dusta."
  },
  {
    "surah": 63,
    "ayat": 2,
    "terjemahan": "Mereka menjadikan sumpahnya (atau akuannya) sebagai perisai (untuk menyelamatkan dirinya dan harta bendanya daripada dibunuh atau dirampas), lalu mereka menghalang (dirinya dan orang lain) dari menurut jalan Allah. Sesungguhnya amatlah buruk apa yang mereka telah kerjakan."
  },
  {
    "surah": 63,
    "ayat": 3,
    "terjemahan": "(Perbuatan buruk) yang demikian kerana mereka mengaku beriman (di hadapan orang-orang Islam) kemudian mereka tetap kafir sesama sendiri, maka dengan sebab itu dimeteraikan atas hati mereka; lalu mereka tidak dapat memahami (yang mana benar dan yang mana salah)."
  },
  {
    "surah": 63,
    "ayat": 4,
    "terjemahan": "Dan apabila engkau melihat mereka, engkau tertarik hati kepada tubuh badan mereka (dan kelalukannya); dan apabila mereka berkata-kata, engkaujuga (tertarik hati) mendengar tutur katanya (kerana manis dan fasih. Dalam pada itu) mereka adalah seperti batang-batang kayu yang tersandar (tidak terpakai kerana tidak ada padanya kekuatan yang dikehendaki). Mereka (kerana merasai bersalah, sentiasa dalam keadaan cemas sehingga) menyangka tiap-tiap jeritan (atau riuh rendah yang mereka dengar) adalah untuk membahayakan mereka. Mereka itulah musuh yang sebenar-benarnya maka berjaga-jagalah engkau terhadap mereka. Semoga Allah membinasa dan menyingkirkan mereka dari rahmatNya. (Pelik sungguh!) Bagaimana mereka dipalingkan (oleh hawa nafsunya - dari kebenaran)?"
  },
  {
    "surah": 63,
    "ayat": 5,
    "terjemahan": "Dan apabila dikatakan kepada mereka: \" Marilah (bertaubat) supaya Rasulullah meminta ampun (kepada Allah) untuk kamu\", mereka (enggan sambil) menggeleng-gelengkan kepalanya; dan engkau melihat mereka berpaling (dari bertaubat) serta mereka berlaku sombong angkuh."
  },
  {
    "surah": 63,
    "ayat": 6,
    "terjemahan": "(Tidak ada faedahnya) kepada mereka, sama ada engkau meminta ampun untuk mereka atau engkau tidak meminta ampun, Allah tidak sekali-kali akan mengampunkan mereka. Sesungguhnya Allah tidak memberi hidayah petunjuk kepada kaum yang fasik."
  },
  {
    "surah": 63,
    "ayat": 7,
    "terjemahan": "Merekalah yang mengatakan (kepada orang-orang Islam di Madinah yang menolong Rasulullah dan orang-orang Muhajirin): \"Janganlah kamu membelanjakan harta kamu kepada orang-orang yang ada bersama-sama Rasulullah supaya mereka bersurai (meninggalkannya)\". Padahal bagi Allah jualah perbendaharaan langit dan bumi, (tiada sesiapapun yang dapat memberi atau menyekat sebarang pemberian melainkan dengan kehendakNya); akan tetapi orang-orang yang munafik itu tidak memahami (hakikat yang sebenarnya)."
  },
  {
    "surah": 63,
    "ayat": 8,
    "terjemahan": "Mereka berkata lagi: \" Demi sesungguhnya! Jika kita kembali ke Madinah (dari medan perang), sudah tentu orang-orang yang mulia lagi kuat (pihak kita) akan mengusir keluar dari Madinah orang-orang yang hina lagi lemah (pihak Islam)\". Padahal bagi Allah jualah kemuliaan dan kekuatan itu dan bagi RasulNya serta bagi orang-orang yang beriman; akan tetapi golongan yang munafik itu tidak mengetahui (hakikat yang sebenarnya)."
  },
  {
    "surah": 63,
    "ayat": 9,
    "terjemahan": "Wahai orang-orang yang beriman! Janganlah kamu dilalaikan oleh (urusan) harta benda kamu dan anak-pinak kamu daripada mengingati Allah (dengan menjalankan perintahNya). Dan (ingatlah), sesiapa yang melakukan demikian, maka mereka itulah orang-orang yang rugi."
  },
  {
    "surah": 63,
    "ayat": 10,
    "terjemahan": "Dan belanjakanlah (dermakanlah) sebahagian dari rezeki yang Kami berikan kepada kamu sebelum seseorang dari kamu sampai ajal maut kepadanya, (kalau tidak) maka ia (pada saat itu) akan merayu dengan katanya: \" Wahai Tuhanku! Alangkah baiknya kalau Engkau lambatkan kedatangan ajal matiku - ke suatu masa yang sedikit sahaja lagi, supaya aku dapat bersedekah dan dapat pula aku menjadi dari orang-orang yang soleh \"."
  },
  {
    "surah": 63,
    "ayat": 11,
    "terjemahan": "Dan (ingatlah), Allah tidak sekali-kali akan melambatkan kematian seseorang (atau sesuatu yang bernyawa) apabila sampai ajalnya; dan Allah Amat Mendalam PengetahuanNya mengenai segala yang kamu kerjakan."
  },
  {
    "surah": 64,
    "ayat": 1,
    "terjemahan": "Segala yang ada di langit dan yang ada di bumi sentiasa mengucap tasbih kepada Allah; bagiNyalah kuasa pemerintahan, dan bagiNyalah segala pujian; dan Ia Maha Kuasa atas tiap-tiap sesuatu."
  },
  {
    "surah": 64,
    "ayat": 2,
    "terjemahan": "Dia lah yang mengaturkan kejadian kamu; maka ada sebahagian dari kamu yang kafir dan ada sebahagian dari kamu yang beriman; dan Allah Maha Melihat akan segala yang kamu kerjakan (serta membalas masing-masing)."
  },
  {
    "surah": 64,
    "ayat": 3,
    "terjemahan": "Ia menciptakan langit dan bumi dengan cara yang sungguh layak dan berhikmat, dan Ia menentukan bentuk rupa kamu serta memperelokkan rupa kamu; dan kepadaNyalah tempat kembali."
  },
  {
    "surah": 64,
    "ayat": 4,
    "terjemahan": "Ia mengetahui segala yang ada di langit dan di bumi; dan Ia mengetahui segala yang kamu rahsiakan serta yang kamu zahirkan; dan Allah sentiasa Mengetahui segala (isi hati) yang terkandung di dalam dada;"
  },
  {
    "surah": 64,
    "ayat": 5,
    "terjemahan": "Bukankah telah sampai kepada kamu berita orang-orang kafir yang telah lalu? Lalu mereka merasai kesan yang buruk dari perbuatan kufur mereka; dan mereka (pada hari akhirat kelak) beroleh azab seksa yang tidak terperi sakitnya."
  },
  {
    "surah": 64,
    "ayat": 6,
    "terjemahan": "(Balasan) yang demikian itu, kerana sesungguhnya mereka pernah didatangi Rasul-rasul (yang diutus kepada) mereka dengan membawa keterangan-keterangan yang jelas nyata, maka mereka berkata:\" Patutkah manusia (yang seperti kami - menjadi Rasul untuk) memberi petunjuk kepada kami?\" Lalu mereka kufur ingkar serta berpaling (dari kebenaran); dan Allah pun menyatakan tidak berhajatNya (kepada iman dan ketaatan mereka lalu membinasakan mereka); dan Allah sememangnya Maha Kaya, lagi tetap Terpuji."
  },
  {
    "surah": 64,
    "ayat": 7,
    "terjemahan": "(Di antara sebab-sebab kufur) orang-orang yang kafir (ialah kerana mereka) mengatakan bahawa mereka tidak sekali-kali akan di bangkitkan (sesudah mati). Katakanlah: \"Bahkan, demi Tuhanku, kamu akan dibangkitkan, kemudian kamu akan diberitahu tentang segala yang kamu telah kerjakan. Dan yang demikian itu adalah mudah bagi Allah melaksanakannya."
  },
  {
    "surah": 64,
    "ayat": 8,
    "terjemahan": "Oleh itu, berimanlah kamu kepada Allah dan kepada rasulNya serta kepada penerangan cahaya Al-Quran - yang Kami turunkan. Dan (ingatlah), Allah Amat Mendalam PengetahuanNya akan segala yang kamu kerjakan."
  },
  {
    "surah": 64,
    "ayat": 9,
    "terjemahan": "(Ingatkanlah) masa Allah menghimpunkan kamu pada hari perhimpunan (untuk menerima balasan), - itulah hari masing-masing nampak kerugiannya. Dan (ingatlah), sesiapa yang beriman kepada Allah serta mengerjakan amal soleh, nescaya Allah mengampunkan dosa-dosanya dan memasukkannya ke dalam Syurga yang mengalir di bawahnya beberapa sungai, mereka kekal di dalamnya selama-lamanya; yang demikian itulah kemenangan yang besar."
  },
  {
    "surah": 64,
    "ayat": 10,
    "terjemahan": "Dan orang-orang yang kafir serta mendustakan ayat-ayat keterangan Kami, merekalah ahli neraka, kekalah mereka di dalamnya; dan itulah seburuk-buruk tempat kembali."
  },
  {
    "surah": 64,
    "ayat": 11,
    "terjemahan": "Tidak ada kesusahan (atau bala bencana) yang menimpa (seseorang) melainkan dengan izin Allah; dan sesiapa yang beriman kepada Allah, Allah akan memimpin hatinya (untuk menerima apa yang telah berlaku itu dengan tenang dan sabar); dan (ingatlah), Allah Maha Mengetahui akan tiap-tiap sesuatu."
  },
  {
    "surah": 64,
    "ayat": 12,
    "terjemahan": "Dan taatlah kamu kepada Allah serta taatlah kepada Rasulullah; maka kalau kamu berpaling (enggan taat, kamulah yang akan menderita balasannya yang buruk), kerana sesungguhnya kewajipan Rasul Kami hanyalah menyampaikan (perintah-perintah) dengan jelas nyata."
  },
  {
    "surah": 64,
    "ayat": 13,
    "terjemahan": "Allah, tiada Tuhan melainkan Dia; dan dengan yang demikian, kepada Allah jualah orang-orang yang beriman wajib berserah diri."
  },
  {
    "surah": 64,
    "ayat": 14,
    "terjemahan": "Wahai orang-orang yang beriman! Sesungguhnya ada di antara isteri-isteri kamu dan anak-anak kamu yang menjadi musuh bagi kamu; oleh itu awaslah serta berjaga-jagalah kamu terhadap mereka. Dan kalau kamu memaafkan dan tidak marahkan (mereka) serta mengampunkan kesalahan mereka (maka Allah akan berbuat demikian kepada kamu), kerana sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 64,
    "ayat": 15,
    "terjemahan": "Sesungguhnya harta benda kamu dan anak-anak kamu itu hanyalah menjadi ujian, dan di sisi Allah jualah pahala yang besar."
  },
  {
    "surah": 64,
    "ayat": 16,
    "terjemahan": "Oleh itu bertaqwalah kamu kepada Allah sedaya supaya kamu; dan dengarlah (akan pengajaran-pengajaranNya) serta taatlah (akan perintah-perintahNya); dan belanjakanlah harta kamu (serta buatlah) kebajikan untuk diri kamu. Dan (ingatlah), sesiapa yang menjaga serta memelihara dirinya daripada dipengaruhi oleh tabiat bakhilnya, maka merekalah orang-orang yang berjaya."
  },
  {
    "surah": 64,
    "ayat": 17,
    "terjemahan": "Dan kalau kamu memberi pinjaman kepada Allah, sebagai pinjaman yang baik (ikhlas), nescaya Allah akan melipat gandakan balasanNya kepada kamu serta mengampunkan dosa-dosa kamu; dan Allah amat memberi penghargaan dan balasan kepada golongan yang berbuat baik, lagi Maha Penyabar (untuk memberi peluang kepada golongan yang bersalah supaya bertaubat)."
  },
  {
    "surah": 64,
    "ayat": 18,
    "terjemahan": "Dia lah yang mengetahui segala yang ghaib dan yang nyata, (dan Dia lah jua) yang Maha Kuasa, lagi Maha Bijaksana."
  },
  {
    "surah": 65,
    "ayat": 1,
    "terjemahan": "Wahai Nabi! Apabila kamu - (engkau dan umatmu) - hendak menceraikan isteri-isteri (kamu), maka ceraikanlah mereka pada masa mereka dapat memulakan idahnya, dan hitunglah masa idah itu (dengan betul), serta bertaqwalah kepada Allah, Tuhan kamu. Janganlah kamu mengeluarkan mereka dari rumah-rumah kediamannya (sehingga selesai idahnya), dan janganlah pula (dibenarkan) mereka keluar (dari situ), kecuali (jika) mereka melakukan perbuatan keji yang nyata. Dan itulah aturan-aturan hukum Allah (maka janganlah kamu melanggarnya); dan sesiapa yang melanggar aturan-aturan hukum Allah maka sesungguhnya ia telah berlaku zalim kepada dirinya. (Patuhilah hukum-hukum itu, kerana) engkau tidak mengetahui boleh jadi Allah akan mengadakan, sesudah itu, sesuatu perkara (yang lain)."
  },
  {
    "surah": 65,
    "ayat": 2,
    "terjemahan": "Kemudian, apabila mereka (hampir) habis tempoh idahnya, maka bolehlah kamu pegang mereka (rujuk) dengan cara yang baik, atau lepaskan mereka dengan cara yang baik; dan adakanlah dua orang saksi yang adil di antara kamu (semasa kamu merujukkan atau melepaskannya); dan hendaklah kamu (yang menjadi saksi) menyempurnakan persaksian itu kerana Allah semata-mata. Dengan hukum-hukum yang tersebut diberi peringatan dan pengajaran kepada sesiapa yang beriman kepada Allah dan hari akhirat; dan sesiapa yang bertaqwa kepada Allah (dengan mengerjakan suruhanNya dan meninggalkan laranganNya), nescaya Allah akan mengadakan baginya jalan keluar (dari segala perkara yang menyusahkannya),"
  },
  {
    "surah": 65,
    "ayat": 3,
    "terjemahan": "Serta memberinya rezeki dari jalan yang tidak terlintas di hatinya. Dan (Ingatlah), sesiapa berserah diri bulat-bulat kepada Allah, maka Allah cukuplah baginya (untuk menolong dan menyelamatkannya). Sesungguhnya Allah tetap melakukan segala perkara yang dikehendakiNya. Allah telahpun menentukan kadar dan masa bagi berlakunya tiap-tiap sesuatu."
  },
  {
    "surah": 65,
    "ayat": 4,
    "terjemahan": "Dan perempuan-perempuan dari kalangan kamu yang putus asa dari kedatangan haid, jika kamu menaruh syak (terhadap tempoh idah mereka) maka idahnya ialah tiga bulan; dan (demikian) juga idah perempuan-perempuan yang tidak berhaid. Dan perempuan-perempuan mengandung, tempoh idahnya ialah hingga mereka melahirkan anak yang dikandungnya. Dan (ingatlah), sesiapa yang bertaqwa kepada Allah, nescaya Allah memudahkan baginya segala urusannya."
  },
  {
    "surah": 65,
    "ayat": 5,
    "terjemahan": "Peraturan-peraturan yang demikian adalah hukum-hukum Allah yang diturunkan dan diterangkanNya kepada kamu; dan (ingatlah), sesiapa yang bertaqwa kepada Allah, nescaya Allah menghapuskan kesalahan-kesalahannya, dan akan membesarkan pahala balasannya."
  },
  {
    "surah": 65,
    "ayat": 6,
    "terjemahan": "Tempatkanlah isteri-isteri (yang menjalani idahnya) itu di tempat kediaman kamu sesuai dengan kemampuan kamu; dan janganlah kamu adakan sesuatu yang menyakiti mereka (di tempat tinggal itu) dengan tujuan hendak menyusahkan kedudukan mereka (supaya mereka keluar meninggalkan tempat itu). Dan jika mereka berkeadaan sedang mengandung, maka berikanlah kepada mereka nafkahnya sehingga mereka melahirkan anak yang dikandungnya; kemudian jika mereka menyusukan anak untuk kamu, maka berikanlah kepada mereka upahnya; dan berundinglah di antara kamu (dalam hal menyusunya) dengan cara yang baik. Dan (sebaliknya) jika kamu (dari kedua pihak) mengalami kesulitan, maka bolehlah perempuan lain menyusukannya."
  },
  {
    "surah": 65,
    "ayat": 7,
    "terjemahan": "Hendaklah orang yang mampu memberi nafkah menurut kemampuannya; dan sesiapa yang di sempitkan rezekinya, maka hendaklah ia memberi nafkah dari apa yang diberikan Allah kepadanya (sekadar yang mampu); Allah tidak memberati seseorang melainkan (sekadar kemampuan) yang diberikan Allah kepadanya. (Orang-orang yang dalam kesempitan hendaklah ingat bahawa) Allah akan memberikan kesenangan sesudah berlakunya kesusahan."
  },
  {
    "surah": 65,
    "ayat": 8,
    "terjemahan": "Dan bukan sedikit negeri-negeri yang penduduknya menderhaka terhadap perintah Tuhan mereka dan Rasul-rasulNya, maka Kami hitung amal mereka satu persatu dengan hitungan yang keras rapi, serta Kami seksakan mereka dengan azab yang tidak pernah dikenal dahsyatnya."
  },
  {
    "surah": 65,
    "ayat": 9,
    "terjemahan": "Lalu mereka merasai kesan yang buruk dari perbuatan derhakanya, dan menjadilah akibat perbuatan mereka satu kerugian yang besar."
  },
  {
    "surah": 65,
    "ayat": 10,
    "terjemahan": "Allah menyediakan bagi mereka azab seksa yang seberat-beratnya. Maka bertaqwalah kepada Allah kepada wahai orang yang berakal sempurna dari kalangan orang yang beriman. Sesungguhnya Allah telah menurunkan kepada kamu peringatan -"
  },
  {
    "surah": 65,
    "ayat": 11,
    "terjemahan": "(Dengan mengutuskan) seorang Rasul (Nabi Muhammad s.a.w) yang membacakan kepada kamu ayat-ayat Allah yang menerangkan kebenaran, supaya Allah mengeluarkan orang-orang (yang sedia diketahuiNya akan) beriman dan beramal soleh - dari gelap-gelita (kesesatan) kepada cahaya (hidayah petunjuk). Dan (ingatlah), sesiapa yang beriman kepada Allah dan beramal soleh, akan dimasukkan oleh Allah ke dalam Syurga yang mengalir di bawahnya beberapa sungai; kekalah mereka di dalamnya selama-lamanya. Sesungguhnya Allah (dengan yang demikian) telah mengurniakan kepadanya sebaik-baik pemberian."
  },
  {
    "surah": 65,
    "ayat": 12,
    "terjemahan": "Allah yang menciptakan tujuh petala langit dan (Ia menciptakan) bumi seperti itu; perintah Allah berlaku terus menerus di antara alam langit dan bumi. (Berlakunya yang demikian) supaya kamu mengetahui bahawa sesungguhnya Allah Maha Kuasa atas tiap-tiap sesuatu, dan bahawa sesungguhnya Allah tetap meliputi ilmuNya akan tiap-tiap sesuatu."
  },
  {
    "surah": 66,
    "ayat": 1,
    "terjemahan": "Wahai Nabi! Mengapa engkau haramkan (dengan bersumpah menyekat dirimu daripada menikmati) apa yang dihalalkan oleh Allah bagimu, (kerana) engkau hendak mencari keredaan isteri-isterimu? (Dalam pada itu, Allah ampunkan kesilapanmu itu) dan Allah sememangnya Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 66,
    "ayat": 2,
    "terjemahan": "Sesungguhnya Allah telah menetapkan bagi kamu (wahai Nabi dan umatmu, untuk) melepaskan diri dari sumpah kamu (dengan membayar denda - kaffarah); dan Allah ialah Pelindung yang mentadbirkan keadaan kamu, dan Ia Maha Mengetahui, lagi Maha Bijaksana."
  },
  {
    "surah": 66,
    "ayat": 3,
    "terjemahan": "Dan (ingatlah), ketika Nabi memberitahu suatu perkara secara rahsia kepada salah seorang dari isteri-isterinya. Kemudian apabila isterinya itu menceritakan rahsia yang tersebut (kepada seorang madunya), dan Allah menyatakan pembukaan rahsia itu kepada Nabi, (maka Nabi pun menegur isterinya itu) lalu menerangkan kepadanya sebahagian (dari rahsia yang telah dibukanya) dan tidak menerangkan yang sebahagian lagi (supaya isterinya itu tidak banyak malunya). Setelah Nabi menyatakan hal itu kepada isterinya, isterinya bertanya: \"Siapakah yang memberi tahu hal ini kepada tuan? \" Nabi menjawab: \"Aku diberitahu oleh Allah Yang Maha Mengetahui, lagi Amat Mendalam PengetahuanNya (tentang segala perkara yang nyata dan yang tersembunyi) \"."
  },
  {
    "surah": 66,
    "ayat": 4,
    "terjemahan": "Jika kamu berdua bertaubat kepada Allah (wahai isteri-isteri Nabi, maka itulah yang sewajibnya), kerana sesungguhnya hati kamu berdua telah cenderung (kepada perkara yang menyusahkan Nabi); dan jika kamu berdua saling membantu untuk (melakukan sesuatu yang) menyusahkannya, (maka yang demikian itu tidak akan berjaya) kerana sesungguhnya Allah adalah Pembelanya; dan selain dari itu Jibril serta orang-orang yang soleh dari kalangan orang-orang yang beriman dan malaikat-malaikat - juga menjadi penolongnya."
  },
  {
    "surah": 66,
    "ayat": 5,
    "terjemahan": "Boleh jadi, jika Nabi menceraikan kamu, Tuhannya akan menggantikan baginya isteri-isteri yang lebih baik daripada kamu, - yang menurut perintah, yang ikhlas imannya, yang taat, yang bertaubat, yang tetap beribadat, yang berpuasa, - (meliputi) yang janda dan yang anak dara."
  },
  {
    "surah": 66,
    "ayat": 6,
    "terjemahan": "Wahai orang-orang yang beriman! Peliharalah diri kamu dan keluarga kamu dari neraka yang bahan-bahan bakarannya: manusia dan batu (berhala); neraka itu dijaga dan dikawal oleh malaikat-malaikat yang keras kasar (layanannya); mereka tidak menderhaka kepada Allah dalam segala yang diperintahkanNya kepada mereka, dan mereka pula tetap melakukan segala yang diperintahkan."
  },
  {
    "surah": 66,
    "ayat": 7,
    "terjemahan": "Malaikat itu akan berkata kepada orang-orang yang dimasukkan ke dalam neraka): \"Hai orang-orang yang kufur ingkar! Janganlah kamu menyatakan uzur (dengan meminta ampun) pada hari ini, (kerana masanya telah terlambat). Kamu hanyalah dibalas dengan balasan apa yang kamu telah kerjakan\"."
  },
  {
    "surah": 66,
    "ayat": 8,
    "terjemahan": "Wahai orang-orang yang beriman! Bertaubatlah kamu kepada Allah dengan \" Taubat Nasuha\", mudah-mudahan Tuhan kamu akan menghapuskan kesalahan-kesalahan kamu dan memasukkan kamu ke dalam Syurga yang mengalir di bawahnya beberapa sungai, pada hari Allah tidak akan menghinakan Nabi dan orang-orang yang beriman bersama-sama dengannya; cahaya (iman dan amal soleh) mereka, bergerak cepat di hadapan mereka dan di sebelah kanan mereka (semasa mereka berjalan); mereka berkata (ketika orang-orang munafik meraba-raba dalam gelap-gelita): \"Wahai Tuhan kami! Sempurnakanlah bagi kami cahaya kami, dan limpahkanlah keampunan kepada kami; sesungguhnya Engkau Maha Kuasa atas tiap-tiap sesuatu\"."
  },
  {
    "surah": 66,
    "ayat": 9,
    "terjemahan": "Wahai Nabi! Berjihadlah (menentang) orang-orang kafir dan orang-orang munafik, serta bertindak keras terhadap mereka. Dan (sebenarnya) tempat mereka ialah neraka Jahannam, dan itulah seburuk-buruk tempat kembali."
  },
  {
    "surah": 66,
    "ayat": 10,
    "terjemahan": "Allah mengemukakan satu misal perbandingan (yang menyatakan tidak ada manfaatnya) bagi orang-orang kafir (berhubung rapat dengan orang-orang mukmin selagi mereka tidak beriman dengan sebenar-benarnya), iaitu: perihal isteri Nabi Nuh dan isteri Nabi Lut; mereka berdua berada di bawah jagaan dua orang hamba yang soleh dari hamba-hamba Kami (yang sewajibnya mereka berdua taati); dalam pada itu mereka berlaku khianat kepada suami masing-masing; maka kedua-dua suami mereka (yang berpangkat Nabi itu) tidak dapat memberikan sebarang pertolongan kepada mereka dari (azab) Allah, dan (sebaliknya) dikatakan kepada mereka berdua (pada hari pembalasan): \"Masuklah kamu berdua ke dalam neraka bersama-sama orang-orang yang masuk (ke situ)\"."
  },
  {
    "surah": 66,
    "ayat": 11,
    "terjemahan": "Dan Allah mengemukakan satu misal perbandingan (yang menyatakan tidak ada mudaratnya) kepada orang-orang mukmin (berhubung rapat dengan orang-orang kafir kalau tidak terjejas keadaan imannya), iaitu: perihal isteri Firaun, ketika ia berkata: \"Wahai Tuhanku! Binalah untukku sebuah rumah di sisiMu dalam Syurga, dan selamatkanlah daku dari Firaun dan perbuatannya (yang kufur dan buas), serta selamatkanlah daku dari kaum yang zalim\";"
  },
  {
    "surah": 66,
    "ayat": 12,
    "terjemahan": "Dan juga (satu misal perbandingan lagi, iaitu): Maryam binti Imran (ibu Nabi Isa seorang perempuan) yang telah memelihara kehormatan dan kesuciannya (dari disentuh oleh lelaki; tetapi oleh sebab Kami telah takdirkan dia mendapat anak) maka Kami perintahkan Jibril meniup masuk ke dalam kandungan tubuhnya dari roh (ciptaan) Kami; dan (sekalipun Maryam itu hidup di antara kaum kafir) ia mengakui kebenaran Kalimah-kalimah Tuhannya serta Kitab-kitabNya; dan ia menjadi dari orang-orang yang tetap taat."
  },
  {
    "surah": 67,
    "ayat": 1,
    "terjemahan": "Maha Berkat (serta Maha Tinggilah kelebihan) Tuhan yang menguasai pemerintahan (dunia dan akhirat); dan memanglah Ia Maha Kuasa atas tiap-tiap sesuatu;"
  },
  {
    "surah": 67,
    "ayat": 2,
    "terjemahan": "Dia lah yang telah mentakdirkan adanya mati dan hidup (kamu) - untuk menguji dan menzahirkan keadaan kamu: siapakah di antara kamu yang lebih baik amalnya; dan Ia Maha Kuasa (membalas amal kamu), lagi Maha Pengampun, (bagi orang-orang yang bertaubat);"
  },
  {
    "surah": 67,
    "ayat": 3,
    "terjemahan": "Dia lah yang telah mengaturkan kejadian tujuh petala langit yang berlapis-lapis; engkau tidak dapat melihat pada ciptaan Allah Yang Maha Pemurah itu sebarang keadaan yang tidak seimbang dan tidak munasabah; (jika engkau ragu-ragu) maka ulangilah pandangan - (mu) - dapatkah engkau melihat sebarang kecacatan?"
  },
  {
    "surah": 67,
    "ayat": 4,
    "terjemahan": "Kemudian ulangilah pandangan (mu) berkali-kali, nescaya pandanganmu itu akan berbalik kepadamu dengan hampa (daripada melihat sebarang kecacatan), sedang ia pula berkeadaan lemah lesu (kerana habis tenaga dengan sia-sia)."
  },
  {
    "surah": 67,
    "ayat": 5,
    "terjemahan": "Dan demi sesungguhnya! Kami telah menghiasi langit yang dekat (pada penglihatan penduduk bumi) dengan bintang-bintang, dan Kami jadikan bintang-bintang itu punca rejaman terhadap Syaitan-syaitan; dan Kami sediakan bagi mereka azab neraka yang menjulang-julang."
  },
  {
    "surah": 67,
    "ayat": 6,
    "terjemahan": "Dan bagi orang-orang yang kufur ingkar terhadap Tuhan mereka, disediakan azab neraka Jahannam, dan itulah seburuk-buruk tempat kembali."
  },
  {
    "surah": 67,
    "ayat": 7,
    "terjemahan": "Apabila mereka dicampakkan ke dalamnya, mereka mendengar suara jeritannya meraung-raung, sedang ia menggelegak."
  },
  {
    "surah": 67,
    "ayat": 8,
    "terjemahan": "Hampir-hampir ia pecah berkecai-kecai kerana kuat marahnya. Tiap-tiap kali dicampakkan ke dalamnya sekumpulan besar (dari orang kafir), bertanyalah penjaga-penjaga neraka itu kepada mereka: \"Tidakkah kamu pernah didatangi seorang Rasul pemberi ingatan dan amaran (di dunia dahulu)?\""
  },
  {
    "surah": 67,
    "ayat": 9,
    "terjemahan": "Mereka menjawab: \"Ada! Sebenarnya telah datang kepada kami seorang Rasul pemberi ingatan dan amaran, lalu kami dustakan serta kami katakan (kepadanya): Allah tidak menurunkan sesuatupun, kamu (wahai orang yang mendakwa menjadi Rasul) hanyalah berada dalam kesesatan yang besar! \""
  },
  {
    "surah": 67,
    "ayat": 10,
    "terjemahan": "Dan mereka berkata: \"Kalaulah kami dahulu mendengar dan memahami (sebagai orang yang mencari kebenaran), tentulah kami tidak termasuk dalam kalangan ahli neraka\"."
  },
  {
    "surah": 67,
    "ayat": 11,
    "terjemahan": "Akhirnya mereka mengakui dosa-dosa mereka (sebagai orang-orang yang kufur ingkar), maka tetaplah jauhnya rahmat Allah dari ahli neraka."
  },
  {
    "surah": 67,
    "ayat": 12,
    "terjemahan": "Sesungguhnya orang-orang yang takut (melanggar hukum) Tuhannya semasa mereka tidak dilihat orang dan semasa mereka tidak melihat azab Tuhan, mereka beroleh keampunan dan pahala yang besar."
  },
  {
    "surah": 67,
    "ayat": 13,
    "terjemahan": "Dan tuturkanlah perkataan kamu dengan perlahan atau dengan nyaring, (sama sahaja keadaannya kepada Allah), kerana sesungguhnya Allah Maha Mengetahui akan segala (isi hati) yang terkandung di dalam dada."
  },
  {
    "surah": 67,
    "ayat": 14,
    "terjemahan": "Tidakkah Allah yang menciptakan sekalian makhluk itu mengetahui (segala-galanya)? Sedang Ia Maha Halus urusan PentadbiranNya, lagi Maha Mendalam PengetahuanNya!"
  },
  {
    "surah": 67,
    "ayat": 15,
    "terjemahan": "Dia lah yang menjadikan bumi bagi kamu: mudah digunakan, maka berjalanlah di merata-rata ceruk rantaunya, serta makanlah dari rezeki yang dikurniakan Allah; dan (ingatlah), kepada Allah jualah (tempat kembali kamu sesudah) dibangkitkan hidup semula; (maka hargailah nikmatNya dan takutilah kemurkaanNya)."
  },
  {
    "surah": 67,
    "ayat": 16,
    "terjemahan": "Patutkah kamu merasa aman (tidak takut) kepada Tuhan yang pusat pemerintahanNya di langit itu: menunggang-balikkan bumi menimbus kamu, lalu bergegarlah bumi itu dengan serta-merta (melenyapkan kamu di bawahnya)?"
  },
  {
    "surah": 67,
    "ayat": 17,
    "terjemahan": "Atau patutkah kamu merasa aman (tidak takut) kepada Allah yang pusat pemerintahanNya di langit itu: menghantarkan kepada kamu angin ribut yang menghujani kamu dengan batu; maka dengan itu, kamu akan mengetahui kelak bagaimana buruknya kesan amaranKu?"
  },
  {
    "surah": 67,
    "ayat": 18,
    "terjemahan": "Dan demi sesungguhnya! orang-orang (kafir) yang terdahulu daripada mereka telah mendustakan (rasul-rasulnya lalu mereka dibinasakan); dengan yang demikian, (perhatikanlah) bagaimana buruknya kesan kemurkaanKu."
  },
  {
    "surah": 67,
    "ayat": 19,
    "terjemahan": "Patutkah mereka menutup mata dan tidak memerhatikan (kekuasaan Allah pada) burung-burung yang terbang di atas mereka, (siapakah yang menjaganya ketika) burung-burung itu mengembang dan menutupkan sayapnya? Tidak ada yang menahannya (daripada jatuh) melainkan (kekuasaan) Allah Yang Maha Pemurah. Sesungguhnya Ia Maha Melihat serta mengetahui akan tiap-tiap sesuatu."
  },
  {
    "surah": 67,
    "ayat": 20,
    "terjemahan": "Bahkan siapa dia yang menjadi tentera bagi kamu, yang akan menolong kamu selain dari Allah Yang Maha Pemurah? (Sebenarnya) orang-orang yang kafir tidak lain hanyalah berada dalam keadaan terpedaya."
  },
  {
    "surah": 67,
    "ayat": 21,
    "terjemahan": "Atau siapa dia yang dapat memberi rezeki kepada kamu jika Allah menahan rezekiNya? (Tidak ada sesiapapun), bahkan mereka (yang musyrik itu) kekal terus dalam keadaan sombong angkuh serta melarikan diri (dari kebenaran)."
  },
  {
    "surah": 67,
    "ayat": 22,
    "terjemahan": "Maka adakah orang yang berjalan (melalui jalan yang tidak betul, yang menyebabkan dia selalu jatuh) tersungkur di atas mukanya: boleh mendapat hidayah - atau orang yang berjalan tegak betul, melalui jalan yang lurus rata?"
  },
  {
    "surah": 67,
    "ayat": 23,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Allah yang menciptakan kamu (dari tiada kepada ada), dan mengadakan bagi kamu pendengaran dan penglihatan serta hati (untuk kamu bersyukur, tetapi) amatlah sedikit kamu bersyukur\"."
  },
  {
    "surah": 67,
    "ayat": 24,
    "terjemahan": "Katakanlah lagi: \"Dia lah yang mengembangkan kamu di bumi, dan kepadaNyalah kamu akan dihimpunkan\"."
  },
  {
    "surah": 67,
    "ayat": 25,
    "terjemahan": "Dan mereka (yang ingkar) berkata: \"Bilakah datangnya (hari kiamat) yang dijanjikan itu, jika betul kamu orang-orang yang benar?\""
  },
  {
    "surah": 67,
    "ayat": 26,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Sesungguhnya ilmu pengetahuan (tentang masa kedatangannya) hanya ada pada sisi Allah, dan sesungguhnya aku hanyalah seorang Rasul pemberi ingatan dan amaran yang terang nyata\"."
  },
  {
    "surah": 67,
    "ayat": 27,
    "terjemahan": "Kemudian apabila (datang kiamat dan) mereka melihat (azab) yang dijanjikan itu secara dekat, muramlah muka orang-orang yang kafir itu, serta dikatakan (kepada mereka): \"Inilah dia yang dahulu kamu kerap kali minta disegerakan kedatangannya!\"."
  },
  {
    "surah": 67,
    "ayat": 28,
    "terjemahan": "Tanyalah (wahai Muhammad, kepada mereka): \"Bagaimana fikiran kamu, jika Allah binasakan daku dan orang-orang yang bersama-sama denganku (sebagaimana yang kamu harap-harapkan), atau Ia memberi rahmat kepada kami (sehingga kami dapat mengalahkan kamu), - maka siapakah yang dapat melindungi orang-orang yang kafir dari azab seksa yang tidak terperi sakitnya?\"."
  },
  {
    "surah": 67,
    "ayat": 29,
    "terjemahan": "Tegaskan (wahai Muhammad, kepada mereka): \"Allah Dia lah Yang Maha Pemurah, yang kami beriman kepadaNya, dan yang kepadaNya kami berserah diri; oleh itu kamu akan mengetahui kelak siapakah yang berada dalam kesesatan yang nyata\"."
  },
  {
    "surah": 67,
    "ayat": 30,
    "terjemahan": "Katakanlah lagi: \"Bagaimana fikiran kamu, sekiranya air kamu hilang lenyap (di telan bumi), maka siapakah (selain Allah) yang dapat mendatangkan kepada kamu air yang sentiasa terpancar mengalir?\"."
  },
  {
    "surah": 68,
    "ayat": 1,
    "terjemahan": "Nuun. Demi Pena dan apa yang mereka tulis, -"
  },
  {
    "surah": 68,
    "ayat": 2,
    "terjemahan": "Engkau (wahai Muhammad) - dengan sebab nikmat pemberian Tuhanmu - bukanlah seorang gila (sebagaimana yang dituduh oleh kaum musyrik, bahkan engkau adalah seorang yang bijaksana)."
  },
  {
    "surah": 68,
    "ayat": 3,
    "terjemahan": "Dan sesungguhnya engkau tetap beroleh pahala yang amat besar, yang tidak putus-putus, (sebagai balasan bagi menjalankan ajaran Islam);"
  },
  {
    "surah": 68,
    "ayat": 4,
    "terjemahan": "Dan bahawa sesungguhnya engkau mempunyai akhlak yang amat mulia."
  },
  {
    "surah": 68,
    "ayat": 5,
    "terjemahan": "Maka (tidak lama lagi) engkau akan melihat, dan mereka juga akan melihat, -"
  },
  {
    "surah": 68,
    "ayat": 6,
    "terjemahan": "Siapakah orangnya yang gila di antara kamu semua."
  },
  {
    "surah": 68,
    "ayat": 7,
    "terjemahan": "Sesungguhnya Tuhanmu, Dia lah jua yang lebih mengetahui akan orang yang sesat dari jalanNya, dan Dia lah jua yang lebih mengetahui akan orang-orang yang mendapat petunjuk."
  },
  {
    "surah": 68,
    "ayat": 8,
    "terjemahan": "Oleh itu (berpegang teguhlah pada ajaran Islam yang sedang engkau amalkan, dan) janganlah engkau menurut kemahuan orang-orang yang mendustakan (ugama Allah)."
  },
  {
    "surah": 68,
    "ayat": 9,
    "terjemahan": "Mereka suka kalaulah engkau bertolak ansur (menurut kemahuan mereka), supaya mereka juga bertolak ansur berlemah-lembut (pada zahirnya terhadapmu)."
  },
  {
    "surah": 68,
    "ayat": 10,
    "terjemahan": "Dan janganlah engkau (berkisar dari pendirianmu yang benar, dan jangan) menurut kemahuan orang yang selalu bersumpah, lagi yang hina (pendapatnya dan amalannya), -"
  },
  {
    "surah": 68,
    "ayat": 11,
    "terjemahan": "Yang suka mencaci, lagi yang suka menyebarkan fitnah hasutan (untuk memecah belahkan orang ramai), -"
  },
  {
    "surah": 68,
    "ayat": 12,
    "terjemahan": "Yang sering menghalangi amalan-amalan kebajikan, yang melanggar hukum-hukum ugama, lagi yang amat berdosa, -"
  },
  {
    "surah": 68,
    "ayat": 13,
    "terjemahan": "Yang jahat kejam, yang selain itu tidak tentu pula bapanya."
  },
  {
    "surah": 68,
    "ayat": 14,
    "terjemahan": "Adakah kerana ia seorang hartawan dan ramai anak-pinaknya (maka ia mendustakan ugama Kami)? -"
  },
  {
    "surah": 68,
    "ayat": 15,
    "terjemahan": "Apabila dibacakan kepadanya ayat-ayat keterangan Kami, ia berkata: \" (Ini ialah) cerita-cerita dongeng orang-orang dahulu kala\"."
  },
  {
    "surah": 68,
    "ayat": 16,
    "terjemahan": "(Orang yang bersifat demikian, akan didedahkan kehinaannya) - Kami akan adakan tanda di atas hidungnya (yang berupa belalai itu)."
  },
  {
    "surah": 68,
    "ayat": 17,
    "terjemahan": "Sesungguhnya Kami telah timpakan mereka dengan bala bencana, sebagaimana Kami timpakan tuan-tuan punya kebun (dari kaum yang telah lalu), ketika orang-orang itu bersumpah (bahawa) mereka akan memetik buah-buah kebun itu pada esok pagi; -"
  },
  {
    "surah": 68,
    "ayat": 18,
    "terjemahan": "Serta mereka tidak menyebut pengecualian."
  },
  {
    "surah": 68,
    "ayat": 19,
    "terjemahan": "Maka kebun itu didatangi serta diliputi oleh bala bencana dari Tuhanmu (pada malam hari), sedang mereka semua tidur."
  },
  {
    "surah": 68,
    "ayat": 20,
    "terjemahan": "Lalu menjadilah ia sebagai kebun yang telah binasa semua buahnya."
  },
  {
    "surah": 68,
    "ayat": 21,
    "terjemahan": "Kemudian pada pagi-pagi, mereka panggil memanggil antara satu dengan yang lain -"
  },
  {
    "surah": 68,
    "ayat": 22,
    "terjemahan": "(Setengahnya berkata): \"Pergilah pada pagi-pagi ke kebun kamu, kalau betul kamu mahu memetik buahnya\"."
  },
  {
    "surah": 68,
    "ayat": 23,
    "terjemahan": "Lalu berjalanlah mereka sambil berbisik (katanya):"
  },
  {
    "surah": 68,
    "ayat": 24,
    "terjemahan": "\"Pada hari ini, janganlah hendaknya seorang miskin pun masuk ke kebun itu mendapatkan kamu\"."
  },
  {
    "surah": 68,
    "ayat": 25,
    "terjemahan": "Dan pergilah mereka pada pagi-pagi itu, dengan kepercayaan, (bahawa) mereka berkuasa menghampakan fakir miskin dari hasil kebun itu."
  },
  {
    "surah": 68,
    "ayat": 26,
    "terjemahan": "Sebaik-baik sahaja mereka melihat kebunnya, mereka berkata: \"Sebenarnya kita sesat jalan, (ini bukanlah kebun kita)\"."
  },
  {
    "surah": 68,
    "ayat": 27,
    "terjemahan": "(Setelah mereka perhati dengan teliti, mereka berkata: \"Tidak! Kita tidak sesat), bahkan kita orang-orang yang dihampakan (dari hasil kebun kita, dengan sebab ingatan buruk kita sendiri)\"."
  },
  {
    "surah": 68,
    "ayat": 28,
    "terjemahan": "Berkatalah orang yang bersikap adil di antara mereka: \"Bukankah aku telah katakan kepada kamu (semasa kamu hendak menghampakan orang-orang fakir miskin dari habuannya): amatlah elok kiranya kamu mengingati Allah (serta membatalkan rancangan kamu yang jahat itu) ?\""
  },
  {
    "surah": 68,
    "ayat": 29,
    "terjemahan": "Mereka berkata (dengan sesalnya): \"Maha Suci Tuhan Kami! Sesungguhnya kami adalah orang-orang yang berlaku zalim!\""
  },
  {
    "surah": 68,
    "ayat": 30,
    "terjemahan": "Kemudian setengahnya mengadap yang lain, sambil cela-mencela."
  },
  {
    "surah": 68,
    "ayat": 31,
    "terjemahan": "Mereka berkata: \"Aduhai celakanya kita! Sesungguhnya kita adalah orang-orang yang melampaui batas."
  },
  {
    "surah": 68,
    "ayat": 32,
    "terjemahan": "\"Semoga Tuhan kita, (dengan sebab kita bertaubat) menggantikan bagi kita yang lebih baik daripada (kebun yang telah binasa) itu; sesungguhnya, kepada Tuhan kita sahajalah kita berharap\"."
  },
  {
    "surah": 68,
    "ayat": 33,
    "terjemahan": "Demikianlah azab seksa (yang telah ditimpakan kepada golongan yang ingkar di dunia), dan sesungguhnya azab hari akhirat lebih besar lagi; kalaulah mereka orang-orang yang berpengetahuan (tentulah mereka beringat-ingat)."
  },
  {
    "surah": 68,
    "ayat": 34,
    "terjemahan": "Sesungguhnya orang-orang yang bertaqwa, disediakan bagi mereka taman-taman Syurga yang penuh nikmat, di sisi Tuhan mereka."
  },
  {
    "surah": 68,
    "ayat": 35,
    "terjemahan": "Patutkah Kami (berlaku tidak adil, dengan) menjadikan orang-orang Islam (yang taat), sama seperti orang-orang yang berdosa (yang kufur ingkar)?"
  },
  {
    "surah": 68,
    "ayat": 36,
    "terjemahan": "Apa sudah jadi kepada akal kamu? Bagaimana kamu menetapkan hukum (yang terang-terang salahnya itu)?"
  },
  {
    "surah": 68,
    "ayat": 37,
    "terjemahan": "Adakah kamu mempunyai sesebuah Kitab (dari Allah) yang kamu baca dan pelajari?"
  },
  {
    "surah": 68,
    "ayat": 38,
    "terjemahan": "Bahawa di dalam Kitab itu membolehkan kamu mendapat apa sahaja yang kamu pilih?"
  },
  {
    "surah": 68,
    "ayat": 39,
    "terjemahan": "Atau adakah kamu mendapat akuan-akuan yang ditegaskan dengan sumpah dari Kami, yang tetap hingga hari kiamat, menentukan bahawa kamu dapat mencapai apa yang kamu putuskan?"
  },
  {
    "surah": 68,
    "ayat": 40,
    "terjemahan": "Bertanyalah kepada mereka: \"Siapakah orangnya di antara mereka yang menjamin benarnya hukum: bahawa mereka akan mendapat di akhirat apa yang didapati oleh orang Islam?\""
  },
  {
    "surah": 68,
    "ayat": 41,
    "terjemahan": "Atau adakah mereka mempunyai sekutu-sekutu (yang sefaham dengan mereka? Kalau ada) maka hendaklah mereka membawanya, jika betul mereka orang-orang yang benar."
  },
  {
    "surah": 68,
    "ayat": 42,
    "terjemahan": "(Ingatkanlah orang-orang yang tidak beriman) akan masa didedahkan kedahsyatan huru-hara (hari kiamat), dan mereka diseru supaya sujud maka mereka tidak dapat melakukannya, -"
  },
  {
    "surah": 68,
    "ayat": 43,
    "terjemahan": "Sambil pandangan mereka tunduk malu, serta mereka diliputi kehinaan; dan sesungguhnya mereka (di dunia) dahulu telahpun diseru supaya sujud (tetapi mereka enggan) sedang mereka dalam keadaan sihat."
  },
  {
    "surah": 68,
    "ayat": 44,
    "terjemahan": "Biarkanlah Aku sahaja (wahai Muhammad) dengan orang yang mendustakan keterangan Al-Quran ini, Kami akan menarik mereka sedikit demi sedikit (ke jurang kebinasaan), dari arah yang mereka tidak mengetahuinya."
  },
  {
    "surah": 68,
    "ayat": 45,
    "terjemahan": "Dan Aku akan melanjutkan tempoh untuk mereka; sesungguhnya rancangan sulitKu (terhadap golongan yang kufur ingkar itu), amatlah kuat kukuh."
  },
  {
    "surah": 68,
    "ayat": 46,
    "terjemahan": "Pernahkah engkau (wahai Muhammad) meminta sebarang bayaran kepada mereka (mengenai ajaran Islam yang engkau sampaikan), lalu mereka merasa berat menanggung bayaran itu (sehingga menjauhkan diri daripada menyahut seruanmu)?"
  },
  {
    "surah": 68,
    "ayat": 47,
    "terjemahan": "Atau adakah di sisi mereka (Lauh Mahfuz yang mengandungi) perkara-perkara yang ghaib lalu mereka menyalin (daripadanya untuk menentang ajaran dan peringatanmu)?"
  },
  {
    "surah": 68,
    "ayat": 48,
    "terjemahan": "Maka bersabarlah (wahai Muhammad) menerima hukum Tuhanmu (memberi tempoh kepada mereka), dan janganlah engkau bersikap seperti orang yang telah ditelan oleh ikan. (Ingatlah kisahnya) ketika ia berdoa merayu dengan keadaan sesak sebak terkurung dalam perut ikan."
  },
  {
    "surah": 68,
    "ayat": 49,
    "terjemahan": "Kalaulah ia tidak didatangi nikmat pertolongan dari Tuhannya, nescaya tercampaklah ia ke tanah yang tandus (di tepi pantai) dalam keadaan ia ditempelak (kerana salah silapnya)."
  },
  {
    "surah": 68,
    "ayat": 50,
    "terjemahan": "Selepas itu Tuhannya memilihnya, serta menjadikan dia dari orang-orang yang soleh."
  },
  {
    "surah": 68,
    "ayat": 51,
    "terjemahan": "Dan sesungguhnya orang-orang yang kafir itu, hampir-hampir menggelincir dan menjatuhkanmu dengan pandangan mereka (yang penuh dengan permusuhan dan kebencian), semasa mereka mendengar Al-Quran sambil berkata: \"Sebenarnya (Muhammad) itu, sungguh-sungguh orang gila\"."
  },
  {
    "surah": 68,
    "ayat": 52,
    "terjemahan": "Padahal Al-Quran itu tidak lain hanyalah peringatan bagi umat manusia seluruhnya."
  },
  {
    "surah": 69,
    "ayat": 1,
    "terjemahan": "Saat yang tetap berlaku itu -"
  },
  {
    "surah": 69,
    "ayat": 2,
    "terjemahan": "Apakah dia sifat dan keadaan saat yang tetap berlaku itu?"
  },
  {
    "surah": 69,
    "ayat": 3,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui tentang sifat dan keadaan saat yang tetap berlaku itu? (Saat itu ialah hari kiamat)."
  },
  {
    "surah": 69,
    "ayat": 4,
    "terjemahan": "Kaum Thamud dan Aad telah mendustakan hari (kiamat) yang menggempar dan mengharukan itu."
  },
  {
    "surah": 69,
    "ayat": 5,
    "terjemahan": "Maka (masing-masing menerima azab dunianya) - adapun Thamud (kaum Nabi Soleh), maka mereka telah dibinasakan dengan (petir) yang melampau dahsyatnya."
  },
  {
    "surah": 69,
    "ayat": 6,
    "terjemahan": "Adapun Aad (kaum Nabi Hud), maka mereka telah dibinasakan dengan angin ribut yang kencang, yang melampau kencangnya, -"
  },
  {
    "surah": 69,
    "ayat": 7,
    "terjemahan": "Yang diarahkannya menyerang mereka tujuh malam lapan hari terus-menerus; (kalaulah engkau menyaksikannya) maka engkau akan melihat kaum itu bergelimpangan mati, seolah-olah mereka: batang-batang pohon kurma yang (tumbang dan) lompang."
  },
  {
    "surah": 69,
    "ayat": 8,
    "terjemahan": "Dengan yang demikian, dapatkah engkau melihat lagi sisa-sisa mereka (yang masih hidup)?"
  },
  {
    "surah": 69,
    "ayat": 9,
    "terjemahan": "Dan (selain dari mereka) datanglah Firaun, dan orang-orang yang terdahulu daripadanya, serta penduduk negeri-negeri yang telah ditunggang balikkan - dengan melakukan perkara-perkara yang salah."
  },
  {
    "surah": 69,
    "ayat": 10,
    "terjemahan": "Iaitu masing-masing menderhaka kepada Rasul (yang diutuskan oleh) Tuhan mereka, lalu Allah menyeksa mereka dengan azab yang sentiasa bertambah."
  },
  {
    "surah": 69,
    "ayat": 11,
    "terjemahan": "Sesungguhnya Kami, - ketika air (banjir) melampaui hadnya (serta menenggelamkan gunung-ganang), - telah mengangkut (serta menyelamatkan nenek moyang) kamu ke dalam bahtera Nabi Nuh (yang bergerak laju pelayarannya)."
  },
  {
    "surah": 69,
    "ayat": 12,
    "terjemahan": "(Kami lakukan yang demikian) untuk Kami jadikan peristiwa itu satu pelajaran bagi kamu, dan untuk didengar serta diambil ingat oleh telinga (orang-orang) yang mahu menerima pengajaran."
  },
  {
    "surah": 69,
    "ayat": 13,
    "terjemahan": "Kemudian (ketahuilah bahawa) apabila ditiup Sangkakala dengan sekali tiup, -"
  },
  {
    "surah": 69,
    "ayat": 14,
    "terjemahan": "Dan bumi serta gunung-ganang diangkat (dari tempatnya) lalu dihancurkan keduanya dengan sekali hancur, -"
  },
  {
    "surah": 69,
    "ayat": 15,
    "terjemahan": "Maka pada saat itu berlakulah hari kiamat, -"
  },
  {
    "surah": 69,
    "ayat": 16,
    "terjemahan": "Dan terbelahlah langit, lalu menjadilah ia pada saat itu reput (dan runtuh),"
  },
  {
    "surah": 69,
    "ayat": 17,
    "terjemahan": "Sedang malaikat-malaikat (ditempatkan) mengawal segala penjurunya, dan Arasy Tuhanmu pada saat itu dipikul oleh lapan malaikat di atas malaikat-malaikat yang mengawal itu."
  },
  {
    "surah": 69,
    "ayat": 18,
    "terjemahan": "Pada hari itu, kamu semua dihadapkan (untuk hitungan amal); tidak ada sesuatu pun yang tersembunyi (kepada Allah) dari perkara-perkara kamu yang tersembunyi."
  },
  {
    "surah": 69,
    "ayat": 19,
    "terjemahan": "Maka sesiapa yang diberikan menerima Kitab amalnya dengan tangan kanannya, maka ia akan berkata (dengan sukacitanya kepada sesiapa yang ada di sisinya): ` Nah! Bacalah kamu Kitab amalku ini!"
  },
  {
    "surah": 69,
    "ayat": 20,
    "terjemahan": "\"Sesungguhnya aku telah mengetahui dengan yakin, bahawa aku akan menghadapi hitungan amalku (pada hari yang ditentukan)!\""
  },
  {
    "surah": 69,
    "ayat": 21,
    "terjemahan": "Maka (dengan itu) tinggalah dia dalam kehidupan yang senang lenang lagi memuaskan, -"
  },
  {
    "surah": 69,
    "ayat": 22,
    "terjemahan": "Di dalam Syurga yang tinggi (darjatnya), -"
  },
  {
    "surah": 69,
    "ayat": 23,
    "terjemahan": "Buah-buahannya dekat untuk dipetik."
  },
  {
    "surah": 69,
    "ayat": 24,
    "terjemahan": "(Masing-masing dipersilakan menikmatinya dengan dikatakan): \"Makan dan minumlah kamu makanan dan minuman sebagai nikmat yang lazat dan baik kesudahannya, dengan sebab (amal-amal soleh) yang telah kamu kerjakan pada masa yang lalu (di dunia)!\""
  },
  {
    "surah": 69,
    "ayat": 25,
    "terjemahan": "Adapun orang yang diberikan menerima Kitab amalnya dengan tangan kirinya, maka ia akan berkata (dengan sesalnya): \"Alangkah baiknya kalau aku tidak diberikan Kitab amalku, -"
  },
  {
    "surah": 69,
    "ayat": 26,
    "terjemahan": "\"Dan aku tidak dapat mengetahui hitungan amalku."
  },
  {
    "surah": 69,
    "ayat": 27,
    "terjemahan": "\"Alangkah baiknya kalau kematianku di dunia dahulu, menjadi kematian pemutus (yang menamatkan kesudahanku, tidak dibangkitkan lagi); -"
  },
  {
    "surah": 69,
    "ayat": 28,
    "terjemahan": "\"Harta kekayaanku tidak dapat menolongku sedikitpun; -"
  },
  {
    "surah": 69,
    "ayat": 29,
    "terjemahan": "Kuat kuasaku (dan hujjah-hujjahku membela diri), telah binasa dan hilang lenyap dariku\"."
  },
  {
    "surah": 69,
    "ayat": 30,
    "terjemahan": "(Lalu diperintahkan malaikat penjaga neraka): \"Tangkaplah orang yang berdosa itu serta belenggulah dia, -"
  },
  {
    "surah": 69,
    "ayat": 31,
    "terjemahan": "\"Kemudian bakarlah dia di dalam neraka Jahiim; -"
  },
  {
    "surah": 69,
    "ayat": 32,
    "terjemahan": "\"Selain dari itu, masukkanlah dia dalam (lingkaran) rantai besi yang ukuran panjangnya tujuh puluh hasta, (dengan membelitkannya ke badannya)!"
  },
  {
    "surah": 69,
    "ayat": 33,
    "terjemahan": "\"Sesungguhnya dia dahulu tidak beriman kepada Allah Yang Maha Besar,"
  },
  {
    "surah": 69,
    "ayat": 34,
    "terjemahan": "\"Dan dia juga tidak menggalakkan (dirinya dan orang lain) memberi makanan (yang berhak diterima oleh) orang miskin."
  },
  {
    "surah": 69,
    "ayat": 35,
    "terjemahan": "\"Maka pada hari ini, tidak ada baginya di sini (seorangpun dari) kaum kerabat serta sahabat handai (yang dapat menolongnya), -"
  },
  {
    "surah": 69,
    "ayat": 36,
    "terjemahan": "\"Dan tidak ada makanan (baginya) melainkan dari air danur,"
  },
  {
    "surah": 69,
    "ayat": 37,
    "terjemahan": "\"Yang tidak memakannya melainkan orang-orang yang melakukan perkara yang salah\"."
  },
  {
    "surah": 69,
    "ayat": 38,
    "terjemahan": "Maka Aku bersumpah: Demi segala (yang nyata) yang kamu melihatnya, -"
  },
  {
    "surah": 69,
    "ayat": 39,
    "terjemahan": "Dan segala (yang ghaib) yang kamu tidak melihatnya, -"
  },
  {
    "surah": 69,
    "ayat": 40,
    "terjemahan": "Bahawa sesungguhnya Al-Quran itu ialah (wahyu dari Kami) yang disampaikan oleh Rasul yang mulia."
  },
  {
    "surah": 69,
    "ayat": 41,
    "terjemahan": "Dan bukanlah Al-Quran itu perkataan seorang penyair (sebagaimana yang kamu dakwakan. Tetapi sayang!) amatlah sedikit kamu beriman."
  },
  {
    "surah": 69,
    "ayat": 42,
    "terjemahan": "Dan juga bukanlah Al-Quran itu perkataan seorang pawang (sebagaimana yang kamu katakan. Tetapi sayang!) amatlah sedikit kamu mengambil peringatan."
  },
  {
    "surah": 69,
    "ayat": 43,
    "terjemahan": "(Al-Quran itu) diturunkan dari Allah Tuhan sekalian alam."
  },
  {
    "surah": 69,
    "ayat": 44,
    "terjemahan": "Dan kalaulah (Nabi Muhammad yang menyampaikan Al-Quran itu) mengatakan atas nama Kami secara dusta - sebarang kata-kata rekaan, -"
  },
  {
    "surah": 69,
    "ayat": 45,
    "terjemahan": "Sudah tentu Kami akan menyentapnya, dengan kekuasaan Kami, -"
  },
  {
    "surah": 69,
    "ayat": 46,
    "terjemahan": "Kemudian sudah tentu Kami akan memutuskan tali jantungnya (supaya ia mati dengan serta-merta);"
  },
  {
    "surah": 69,
    "ayat": 47,
    "terjemahan": "Maka tidak ada seorangpun di antara kamu yang dapat menghalang (tindakan Kami itu) daripada menimpanya."
  },
  {
    "surah": 69,
    "ayat": 48,
    "terjemahan": "Dan sesungguhnya (Al-Quran) itu tetap menjadi peringatan bagi orang-orang yang bertaqwa."
  },
  {
    "surah": 69,
    "ayat": 49,
    "terjemahan": "Dan sesungguhnya Kami sedia mengetahui bahawa ada di antara kamu yang mendustakan (Al-Quran, maka Kami akan membalasnya)."
  },
  {
    "surah": 69,
    "ayat": 50,
    "terjemahan": "Dan sesungguhnya Al-Quran itu sudah tentu akan menyebabkan penyesalan bagi orang-orang yang kafir (semasa mereka menerima balasan)."
  },
  {
    "surah": 69,
    "ayat": 51,
    "terjemahan": "Dan sesungguhnya Al-Quran itu adalah kebenaran yang diyakini (dengan seyakin-yakinnya)."
  },
  {
    "surah": 69,
    "ayat": 52,
    "terjemahan": "Oleh itu bertasbihlah dengan memuji nama Tuhanmu Yang Maha Besar."
  },
  {
    "surah": 70,
    "ayat": 1,
    "terjemahan": "Salah seorang (dari kalangan orang-orang kafir Makkah, secara mengejek-ejek) meminta kedatangan azab yang (dijanjikan) akan berlaku,"
  },
  {
    "surah": 70,
    "ayat": 2,
    "terjemahan": "Azab yang disediakan untuk orang-orang yang kafir, yang tidak ada sesiapapun dapat menolak kedatangannya -"
  },
  {
    "surah": 70,
    "ayat": 3,
    "terjemahan": "Dari Allah yang menguasai tempat-tempat turun naik -"
  },
  {
    "surah": 70,
    "ayat": 4,
    "terjemahan": "Yang dilalui oleh malaikat-malaikat dan Jibril ke pusat pemerintahanNya (untuk menerima dan menyempurnakan tugas masing-masing, terutama) pada satu masa yang adalah tempohnya (dirasai oleh orang-orang yang bersalah) sungguh panjang, (kerana banyak hitungan hisab dan berat soal jawabnya)."
  },
  {
    "surah": 70,
    "ayat": 5,
    "terjemahan": "Maka bersabarlah (wahai Muhammad terhadap ejekan golongan yang kafir itu), dengan cara kesabaran yang sebaik-baiknya."
  },
  {
    "surah": 70,
    "ayat": 6,
    "terjemahan": "Sebenarnya mereka memandang azab itu jauh (daripada berlaku),"
  },
  {
    "surah": 70,
    "ayat": 7,
    "terjemahan": "Sedang Kami memandangnya dekat, (tetap akan berlaku),"
  },
  {
    "surah": 70,
    "ayat": 8,
    "terjemahan": "(Iaitu) pada hari langit menjadi seperti tembaga cair,"
  },
  {
    "surah": 70,
    "ayat": 9,
    "terjemahan": "Dan gunung-ganang pula menjadi seperti bulu (yang berterbangan)"
  },
  {
    "surah": 70,
    "ayat": 10,
    "terjemahan": "Dan sahabat karib tidak bertanyakan hal sahabat karibnya, (kerana tiap-tiap seorang sibuk memikirkan hal keadaannya sendiri),"
  },
  {
    "surah": 70,
    "ayat": 11,
    "terjemahan": "Padahal masing-masing diberi melihat setengahnya yang lain; (pada saat yang demikian) orang yang kafir suka kiranya dapat menebus dirinya dari azab itu dengan anak-anaknya sendiri,"
  },
  {
    "surah": 70,
    "ayat": 12,
    "terjemahan": "Dan isteri serta saudaranya,"
  },
  {
    "surah": 70,
    "ayat": 13,
    "terjemahan": "Dan kaum kerabatnya yang melindunginya,"
  },
  {
    "surah": 70,
    "ayat": 14,
    "terjemahan": "Dan juga sekalian makhluk yang ada di bumi - kemudian (diharapkannya) tebusan itu dapat menyelamatkannya."
  },
  {
    "surah": 70,
    "ayat": 15,
    "terjemahan": "Tidak sekali-kali (sebagaimana yang diharapkannya)! Sesungguhnya neraka (yang disediakan baginya) tetap menjulang-julang apinya,"
  },
  {
    "surah": 70,
    "ayat": 16,
    "terjemahan": "(Membakar serta) menggugurkan kulit ubun-ubun dan anggota anggota tubuh badan,"
  },
  {
    "surah": 70,
    "ayat": 17,
    "terjemahan": "Neraka itu juga memanggil dan menarik orang yang membelakangi serta berpaling (dari kebenaran),"
  },
  {
    "surah": 70,
    "ayat": 18,
    "terjemahan": "Dan yang mengumpulkan harta kekayaan lalu menyimpannya (dengan tidak membayar zakatnya)."
  },
  {
    "surah": 70,
    "ayat": 19,
    "terjemahan": "Sesungguhnya manusia itu dijadikan bertabiat resah gelisah (lagi bakhil kedekut); -"
  },
  {
    "surah": 70,
    "ayat": 20,
    "terjemahan": "Apabila ia ditimpa kesusahan, dia sangat resah gelisah;"
  },
  {
    "surah": 70,
    "ayat": 21,
    "terjemahan": "Dan apabila ia beroleh kesenangan, ia sangat bakhil kedekut;"
  },
  {
    "surah": 70,
    "ayat": 22,
    "terjemahan": "Kecuali orang-orang yang mengerjakan sembahyang -"
  },
  {
    "surah": 70,
    "ayat": 23,
    "terjemahan": "Iaitu mereka yang tetap mengerjakan sembahyangnya;"
  },
  {
    "surah": 70,
    "ayat": 24,
    "terjemahan": "Dan mereka (yang menentukan bahagian) pada harta-hartanya, menjadi hak yang termaklum -"
  },
  {
    "surah": 70,
    "ayat": 25,
    "terjemahan": "Bagi orang miskin yang meminta dan orang miskin yang menahan diri (daripada meminta);"
  },
  {
    "surah": 70,
    "ayat": 26,
    "terjemahan": "Dan mereka yang percayakan hari pembalasan (dengan mengerjakan amal-amal yang soleh sebagai buktinya);"
  },
  {
    "surah": 70,
    "ayat": 27,
    "terjemahan": "Dan mereka yang cemas takut daripada ditimpa azab Tuhannya, -"
  },
  {
    "surah": 70,
    "ayat": 28,
    "terjemahan": "Kerana sesungguhnya azab Tuhan mereka, tidak patut (bagi seseorangpun) merasa aman terhadapnya;"
  },
  {
    "surah": 70,
    "ayat": 29,
    "terjemahan": "Dan mereka yang menjaga kehormatannya, -"
  },
  {
    "surah": 70,
    "ayat": 30,
    "terjemahan": "Kecuali kepada isterinya atau kepada hambanya, maka sesungguhnya mereka tidak tercela;"
  },
  {
    "surah": 70,
    "ayat": 31,
    "terjemahan": "Kemudian sesiapa yang mengingini selain dari yang demikian, maka merekalah orang-orang yang melampaui batas;"
  },
  {
    "surah": 70,
    "ayat": 32,
    "terjemahan": "Dan mereka yang menjaga amanah dan janjinya;"
  },
  {
    "surah": 70,
    "ayat": 33,
    "terjemahan": "Dan mereka yang memberikan keterangan dengan benar lagi adil (semasa mereka menjadi saksi);"
  },
  {
    "surah": 70,
    "ayat": 34,
    "terjemahan": "Dan mereka yang tetap memelihara sembahyangnya;"
  },
  {
    "surah": 70,
    "ayat": 35,
    "terjemahan": "Mereka (yang demikian sifatnya) ditempatkan di dalam Syurga dengan diberikan penghormatan."
  },
  {
    "surah": 70,
    "ayat": 36,
    "terjemahan": "Maka apakah yang menyebabkan orang-orang kafir, yang menentangmu (wahai Muhammad) datang berkejaran ke sisimu -"
  },
  {
    "surah": 70,
    "ayat": 37,
    "terjemahan": "(Sambil mereka) berkumpul berpuak-puak di sebelah kanan dan di sebelah kirimu."
  },
  {
    "surah": 70,
    "ayat": 38,
    "terjemahan": "Patutkah tiap-tiap seorang dari mereka berharap supaya dimasukkan ke dalam Syurga yang penuh nikmat (sedang ia tidak beriman)?"
  },
  {
    "surah": 70,
    "ayat": 39,
    "terjemahan": "Tidak sekali-kali! (Mereka yang kufur ingkar tidak akan dapat memasukinya). Sesungguhnya Kami telah menciptakan mereka dari apa yang mereka sedia mengetahuinya."
  },
  {
    "surah": 70,
    "ayat": 40,
    "terjemahan": "Maka Aku bersumpah dengan (kebesaranKu) Tuhan yang menguasai (seluruh alam, meliputi) tempat-tempat terbit (matahari dan bulan bintang) dan tempat-tempat tenggelamnya, - sesungguhnya Kami berkuasa -"
  },
  {
    "surah": 70,
    "ayat": 41,
    "terjemahan": "(Membinasakan mereka, serta) menggantikan mereka dengan makhluk-makluk yang lebih baik dari mereka; dan Kami tidak sekali-kali dapat dikalahkan atau dilemahkan."
  },
  {
    "surah": 70,
    "ayat": 42,
    "terjemahan": "Oleh itu, biarkanlah mereka (wahai Muhammad) tenggelam dalam kesesatannya dan leka bermain-main (dalam dunianya), sehingga mereka menemui hari yang dijanjikan kepada mereka (untuk menerima balasan)! -"
  },
  {
    "surah": 70,
    "ayat": 43,
    "terjemahan": "Iaitu hari mereka segera keluar dari kubur masing-masing menuju (ke Padang Mahsyar) dengan keadaan seolah-olah mereka berkejaran ke (tempat) berhala-berhala (yang mereka sembah dahulu),"
  },
  {
    "surah": 70,
    "ayat": 44,
    "terjemahan": "Sambil pandangan mereka tunduk, serta mereka diliputi kehinaan; itulah hari yang telah dijanjikan kepada mereka."
  },
  {
    "surah": 71,
    "ayat": 1,
    "terjemahan": "Sesungguhnya Kami telah mengutus Nabi Nuh kepada kaumnya, (dengan berfirman kepadanya): \"Berikanlah peringatan dan amaran kepada kaummu sebelum mereka didatangi azab yang tidak terperi sakitnya\"."
  },
  {
    "surah": 71,
    "ayat": 2,
    "terjemahan": "dia pun (menyeru mereka dengan) berkata: \"Wahai kaumku! Sesungguhnya aku ini diutus kepada kamu, sebagai pemberi ingatan dan amaran yang nyata;"
  },
  {
    "surah": 71,
    "ayat": 3,
    "terjemahan": "\"Iaitu sembahlah kamu akan Allah dan bertaqwalah kepadaNya, serta taatlah kamu kepadaku;"
  },
  {
    "surah": 71,
    "ayat": 4,
    "terjemahan": "\"Supaya Allah mengampunkan bagi kamu sebahagian dari dosa-dosa kamu, dan memberi kamu hidup (dengan tidak terkena azab) hingga ke suatu masa yang tertentu; (maka segeralah beribadat dan bertaqwa) kerana sesungguhnya ajal (yang telah ditetapkan) Allah, apabila sampai masanya, tidak dapat ditangguhkan; kalaulah kamu mengetahui (hakikat ini tentulah kamu segera beriman)\"."
  },
  {
    "surah": 71,
    "ayat": 5,
    "terjemahan": "(Setelah puas menyeru mereka), Nabi Nuh berdoa dengan berkata: \"Wahai Tuhanku, sesungguhnya aku telah menyeru kaumku siang dan malam (supaya mereka beriman);"
  },
  {
    "surah": 71,
    "ayat": 6,
    "terjemahan": "\"Maka seruanku itu tidak memberikan mereka (sesuatu faedah pun) selain daripada menambahi mereka melarikan diri (dari kebenaran)."
  },
  {
    "surah": 71,
    "ayat": 7,
    "terjemahan": "\"Dan sesungguhnya aku, tiap-tiap kali menyeru mereka (beriman) supaya Engkau mengampunkan dosa-dosa mereka, - mereka menyumbatkan telinganya dengan jari masing-masing, dan berselubung dengan pakaiannya, serta berdegil dengan keingkarannya, dan berlaku sombong takbur dengan melampau."
  },
  {
    "surah": 71,
    "ayat": 8,
    "terjemahan": "\"Kemudian aku telah menyeru mereka dengan terang-terang;"
  },
  {
    "surah": 71,
    "ayat": 9,
    "terjemahan": "\"Selain dari itu, aku (berulang-ulang) menyeru mereka secara beramai-ramai dengan berterus-terang, dan menyeru mereka lagi secara berseorangan dengan perlahan-lahan."
  },
  {
    "surah": 71,
    "ayat": 10,
    "terjemahan": "\"Sehingga aku berkata (kepada mereka): `Pohonkanlah ampun kepada Tuhan kamu, sesungguhnya adalah Ia Maha Pengampun."
  },
  {
    "surah": 71,
    "ayat": 11,
    "terjemahan": "\"(Sekiranya kamu berbuat demikian), Ia akan menghantarkan hujan lebat mencurah-curah, kepada kamu;"
  },
  {
    "surah": 71,
    "ayat": 12,
    "terjemahan": "\"Dan Ia akan memberi kepada kamu dengan banyaknya harta kekayaan serta anak-pinak; dan Ia akan mengadakan bagi kamu kebun-kebun tanaman, serta mengadakan bagi kamu sungai-sungai (yang mengalir di dalamnya)."
  },
  {
    "surah": 71,
    "ayat": 13,
    "terjemahan": "\"Mengapa kamu berkeadaan tidak menghargai kebesaran Allah (dan kekuasaanNya), -"
  },
  {
    "surah": 71,
    "ayat": 14,
    "terjemahan": "\"Padahal sesungguhnya Ia telah menciptakan kamu dengan kejadian yang berperingkat-peringkat?"
  },
  {
    "surah": 71,
    "ayat": 15,
    "terjemahan": "\"Tidakkah kamu mengetahui dan memikirkan bagaimana Allah telah menciptakan tujuh petala langit bertingkat-tingkat,"
  },
  {
    "surah": 71,
    "ayat": 16,
    "terjemahan": "\"Dan Ia menjadikan padanya bulan sebagai cahaya serta menjadikan matahari sebagai lampu (yang terang-benderang),"
  },
  {
    "surah": 71,
    "ayat": 17,
    "terjemahan": "\"Dan Allah telah menumbuhkan kamu (hidup dari benda-benda yang berasal) dari bumi, dengan pertumbuhan yang sungguh-sungguh sempurna,"
  },
  {
    "surah": 71,
    "ayat": 18,
    "terjemahan": "\"Kemudian Ia mengembalikan kamu ke dalam bumi (sesudah mati), dan mengeluarkan kamu daripadanya (sesudah dihidupkan semula untuk dihitung amal kamu dan diberi balasan), dengan pengeluaran yang sesungguh-sungguhnya?"
  },
  {
    "surah": 71,
    "ayat": 19,
    "terjemahan": "\"Dan Allah telah menjadikan bumi bagi kamu sebagai hamparan,"
  },
  {
    "surah": 71,
    "ayat": 20,
    "terjemahan": "\"Supaya kamu melalui jalan-jalan yang luas padanya\"."
  },
  {
    "surah": 71,
    "ayat": 21,
    "terjemahan": "Nabi Nuh (merayu lagi dengan) berkata: \"Wahai Tuhanku! Sesungguhnya, mereka telah menderhaka kepadaku, dan mereka telah menurut orang yang harta bendanya dan anak-pinaknya tidak menambahinya melainkan kerugian (di akhirat kelak)."
  },
  {
    "surah": 71,
    "ayat": 22,
    "terjemahan": "\"Dan mereka telah menjalankan tipu daya dengan merancangkan rancangan yang amat besar jahatnya (untuk menentang seruanku)."
  },
  {
    "surah": 71,
    "ayat": 23,
    "terjemahan": "\"Dan (ketua-ketua) mereka (menghasut dengan) berkata: `Jangan kamu meninggalkan (penyembahan) tuhan-tuhan kamu, terutama (penyembahan) Wadd, dan Suwaa', dan Yaghuth, dan Ya'uuq, serta Nasr."
  },
  {
    "surah": 71,
    "ayat": 24,
    "terjemahan": "\"Dan sesungguhnya ketua-ketua itu telah menyesatkan kebanyakan (dari umat manusia); dan (dengan yang demikian) janganlah Engkau (wahai Tuhanku) menambahi orang-orang yang zalim itu melainkan kesesatan jua\"."
  },
  {
    "surah": 71,
    "ayat": 25,
    "terjemahan": "Disebabkan dosa-dosa dan kesalahan mereka, mereka ditenggelamkan (dengan banjir dan taufan), kemudian (pada hari akhirat) dimasukkan ke dalam neraka; maka mereka tidak akan beroleh sebarang penolong yang lain dari Allah (yang dapat memberikan pertolongan)."
  },
  {
    "surah": 71,
    "ayat": 26,
    "terjemahan": "Dan Nabi Nuh (merayu lagi dengan) berkata: \"Wahai Tuhanku! Janganlah Engkau biarkan seorangpun dari orang-orang kafir itu hidup di atas muka bumi!"
  },
  {
    "surah": 71,
    "ayat": 27,
    "terjemahan": "\"Kerana sesungguhnya jika Engkau biarkan mereka (hidup), nescaya mereka akan menyesatkan hamba-hambaMu, dan mereka tidak akan melahirkan anak melainkan yang berbuat dosa lagi kufur ingkar."
  },
  {
    "surah": 71,
    "ayat": 28,
    "terjemahan": "\"Wahai Tuhanku! Ampunkanlah bagiku, dan bagi kedua ibu bapaku, serta bagi sesiapa yang masuk ke rumahku dengan keadaan beriman; dan (ampunkanlah) bagi sekalian orang-orang yang beriman, lelaki dan perempuan (dalam segala zaman); dan janganlah Engkau tambahi orang-orang yang zalim melainkan kebinasaan!\""
  },
  {
    "surah": 72,
    "ayat": 1,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Telah diwahyukan kepadaku, bahawa sesungguhnya: satu rombongan jin telah mendengar (Al-Quran yang aku bacakan), lalu mereka (menyampaikan hal itu kepada kaumnya dengan) berkata: `Sesungguhnya kami telah mendengar Al-Quran (sebuah Kitab Suci) yang susunannya dan kandungannya sungguh menakjubkan!"
  },
  {
    "surah": 72,
    "ayat": 2,
    "terjemahan": "`Kitab yang memberi panduan ke jalan yang betul, lalu kami beriman kepadanya, dan kami tidak sekali-kali akan mempersekutukan sesuatu makhluk dengan Tuhan kami."
  },
  {
    "surah": 72,
    "ayat": 3,
    "terjemahan": "`Dan (ketahuilah wahai kaum kami!) Bahawa sesungguhnya: tertinggilah kebesaran dan keagungan Tuhan kita daripada beristeri atau beranak."
  },
  {
    "surah": 72,
    "ayat": 4,
    "terjemahan": "`Dan (dengan ajaran Al-Quran nyatalah) bahawa sesungguhnya: (ketua) yang kurang akal pertimbangannya dari kalangan kita telah mengatakan terhadap Allah kata-kata yang melampaui kebenaran;"
  },
  {
    "surah": 72,
    "ayat": 5,
    "terjemahan": "`Dan bahawa sesungguhnya (nyatalah kesalahan) kita menyangka bahawa manusia dan jin tidak sekali-kali akan berani mengatakan sesuatu yang dusta terhadap Allah."
  },
  {
    "surah": 72,
    "ayat": 6,
    "terjemahan": "`Dan bahawa sesungguhnya adalah (amat salah perbuatan) beberapa orang dari manusia, menjaga dan melindungi dirinya dengan meminta pertolongan kepada ketua-ketua golongan jin, kerana dengan permintaan itu mereka menjadikan golongan jin bertambah sombong dan jahat."
  },
  {
    "surah": 72,
    "ayat": 7,
    "terjemahan": "`Dan bahawa sesungguhnya (tidaklah benar) manusia menyangka sebagaimana yang kamu sangka, bahawa Allah tidak sekali-kali mengutuskan sebarang Rasul (atau tidak akan membangkitkan manusia pada hari kiamat)."
  },
  {
    "surah": 72,
    "ayat": 8,
    "terjemahan": "`Dan bahawa sesungguhnya kami telah berusaha mencari berita langit, lalu kami dapati langit itu penuh dengan pengawal-pengawal yang sangat kuat kawalannya, dan (dengan rejaman-rejaman) api yang menyala."
  },
  {
    "surah": 72,
    "ayat": 9,
    "terjemahan": "`Padahal sesungguhnya kami dahulu biasa menduduki tempat-tempat (perhentian) di langit untuk mendengar (percakapan penduduknya); maka sekarang sesiapa yang cuba mendengar, akan mendapati api yang menyala yang menunggu merejamnya."
  },
  {
    "surah": 72,
    "ayat": 10,
    "terjemahan": "`Dan bahawa sesungguhnya kami tidak mengetahui adakah (dengan adanya kawalan langit yang demikian) hendak menimpakan bala bencana kepada penduduk bumi, atau pun Tuhan mereka hendak melimpahkan kebaikan kepada mereka?"
  },
  {
    "surah": 72,
    "ayat": 11,
    "terjemahan": "`Dan bahawa sesungguhnya (memang maklum) ada di antara kita golongan yang baik keadaannya, dan ada di antara kita yang lain dari itu; kita masing-masing adalah menurut jalan dan cara yang berlainan."
  },
  {
    "surah": 72,
    "ayat": 12,
    "terjemahan": "`Dan bahawa sesungguhnya kita (sekarang) mengetahui, bahawa kita tidak sekali-kali akan dapat melepaskan diri dari balasan Allah (walau di mana sahaja kita berada) di bumi, dan kita juga tidak sekali-kali akan dapat melarikan diri dari balasanNya (walau ke langit sekalipun)."
  },
  {
    "surah": 72,
    "ayat": 13,
    "terjemahan": "`Dan bahawa sesungguhnya kami, ketika mendengar petunjuk (Al-Quran), kami beriman kepadanya (dengan tidak bertangguh lagi); kerana sesiapa yang beriman kepada Tuhannya, maka tidaklah ia akan merasa bimbang menanggung kerugian (mengenai amalnya yang baik), dan juga tidak akan ditimpakan sebarang kesusahan."
  },
  {
    "surah": 72,
    "ayat": 14,
    "terjemahan": "`Dan bahawa sesungguhnya (dengan datangnya Al-Quran, nyatalah) ada di antara kita golongan yang berugama Islam, dan ada pula golongan yang (kufur derhaka dengan) menyeleweng dari jalan yang benar; maka sesiapa yang menurut Islam (dengan beriman dan taat), maka merekalah golongan yang bersungguh-sungguh mencari dan menurut jalan yang benar,"
  },
  {
    "surah": 72,
    "ayat": 15,
    "terjemahan": "` Adapun orang-orang yang menyeleweng dari jalan yang benar, maka mereka menjadi bahan bakaran bagi neraka Jahannam. '"
  },
  {
    "surah": 72,
    "ayat": 16,
    "terjemahan": "(Nabi Muhammad diwahyukan menerangkan lagi): \"Dan bahawa sesungguhnya! Kalaulah mereka (manusia dan jin) itu berjalan betul di atas jalan (Islam), sudah tentu Kami (akan memberikan mereka sebab-sebab kemewahan, terutama) menurunkan hujan lebat kepada mereka."
  },
  {
    "surah": 72,
    "ayat": 17,
    "terjemahan": "\"(Pemberian yang demikian) untuk Kami menguji (dan menzahirkan bawaan dan keadaan) mereka dalam menikmati apa yang Kami berikan itu (adakah mereka bersyukur dan tetap betul menurut Islam); dan (ingatlah), sesiapa yang berpaling dari mengingati Tuhannya, (dengan berlaku ingkar - derhaka, maka) Tuhan akan memasukkannya ke dalam azab yang memuncak beratnya."
  },
  {
    "surah": 72,
    "ayat": 18,
    "terjemahan": "\"Dan bahawa sesungguhnya masjid-masjid itu untuk (ibadat kepada) Allah semata-mata; maka janganlah kamu seru dan sembah sesiapapun bersama-sama Allah."
  },
  {
    "surah": 72,
    "ayat": 19,
    "terjemahan": "\"Dan bahawa sesungguhnya, ketika hamba Allah (Nabi Muhammad) berdiri mengerjakan ibadat kepadaNya, mereka hampir-hampir menindih satu sama lain mengerumuninya\"."
  },
  {
    "surah": 72,
    "ayat": 20,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Sesungguhnya aku hanyalah beribadat kepada Tuhanku semata-mata, dan aku tidak mempersekutukanNya dengan sesiapapun\"."
  },
  {
    "surah": 72,
    "ayat": 21,
    "terjemahan": "Katakanlah lagi; \" Sesungguhnya aku tidak berkuasa mendatangkan sebarang mudarat dan tidak juga berkuasa mendatangkan sebarang kebaikan bagi kamu."
  },
  {
    "surah": 72,
    "ayat": 22,
    "terjemahan": "Katakanlah lagi; \"Sesungguhnya aku, tidak sekali-kali akan dapat diberi perlindungan oleh sesiapapun dari (azab) Allah (jika aku menderhaka kepadaNya), dan aku tidak sekali-kali akan mendapat tempat perlindungan selain daripadaNya,"
  },
  {
    "surah": 72,
    "ayat": 23,
    "terjemahan": "\"(Aku diberi kuasa) hanya menyampaikan (wahyu) dari Allah dan perintah-perintahNya (yang ditugaskan kepadaku menyampaikannya); dan sesiapa yang menderhaka kepada Allah dan ingkarkan bawaan RasulNya, maka sesungguhnya disediakan baginya neraka Jahannam; kekalah mereka di dalamnya selama-lamanya.\"."
  },
  {
    "surah": 72,
    "ayat": 24,
    "terjemahan": "(Golongan yang kufur ingkar itu tetap memandang engkau lemah dan kurang penyokong wahai Muhammad), sehingga apabila mereka melihat (azab) yang dijanjikan kepada mereka, maka (pada saat itu) mereka akan mengetahui siapakah orangnya yang lemah penolong-penolongnya, dan sedikit jumlah bilangannya."
  },
  {
    "surah": 72,
    "ayat": 25,
    "terjemahan": "(Kalau ditanya bilakah azab itu? Maka) katakanlah: \"Aku tidak mengetahui sama ada (azab) yang dijanjikan kepada kamu itu sudah dekat, atau Tuhanku menentukan bagi kedatangannya satu tempoh yang lanjut."
  },
  {
    "surah": 72,
    "ayat": 26,
    "terjemahan": "\"Tuhanlah sahaja yang mengetahui segala yang ghaib, maka Ia tidak memberitahu perkara ghaib yang diketahuiNya itu kepada sesiapapun, -"
  },
  {
    "surah": 72,
    "ayat": 27,
    "terjemahan": "\"Melainkan kepada mana-mana Rasul yang di redaiNya (untuk mengetahui sebahagian dari perkara ghaib yang berkaitan dengan tugasnya; apabila Tuhan hendak melakukan yang demikian) maka Ia mengadakan di hadapan dan di belakang Rasul itu malaikat-malaikat yang menjaga dan mengawasnya (sehingga perkara ghaib itu selamat sampai kepada yang berkenaan)."
  },
  {
    "surah": 72,
    "ayat": 28,
    "terjemahan": "\"(Tuhan mengadakan malaikat-malaikat itu) supaya Ia mengetahui bahawa sesungguhnya - (dengan jagaan mereka) - Rasul-rasul itu telah menyampaikan perutusan-perutusan Tuhan mereka, (dengan sempurna); pada hal Ia memang mengetahui dengan meliputi segala keadaan yang ada pada mereka, serta Ia menghitung tiap-tiap sesuatu: satu persatu\"."
  },
  {
    "surah": 73,
    "ayat": 1,
    "terjemahan": "Wahai orang yang berselimut!."
  },
  {
    "surah": 73,
    "ayat": 2,
    "terjemahan": "Bangunlah sembahyang Tahajjud pada waktu malam, selain dari sedikit masa (yang tak dapat tidak untuk berehat),"
  },
  {
    "surah": 73,
    "ayat": 3,
    "terjemahan": "Iaitu separuh dari waktu malam, atau kurangkan sedikit dari separuh itu,"
  },
  {
    "surah": 73,
    "ayat": 4,
    "terjemahan": "Ataupun lebihkan (sedikit) daripadanya; dan bacalah Al-Quran dengan \"Tartil\"."
  },
  {
    "surah": 73,
    "ayat": 5,
    "terjemahan": "(Sayugialah engkau dan pengikut-pengikutmu membiasakan diri masing-masing dengan ibadat yang berat kepada hawa nafsu, kerana) sesungguhnya Kami akan menurunkan kepadamu wahyu (Al-Quran yang mengandungi perintah-perintah) yang berat (kepada orang-orang yang tidak bersedia menyempurnakannya)."
  },
  {
    "surah": 73,
    "ayat": 6,
    "terjemahan": "Sebenarnya sembahyang dan ibadat malam lebih kuat kesannya (kepada jiwa), dan lebih tetap betul bacaannya."
  },
  {
    "surah": 73,
    "ayat": 7,
    "terjemahan": "(Kami galakkan engkau dan umatmu beribadat pada waktu malam), kerana sesungguhnya engkau pada siang hari mempunyai urusan-urusan yang panjang kira bicaranya;"
  },
  {
    "surah": 73,
    "ayat": 8,
    "terjemahan": "Dan sebutlah (dengan lidah dan hati) akan nama Tuhanmu (terus menerus siang dan malam), serta tumpukanlah (amal ibadatmu) kepadaNya dengan sebulat-bulat tumpuan."
  },
  {
    "surah": 73,
    "ayat": 9,
    "terjemahan": "Dia lah Tuhan yang menguasai timur dan barat; tiada Tuhan melainkan Dia; maka jadikanlah Dia Penjaga yang menyempurnakan urusanmu."
  },
  {
    "surah": 73,
    "ayat": 10,
    "terjemahan": "Dan bersabarlah terhadap apa yang dikatakan oleh mereka (yang menentangmu), dan jauhkanlah dirimu dari mereka dengan cara yang baik."
  },
  {
    "surah": 73,
    "ayat": 11,
    "terjemahan": "Dan biarkanlah Aku sahaja membalas orang-orang yang mendustakan (bawaanmu) itu, orang-orang yang berada dalam kemewahan, dan berilah tempoh kepada mereka sedikit masa;"
  },
  {
    "surah": 73,
    "ayat": 12,
    "terjemahan": "Kerana sesungguhnya di sisi Kami disediakan (untuk mereka) belenggu-belenggu dan neraka yang menjulang-julang,"
  },
  {
    "surah": 73,
    "ayat": 13,
    "terjemahan": "Serta makanan yang menjadikan pemakannya tercekik, dan azab seksa yang tidak terperi sakitnya."
  },
  {
    "surah": 73,
    "ayat": 14,
    "terjemahan": "(Azab itu tetap berlaku) pada hari bumi dan gunung-ganang bergoncang (serta hancur lebur), dan menjadilah gunung-ganang itu timbunan pasir yang mudah bersepah."
  },
  {
    "surah": 73,
    "ayat": 15,
    "terjemahan": "Sesungguhnya Kami telah mengutus kepada kamu (wahai umat Muhammad), seorang Rasul yang menjadi saksi terhadap kamu (tentang orang yang mematuhi atau menolak seruannya), sebagaimana Kami telah mengutus kepada Firaun seorang Rasul."
  },
  {
    "surah": 73,
    "ayat": 16,
    "terjemahan": "Maka Firaun menderhaka kepada Rasul itu, lalu Kami menyeksakannya dengan azab seksa yang seberat-beratnya."
  },
  {
    "surah": 73,
    "ayat": 17,
    "terjemahan": "(Sekiranya kamu tidak ditimpa azab di dunia), maka bagaimana kamu dapat menjaga dan menyelamatkan diri kamu - kalau kamu kufur ingkar - (dari azab) hari yang huru-haranya menyebabkan kanak-kanak menjadi tua beruban?"
  },
  {
    "surah": 73,
    "ayat": 18,
    "terjemahan": "Langit (yang demikian besarnya) akan pecah belah dengan sebab kedahsyatan hari itu. (Ingatlah), janji Allah adalah perkara yang tetap dilakukanNya."
  },
  {
    "surah": 73,
    "ayat": 19,
    "terjemahan": "Sesungguhnya (keterangan-keterangan yang mengandungi amaran) ini menjadi peringatan oleh itu sesiapa yang mahukan kebaikan dirinya dapatlah ia mengambil jalan yang membawa kepada Tuhannya (dengan iman dan taat)."
  },
  {
    "surah": 73,
    "ayat": 20,
    "terjemahan": "Sesungguhnya Tuhanmu (wahai Muhammad) mengetahui bahawasanya engkau bangun (sembahyang Tahajjud) selama kurang dari dua pertiga malam, dan selama satu perduanya, dan selama satu pertiganya; dan (demikian juga dilakukan oleh) segolongan dari orang-orang yang bersama-samamu (kerana hendak menepati perintah yang terdahulu); padahal Allah jualah yang menentukan dengan tepat kadar masa malam dan siang. Ia mengetahui bahawa kamu tidak sekali-kali akan dapat mengira dengan tepat kadar masa itu, lalu Ia menarik balik perintahNya yang terdahulu (dengan memberi kemudahan) kepada kamu; oleh itu bacalah mana-mana yang mudah kamu dapat membacanya dari Al-Quran (dalam sembahyang). Ia juga mengetahui bahawa akan ada di antara kamu orang-orang yang sakit; dan yang lainnya orang-orang yang musafir di muka bumi untuk mencari rezeki dari limpah kurnia Allah; dan yang lainnya lagi orang-orang yang berjuang pada jalan Allah (membela ugamaNya). Maka bacalah mana-mana yang sudah kamu dapat membacanya dari Al-Quran; dan dirikanlah sembahyang serta berikanlah zakat; dan berilah pinjaman kepada Allah sebagai pinjaman yang baik (ikhlas). Dan (ingatlah), apa jua kebaikan yang kamu kerjakan sebagai bekalan untuk diri kamu, tentulah kamu akan mendapat balasannya pada sisi Allah, -sebagai balasan yang sebaik-baiknya dan yang amat besar pahalanya. Dan mintalah ampun kepada Allah; sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani."
  },
  {
    "surah": 74,
    "ayat": 1,
    "terjemahan": "Wahai orang yang berselimut!"
  },
  {
    "surah": 74,
    "ayat": 2,
    "terjemahan": "Bangunlah serta berilah peringatan dan amaran (kepada umat manusia)."
  },
  {
    "surah": 74,
    "ayat": 3,
    "terjemahan": "Dan Tuhanmu, maka ucaplah dan ingatlah kebesaranNya!"
  },
  {
    "surah": 74,
    "ayat": 4,
    "terjemahan": "Dan pakaianmu, maka hendaklah engkau bersihkan."
  },
  {
    "surah": 74,
    "ayat": 5,
    "terjemahan": "Dan segala kejahatan, maka hendaklah engkau jauhi."
  },
  {
    "surah": 74,
    "ayat": 6,
    "terjemahan": "Dan janganlah engkau memberi (sesuatu, dengan tujuan hendak) mendapat lebih banyak daripadanya."
  },
  {
    "surah": 74,
    "ayat": 7,
    "terjemahan": "Dan bagi (menjalankan perintah) Tuhanmu, maka hendaklah engkau bersabar (terhadap tentangan musuh)!"
  },
  {
    "surah": 74,
    "ayat": 8,
    "terjemahan": "Kerana apabila telah ditiup sangkakala,"
  },
  {
    "surah": 74,
    "ayat": 9,
    "terjemahan": "Maka saat yang demikian adalah saat (berlakunya) hari yang sukar -"
  },
  {
    "surah": 74,
    "ayat": 10,
    "terjemahan": "Kepada orang-orang kafir, lagi tidak mudah (mengelak azabnya)."
  },
  {
    "surah": 74,
    "ayat": 11,
    "terjemahan": "(Jangan engkau bimbang wahai Muhammad) biarkanlah Aku sahaja membalas orang (yang menentangmu) yang Aku ciptakan dia (dalam keadaan) seorang diri (tidak berharta dan anak pinak),"
  },
  {
    "surah": 74,
    "ayat": 12,
    "terjemahan": "Dan Aku jadikan baginya harta kekayaan yang banyak,"
  },
  {
    "surah": 74,
    "ayat": 13,
    "terjemahan": "Serta anak pinak (yang ramai), yang sentiasa ada di sisinya."
  },
  {
    "surah": 74,
    "ayat": 14,
    "terjemahan": "Dan Aku mudahkan baginya (mendapat kekayaan dan kekuasaan) dengan semudah-mudahnya."
  },
  {
    "surah": 74,
    "ayat": 15,
    "terjemahan": "Kemudian ia ingin sangat, supaya Aku tambahi lagi;"
  },
  {
    "surah": 74,
    "ayat": 16,
    "terjemahan": "Tidak sekali-kali (akan ditambahi) ! Kerana sesungguhnya dia menentang dengan degilnya akan ayat-ayat Kami (Al-Quran, yang disampaikan oleh Rasul Kami)."
  },
  {
    "surah": 74,
    "ayat": 17,
    "terjemahan": "Aku akan menyeksanya (dengan azab) yang memuncak beratnya."
  },
  {
    "surah": 74,
    "ayat": 18,
    "terjemahan": "Kerana sesungguhnya ia telah memikirkan dan mereka-reka berbagai tuduhan terhadap Al-Quran) -"
  },
  {
    "surah": 74,
    "ayat": 19,
    "terjemahan": "Maka binasalah dia hendaknya! Bagaimanakah dia berani mereka-reka (yang demikian)?"
  },
  {
    "surah": 74,
    "ayat": 20,
    "terjemahan": "Sekali lagi: binasalah dia hendaknya! Bagaimana ia berani mereka-reka (tuduhan-tuduhan itu)?"
  },
  {
    "surah": 74,
    "ayat": 21,
    "terjemahan": "Kemudian ia merenung dan memikirkan (berkali-kali: jalan-jalan mencaci Al-Quran, tetapi ia gagal);"
  },
  {
    "surah": 74,
    "ayat": 22,
    "terjemahan": "Setelah itu ia memasamkan mukanya serta ia bertambah masam berkerut;"
  },
  {
    "surah": 74,
    "ayat": 23,
    "terjemahan": "Kemudian ia berpaling (dari kebenaran) dan berlaku sombong angkuh,"
  },
  {
    "surah": 74,
    "ayat": 24,
    "terjemahan": "Serta ia berkata: \" (Al-Quran) ini tidak lain hanyalah sihir yang dituntut serta dipelajari (dari ahli-ahlinya);"
  },
  {
    "surah": 74,
    "ayat": 25,
    "terjemahan": "\"Ini tidak lain hanyalah kata-kata (rekaan) manusia!\""
  },
  {
    "surah": 74,
    "ayat": 26,
    "terjemahan": "(Disebabkan kekufurannya itu) Aku akan masukkan dia ke dalam neraka Saqar."
  },
  {
    "surah": 74,
    "ayat": 27,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui kedahsyatan neraka Saqar itu?"
  },
  {
    "surah": 74,
    "ayat": 28,
    "terjemahan": "Ia membakar mangsanya dengan tidak meninggalkan sisa, dan tidak membiarkannya (binasa terus)"
  },
  {
    "surah": 74,
    "ayat": 29,
    "terjemahan": "Ia terus-menerus membakar kulit manusia!"
  },
  {
    "surah": 74,
    "ayat": 30,
    "terjemahan": "Pengawal dan penjaganya adalah sembilan belas (malaikat)."
  },
  {
    "surah": 74,
    "ayat": 31,
    "terjemahan": "Dan (ketahuilah bahawa hikmat) Kami tidak menjadikan pengawal-pengawal neraka itu melainkan (dari kalangan) malaikat, (kerana merekalah sekuat-kuat dan sebenar-benar makhluk yang menjalankan perintah Kami); dan (hikmat) Kami tidak menerangkan bilangan mereka melainkan dengan satu bilangan yang menyebabkan kesesatan dan kesengsaraan orang-orang kafir itu, supaya orang-orang yang diberi Kitab (Yahudi dan Nasrani) boleh percaya dengan yakin (akan kebenaran Al-Quran), dan supaya orang-orang yang beriman bertambah imannya; dan juga supaya orang-orang yang diberi Kitab dan orang-orang yang beriman itu tidak ragu-ragu (tentang kebenaran keterangan itu); dan (sebaliknya) supaya orang-orang (munafik) yang ada penyakit (ragu-ragu) dalam hatinya dan orang-orang kafir berkata: \"Apakah yang di maksudkan oleh Allah dengan menyebutkan bilangan ganjil ini?\" Demikianlah Allah menyesatkan sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya), dan memberi hidayah petunjuk kepada sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya); dan tiada yang mengetahui tentera Tuhanmu melainkan Dia lah sahaja. Dan (ingatlah, segala yang diterangkan berkenaan dengan) neraka itu tidak lain hanyalah menjadi peringatan bagi manusia."
  },
  {
    "surah": 74,
    "ayat": 32,
    "terjemahan": "Sebenarnya! Demi bulan,"
  },
  {
    "surah": 74,
    "ayat": 33,
    "terjemahan": "Dan malam apabila ia balik melenyapkan diri,"
  },
  {
    "surah": 74,
    "ayat": 34,
    "terjemahan": "Dan waktu subuh apabila ia terang-benderang,"
  },
  {
    "surah": 74,
    "ayat": 35,
    "terjemahan": "Sesungguhnya neraka Saqar itu adalah salah satu (malapetaka) yang amat besar,"
  },
  {
    "surah": 74,
    "ayat": 36,
    "terjemahan": "Yang menjadi amaran bagi umat manusia,"
  },
  {
    "surah": 74,
    "ayat": 37,
    "terjemahan": "(Iaitu) bagi sesiapa di antara kamu yang mahu maju (dalam mengerjakan kebaikan) atau yang mahu mundur (daripada mengerjakannya)."
  },
  {
    "surah": 74,
    "ayat": 38,
    "terjemahan": "Tiap-tiap diri terikat, tidak terlepas daripada (balasan buruk bagi amal jahat) yang dikerjakannya,"
  },
  {
    "surah": 74,
    "ayat": 39,
    "terjemahan": "Kecuali puak Kanan,"
  },
  {
    "surah": 74,
    "ayat": 40,
    "terjemahan": "(Mereka ditempatkan) di dalam Syurga (yang penuh nikmat), mereka bertanya-tanya,"
  },
  {
    "surah": 74,
    "ayat": 41,
    "terjemahan": "Tentang (tempat tinggal) orang-orang yang bersalah,"
  },
  {
    "surah": 74,
    "ayat": 42,
    "terjemahan": "(Setelah melihat orang-orang yang bersalah itu, mereka berkata): \"Apakah yang menyebabkan kamu masuk ke dalam (neraka) Saqar?\""
  },
  {
    "surah": 74,
    "ayat": 43,
    "terjemahan": "Orang-orang yang bersalah itu menjawab: \"Kami tidak termasuk dalam kumpulan orang-orang yang mengerjakan sembahyang;"
  },
  {
    "surah": 74,
    "ayat": 44,
    "terjemahan": "\"Dan kami tidak pernah memberi makan orang-orang miskin;"
  },
  {
    "surah": 74,
    "ayat": 45,
    "terjemahan": "\"Dan kami dahulu selalu mengambil bahagian memperkatakan perkara yang salah, bersama-sama orang-orang yang memperkatakannya;"
  },
  {
    "surah": 74,
    "ayat": 46,
    "terjemahan": "\"Dan kami sentiasa mendustakan hari pembalasan,"
  },
  {
    "surah": 74,
    "ayat": 47,
    "terjemahan": "\"Sehinggalah kami didatangi oleh perkara yang tetap diyakini\"."
  },
  {
    "surah": 74,
    "ayat": 48,
    "terjemahan": "Maka tidak akan berguna kepada mereka sebarang syafaat pertolongan (kalaulah ditakdirkan ada) sesiapa yang boleh memberikan syafaat itu."
  },
  {
    "surah": 74,
    "ayat": 49,
    "terjemahan": "(Kalau demikianlah halnya orang-orang yang bersalah), maka mengapa mereka berpaling lari dari peringatan (Al-Quran) ?"
  },
  {
    "surah": 74,
    "ayat": 50,
    "terjemahan": "Seolah-olah mereka sekawan keldai liar yang lari,"
  },
  {
    "surah": 74,
    "ayat": 51,
    "terjemahan": "Melarikan diri (ketakutan) dari singa!"
  },
  {
    "surah": 74,
    "ayat": 52,
    "terjemahan": "(Mereka tidak merasa cukup dengan peringatan itu) bahkan tiap-tiap seorang di antaranya mahu supaya diberi kepadanya lembaran surat yang terbuka (yang diturunkan dari langit untuk dibaca oleh mereka sendiri)."
  },
  {
    "surah": 74,
    "ayat": 53,
    "terjemahan": "Sebenarnya! (Bukan kerana kemahuan mereka tidak berhasil), bahkan mereka (tidak percaya dan) tidak takut akan hari akhirat."
  },
  {
    "surah": 74,
    "ayat": 54,
    "terjemahan": "Ketahuilah! Sesungguhnya Al-Quran itu adalah satu peringatan (yang sangat besar pengajarannya);"
  },
  {
    "surah": 74,
    "ayat": 55,
    "terjemahan": "Oleh itu sesiapa yang mahu (beringat) dapatlah ia mengambil peringatan daripadanya."
  },
  {
    "surah": 74,
    "ayat": 56,
    "terjemahan": "Dan (dalam pada itu) tiadalah mereka dapat beringat melainkan jika dikehendaki Allah; Dia lah Tuhan yang berhak dipatuhi perintahNya, dan Dia lah jua yang berhak memberi keampunan (kepada orang-orang yang beriman dan taat)."
  },
  {
    "surah": 75,
    "ayat": 1,
    "terjemahan": "Aku bersumpah dengan Hari Kiamat;"
  },
  {
    "surah": 75,
    "ayat": 2,
    "terjemahan": "Dan Aku bersumpah dengan \"Nafsul Lawwaamah\" (Bahawa kamu akan dibangkitkan sesudah mati)!"
  },
  {
    "surah": 75,
    "ayat": 3,
    "terjemahan": "Patutkah manusia (yang kafir) menyangka bahawa Kami tidak akan dapat mengumpulkan tulang-tulangnya (dan menghidupkannya semula)?"
  },
  {
    "surah": 75,
    "ayat": 4,
    "terjemahan": "Bukan sebagaimana yang disangka itu, bahkan Kami berkuasa menyusun (dengan sempurnanya segala tulang) jarinya, (tulang yang lebih halus dari yang lain)."
  },
  {
    "surah": 75,
    "ayat": 5,
    "terjemahan": "(Kebenaran itu bukan tidak ada buktinya), bahkan manusia (yang ingkar) sentiasa suka hendak meneruskan perbuatan kufur dan maksiat (di sepanjang hayatnya, sehingga ia tidak mengakui adanya hari kiamat)."
  },
  {
    "surah": 75,
    "ayat": 6,
    "terjemahan": "Dia bertanya (secara mengejek): \"Bilakah datangnya hari kiamat itu?\""
  },
  {
    "surah": 75,
    "ayat": 7,
    "terjemahan": "Maka (jawabnya: hari kiamat akan datang) apabila pemandangan menjadi terpendar-pendar (kerana gerun takut),"
  },
  {
    "surah": 75,
    "ayat": 8,
    "terjemahan": "Dan bulan hilang cahayanya,"
  },
  {
    "surah": 75,
    "ayat": 9,
    "terjemahan": "Dan matahari serta bulan dihimpunkan bersama,"
  },
  {
    "surah": 75,
    "ayat": 10,
    "terjemahan": "(Maka) pada hari itu, berkatalah manusia (yang ingkarkan hari kiamat): \"Ke manakah hendak melarikan diri?\""
  },
  {
    "surah": 75,
    "ayat": 11,
    "terjemahan": "Tak usahlah bertanya demikian! Tidak ada lagi tempat perlindungan!"
  },
  {
    "surah": 75,
    "ayat": 12,
    "terjemahan": "Pada hari itu, kepada Tuhanmu lah sahaja terserahnya ketetapan segala perkara."
  },
  {
    "surah": 75,
    "ayat": 13,
    "terjemahan": "Pada hari itu, manusia diberitahu akan apa yang ia telah lakukan, dan apa yang ia telah tinggalkan."
  },
  {
    "surah": 75,
    "ayat": 14,
    "terjemahan": "Bahkan manusia itu, (anggotanya) menjadi saksi terhadap dirinya sendiri,"
  },
  {
    "surah": 75,
    "ayat": 15,
    "terjemahan": "Walaupun ia memberikan alasan-alasannya (untuk membela diri)."
  },
  {
    "surah": 75,
    "ayat": 16,
    "terjemahan": "Janganlah engkau (wahai Muhammad) - Kerana hendakkan cepat menghafaz Quran yang diturunkan kepadamu - menggerakkan lidahmu membacanya (sebelum selesai dibacakan kepadamu)."
  },
  {
    "surah": 75,
    "ayat": 17,
    "terjemahan": "Sesungguhnya Kamilah yang berkuasa mengumpulkan Al-Quran itu (dalam dadamu), dan menetapkan bacaannya (pada lidahmu);"
  },
  {
    "surah": 75,
    "ayat": 18,
    "terjemahan": "Oleh itu, apabila Kami telah menyempurnakan bacaannya (kepadamu, dengan perantaraan Jibril), maka bacalah menurut bacaannya itu;"
  },
  {
    "surah": 75,
    "ayat": 19,
    "terjemahan": "Kemudian, sesungguhnya kepada Kamilah terserah urusan menjelaskan kandungannya (yang memerlukan penjelasan)."
  },
  {
    "surah": 75,
    "ayat": 20,
    "terjemahan": "Sedarlah wahai orang-orang yang lalai. (Sebenarnya kamu tidak ingatkan kesudahan kamu) bahkan kamu sentiasa mencintai (Kesenangan dan kemewahan dunia) yang cepat habisnya."
  },
  {
    "surah": 75,
    "ayat": 21,
    "terjemahan": "Dan kamu tidak menghiraukan (bekalan untuk) hari akhirat (yang kekal abadi kehidupannya)."
  },
  {
    "surah": 75,
    "ayat": 22,
    "terjemahan": "Pada hari akhirat itu, muka (orang-orang yang beriman) berseri-seri;"
  },
  {
    "surah": 75,
    "ayat": 23,
    "terjemahan": "Melihat kepada Tuhannya."
  },
  {
    "surah": 75,
    "ayat": 24,
    "terjemahan": "Dan pada hari itu, muka (orang-orang kafir) muram hodoh,"
  },
  {
    "surah": 75,
    "ayat": 25,
    "terjemahan": "Sambil percaya dengan yakin bahawa mereka akan ditimpa malapetaka (azab seksa) yang membinasakan."
  },
  {
    "surah": 75,
    "ayat": 26,
    "terjemahan": "Sedarlah (janganlah mengutamakan dunia dan melupakan akhirat. Ingatlah akan hal orang yang hendak mati) apabila rohnya sampai ke pangkal kerongkong,"
  },
  {
    "surah": 75,
    "ayat": 27,
    "terjemahan": "Dan (orang-orang yang hadir di sisinya heboh) berkata: \"Siapakah yang dapat menawar jampi (dan mengubatnya)?\""
  },
  {
    "surah": 75,
    "ayat": 28,
    "terjemahan": "Dan ia sendiri yakin, bahawa sesungguhnya saat itu saat perpisahan;"
  },
  {
    "surah": 75,
    "ayat": 29,
    "terjemahan": "Serta kedahsyatan bertindih-tindih;"
  },
  {
    "surah": 75,
    "ayat": 30,
    "terjemahan": "(Maka) kepada Tuhanmu lah - pada waktu itu - engkau dibawa (untuk menerima balasan)."
  },
  {
    "surah": 75,
    "ayat": 31,
    "terjemahan": "(Oleh sebab orang yang kufur ingkar tidak percayakan hari akhirat) maka ia tidak mengakui kebenaran (yang diwajibkan meyakininya) dan ia tidak mengerjakan sembahyang (yang difardhukan mengerjakannya)!"
  },
  {
    "surah": 75,
    "ayat": 32,
    "terjemahan": "Akan tetapi ia mendustakan, dan berpaling ingkar!"
  },
  {
    "surah": 75,
    "ayat": 33,
    "terjemahan": "Kemudian ia pergi kepada keluarganya dengan berlagak sombong megah."
  },
  {
    "surah": 75,
    "ayat": 34,
    "terjemahan": "(Wahai orang yang kufur ingkar!) sudahlah dekat kepadamu kebinasaanmu, sudahlah dekat!"
  },
  {
    "surah": 75,
    "ayat": 35,
    "terjemahan": "Kemudian api nerakalah lebih layak bagimu, lebih layak."
  },
  {
    "surah": 75,
    "ayat": 36,
    "terjemahan": "Patutkah manusia menyangka, bahawa ia akan ditinggalkan terbiar (dengan tidak diberikan tanggungjawab dan tidak dihidupkan menerima balasan)?"
  },
  {
    "surah": 75,
    "ayat": 37,
    "terjemahan": "Bukankah ia berasal dari air mani yang dipancarkan (ke dalam rahim)?"
  },
  {
    "surah": 75,
    "ayat": 38,
    "terjemahan": "Kemudian air mani itu menjadi sebuku darah beku, sesudah itu Tuhan menciptakannya, dan menyempurnakan kejadiannya (sebagai manusia)?"
  },
  {
    "surah": 75,
    "ayat": 39,
    "terjemahan": "Lalu Tuhan menjadikan daripadanya dua jenis - lelaki dan perempuan."
  },
  {
    "surah": 75,
    "ayat": 40,
    "terjemahan": "Adakah (Tuhan yang menjadikan semuanya) itu - tidak berkuasa menghidupkan orang-orang yang mati? (Tentulah berkuasa)!"
  },
  {
    "surah": 76,
    "ayat": 1,
    "terjemahan": "Bukankah telah berlalu kepada manusia satu ketika dari masa (yang beredar), sedang ia (masih belum wujud lagi, dan) tidak menjadi sesuatu benda yang disebut-sebut, (maka mengapa kaum musyrik itu mengingkari hari akhirat)?"
  },
  {
    "surah": 76,
    "ayat": 2,
    "terjemahan": "Sesungguhnya Kami telah aturkan cara mencipta manusia bermulanya dari air mani yang bercampur (dari pati benih lelaki dan perempuan), serta Kami tetap mengujinya (dengan kewajipan-kewajipan); oleh itu maka Kami jadikan dia berkeadaan mendengar dan melihat."
  },
  {
    "surah": 76,
    "ayat": 3,
    "terjemahan": "Kerana keadaan itu tidak mencukupi, maka) sesungguhnya Kami telah menunjukkan kepadanya (melalui akal dan Rasul) akan jalan-jalan (yang benar dan yang salah; maka terserahlah kepadanya) sama ada ia bersyukur (dengan beriman dan taat), ataupun ia berlaku kufur (dengan mengingkari kebenaran atau menderhaka)."
  },
  {
    "surah": 76,
    "ayat": 4,
    "terjemahan": "(Dalam pada itu), sesungguhnya Kami telah menyediakan bagi sesiapa yang berlaku kufur (atau menderhaka): beberapa rantai dan belenggu serta neraka yang menjulang-julang."
  },
  {
    "surah": 76,
    "ayat": 5,
    "terjemahan": "Sesungguhnya orang-orang yang berbakti (dengan taat dan kebajikan), akan meminum dari piala: sejenis minuman yang bercampur dengan \"Kafur\", -"
  },
  {
    "surah": 76,
    "ayat": 6,
    "terjemahan": "Iaitu sebuah matair (di Syurga), yang diminum daripadanya oleh hamba-hamba Allah (yang taat); mereka boleh mengalirkannya (di tempat-tempat tinggal mereka) dengan aliran yang semudah-mudahnya dan menurut kemahuannya."
  },
  {
    "surah": 76,
    "ayat": 7,
    "terjemahan": "(Mereka dikurniakan kesenangan itu kerana) mereka menyempurnakan nazarnya (apatah lagi yang diwajibkan Tuhan kepadanya), serta mereka takutkan hari (akhirat) yang azab seksanya merebak di sana sini."
  },
  {
    "surah": 76,
    "ayat": 8,
    "terjemahan": "Mereka juga memberi makan benda-benda makanan yang dihajati dan disukainya, kepada orang miskin dan anak yatim serta orang tawanan,"
  },
  {
    "surah": 76,
    "ayat": 9,
    "terjemahan": "(Sambil berkata dengan lidah atau dengan hati): \"Sesungguhnya kami memberi makan kepada kamu kerana Allah semata-mata; kami tidak berkehendakkan sebarang balasan dari kamu atau ucapan terima kasih,"
  },
  {
    "surah": 76,
    "ayat": 10,
    "terjemahan": "\"Kami sebenarnya takutkan Tuhan kami, takut Ia kenakan kami azab hari yang padanya muka orang-orang yang bersalah: masam berkerut-kerut\"."
  },
  {
    "surah": 76,
    "ayat": 11,
    "terjemahan": "Dengan sebab (mereka menjaga diri dari kesalahan), maka Allah selamatkan mereka dari kesengsaraan hari yang demikian keadaannya, serta memberikan kepada mereka keindahan yang berseri-seri (di muka), dan perasaan ria gembira (di hati)."
  },
  {
    "surah": 76,
    "ayat": 12,
    "terjemahan": "Dan kerana kesabaran mereka (mengerjakan suruhan Allah dan meninggalkan laranganNya), mereka dibalas oleh Allah dengan Syurga dan (persalinan dari) sutera."
  },
  {
    "surah": 76,
    "ayat": 13,
    "terjemahan": "Mereka berehat di dalam Syurga dengan berbaring di atas pelamin-pelamin (yang berhias), mereka tidak nampak di situ adanya matahari (usahkan hawa panasnya), dan tidak juga merasai suasana yang terlampau sejuk;"
  },
  {
    "surah": 76,
    "ayat": 14,
    "terjemahan": "Sedang naungan pohon-pohon Syurga itu dekat kepada mereka, dan buah-buahannya pula dimudahkan (untuk mereka memetiknya) dengan semudah-mudahnya."
  },
  {
    "surah": 76,
    "ayat": 15,
    "terjemahan": "Dan (selain itu) diedarkan kepada mereka (oleh pelayan-pelayannya): bijana dari perak dan piala-piala minuman yang keadaannya laksana kaca (nampak jelas isinya) -"
  },
  {
    "surah": 76,
    "ayat": 16,
    "terjemahan": "(Keadaannya laksana) kaca, (sedang ia) dari perak; pelayan-pelayan itu menentukan kadar isinya sekadar yang cukup betul dengan kehendak penggunanya."
  },
  {
    "surah": 76,
    "ayat": 17,
    "terjemahan": "Dan mereka dalam Syurga itu, diberi minum sejenis minuman yang campurannya dari \"Zanjabil\","
  },
  {
    "surah": 76,
    "ayat": 18,
    "terjemahan": "Iaitu sebuah matair dalam Syurga, yang disebutkan sifatnya sebagai \"Salsabil\"."
  },
  {
    "surah": 76,
    "ayat": 19,
    "terjemahan": "Dan mereka dilayani oleh anak-anak muda lelaki yang tetap kekal (dalam keadaan mudanya), yang sentiasa beredar di sekitar mereka; apabila engkau melihat anak-anak muda itu, nescaya engkau menyangkanya mutiara yang bertaburan."
  },
  {
    "surah": 76,
    "ayat": 20,
    "terjemahan": "Dan apabila engkau melihat di sana (dalam Syurga itu), engkau melihat nikmat yang melimpah-limpah dan kerajaan yang besar (yang tidak ada bandingannya)."
  },
  {
    "surah": 76,
    "ayat": 21,
    "terjemahan": "Mereka di dalam Syurga memakai pakaian hijau yang diperbuat dari sutera halus dan sutera tebal (yang bertekat), serta mereka dihiasi dengan gelang-gelang tangan dari perak; dan mereka diberi minum oleh Tuhan mereka dengan sejenis minuman (yang lain) yang bersih suci."
  },
  {
    "surah": 76,
    "ayat": 22,
    "terjemahan": "(Serta dikatakan kepada mereka): \"Sesungguhnya (segala pemberian) ini adalah untuk kamu sebagai balasan, dan adalah usaha amal kamu (di dunia dahulu) diterima dan dihargai (oleh Allah)\"."
  },
  {
    "surah": 76,
    "ayat": 23,
    "terjemahan": "Sesungguhnya Kami telah menurunkan Al-Quran kepadamu (wahai Muhammad), dengan beransur-ansur."
  },
  {
    "surah": 76,
    "ayat": 24,
    "terjemahan": "Oleh itu hendaklah engkau bersabar menerima hukum Tuhanmu (memberi tempoh kepada golongan yang menentangmu), dan janganlah engkau menurut kehendak orang yang berdosa di antara mereka, atau orang yang kufur ingkar."
  },
  {
    "surah": 76,
    "ayat": 25,
    "terjemahan": "Dan sebutlah dengan lidah atau dengan hati akan nama Tuhanmu (di dalam dan di luar sembahyang), pada waktu pagi dan petang;"
  },
  {
    "surah": 76,
    "ayat": 26,
    "terjemahan": "Dan (dengan apa keadaan pun maka) pada sebahagian dari waktu malam sujudlah kepada Tuhan (dengan mengerjakan sembahyang), dan (seboleh-bolehnya) bertasbihlah memujiNya (dengan mengerjakan sembahyang Tahajjud), pada sebahagian yang panjang dari waktu malam."
  },
  {
    "surah": 76,
    "ayat": 27,
    "terjemahan": "Sesungguhnya orang-orang (yang menentangmu) itu sentiasa mencintai (kesenangan dan kemewahan dunia) yang cepat habisnya, serta mereka membelakangkan (tidak menghiraukan bekalan) untuk hari akhirat yang amat berat (penderitaannya kepada orang-orang yang tidak bertaqwa)."
  },
  {
    "surah": 76,
    "ayat": 28,
    "terjemahan": "Kamilah yang menciptakan mereka serta menguatkan tulang sendi dan urat saraf mereka; (Kami berkuasa membinasakan mereka) dan apabila Kami kehendaki, Kami gantikan (mereka dengan) orang-orang yang serupa dengan mereka, dengan penggantian yang sebaik-baiknya."
  },
  {
    "surah": 76,
    "ayat": 29,
    "terjemahan": "Sesungguhnya (segala keterangan yang disebutkan) ini, menjadi peringatan; maka sesiapa yang mahukan (kebaikan dirinya) bolehlah ia mengambil jalan yang menyampaikan kepada keredaan Allah (dengan iman dan taat)."
  },
  {
    "surah": 76,
    "ayat": 30,
    "terjemahan": "Dan tiadalah kamu berkemahuan (melakukan sesuatu perkara) melainkan dengan cara yang dikehendaki Allah; sesungguhnya Allah adalah Maha Mengetahui, lagi Maha Bijaksana (mengaturkan sebarang perkara yang dikehendakiNya)."
  },
  {
    "surah": 76,
    "ayat": 31,
    "terjemahan": "Ia memasukkan sesiapa yang dikehendakiNya (menurut aturan yang ditetapkan) ke dalam rahmatNya (dengan ditempatkannya di dalam Syurga); dan orang-orang yang zalim, Ia menyediakan untuk mereka azab seksa yang tidak terperi sakitnya."
  },
  {
    "surah": 77,
    "ayat": 1,
    "terjemahan": "Demi (makhluk-makhluk) yang dihantarkan berturut-turut (menjalankan tugasnya),"
  },
  {
    "surah": 77,
    "ayat": 2,
    "terjemahan": "Juga yang merempuh mara dengan sekencang-kencangnya,"
  },
  {
    "surah": 77,
    "ayat": 3,
    "terjemahan": "Dan demi (makhluk-makhluk) yang menyebarkan (pengajaran dan peringatan) dengan sebaran yang sesungguh-sungguhnya,"
  },
  {
    "surah": 77,
    "ayat": 4,
    "terjemahan": "Serta yang memisahkan (antara yang benar dengan yang salah) dengan pemisahan yang sejelas-jelasnya,"
  },
  {
    "surah": 77,
    "ayat": 5,
    "terjemahan": "Lalu menyampaikan pengajaran dan peringatan (kepada manusia),"
  },
  {
    "surah": 77,
    "ayat": 6,
    "terjemahan": "Untuk menghapuskan kesalahan orang-orang yang bertaubat serta memperbaiki keadaan dirinya, dan untuk menakutkan orang-orang yang ingkar - derhaka; -"
  },
  {
    "surah": 77,
    "ayat": 7,
    "terjemahan": "(Sumpah demi sumpah) sesungguhnya segala yang dijanjikan kepada kamu tetap berlaku."
  },
  {
    "surah": 77,
    "ayat": 8,
    "terjemahan": "Oleh itu, apabila bintang-bintang (binasa dan) hilang lenyap;"
  },
  {
    "surah": 77,
    "ayat": 9,
    "terjemahan": "Dan apabila langit terbelah;"
  },
  {
    "surah": 77,
    "ayat": 10,
    "terjemahan": "Dan apabila gunung-ganang hancur lebur berterbangan;"
  },
  {
    "surah": 77,
    "ayat": 11,
    "terjemahan": "Dan apabila Rasul-rasul ditentukan waktunya untuk dipanggil menjadi saksi terhadap umatnya, (maka sudah tentu manusia akan menerima balasan masing-masing)."
  },
  {
    "surah": 77,
    "ayat": 12,
    "terjemahan": "(Jika ditanya): ke hari yang manakah (perkara-perkara yang besar) itu ditangguhkan?"
  },
  {
    "surah": 77,
    "ayat": 13,
    "terjemahan": "(Jawabnya): Ke hari pemutusan hukum."
  },
  {
    "surah": 77,
    "ayat": 14,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui kedahsyatan hari pemutusan hukum itu?"
  },
  {
    "surah": 77,
    "ayat": 15,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (apa yang dijanjikan oleh Rasulnya)!"
  },
  {
    "surah": 77,
    "ayat": 16,
    "terjemahan": "Bukankah Kami telah binasakan orang-orang dahulu (yang ingkar derhaka, seperti kaum Nabi Nuh, Aad dan Thamud)?"
  },
  {
    "surah": 77,
    "ayat": 17,
    "terjemahan": "Kemudian kami akan iringi mereka dengan (membinasakan orang-orang yang ingkar derhaka, dari) kaum-kaum yang datang kemudian."
  },
  {
    "surah": 77,
    "ayat": 18,
    "terjemahan": "Demikian cara kami lakukan terhadap sesiapa yang berdosa."
  },
  {
    "surah": 77,
    "ayat": 19,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (apa yang Kami janjikan)!"
  },
  {
    "surah": 77,
    "ayat": 20,
    "terjemahan": "Bukankah Kami telah menciptakan kamu dari air (benih) yang sedikit dipandang orang?"
  },
  {
    "surah": 77,
    "ayat": 21,
    "terjemahan": "Lalu Kami jadikan air (benih) itu pada tempat penetapan yang kukuh,"
  },
  {
    "surah": 77,
    "ayat": 22,
    "terjemahan": "Hingga ke suatu masa yang termaklum?"
  },
  {
    "surah": 77,
    "ayat": 23,
    "terjemahan": "Serta Kami tentukan (keadaannya), maka Kamilah sebaik-baik yang berkuasa menentukan dan melakukan (tiap-tiap sesuatu)!"
  },
  {
    "surah": 77,
    "ayat": 24,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (kekuasaan Kami)!"
  },
  {
    "surah": 77,
    "ayat": 25,
    "terjemahan": "Bukankah Kami telah menjadikan bumi (sebagai tempat) penampung dan penghimpun (penduduknya)? -"
  },
  {
    "surah": 77,
    "ayat": 26,
    "terjemahan": "Yang hidup dan yang mati?"
  },
  {
    "surah": 77,
    "ayat": 27,
    "terjemahan": "Dan Kami telah jadikan di bumi: gunung-ganang yang menetapnya, yang tinggi menjulang; dan Kami telah memberi minum kepada kamu air yang tawar lagi memuaskan dahaga?"
  },
  {
    "surah": 77,
    "ayat": 28,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (nikmat-nikmat pemberian Kami)!"
  },
  {
    "surah": 77,
    "ayat": 29,
    "terjemahan": "(Dikatakan kepada mereka semasa ditimpakan dengan azab): \"Pergilah kepada azab yang dahulu kamu mendustakannya."
  },
  {
    "surah": 77,
    "ayat": 30,
    "terjemahan": "\"Pergilah kamu kepada naungan (asap neraka) yang bercabang tiga, -"
  },
  {
    "surah": 77,
    "ayat": 31,
    "terjemahan": "\"Yang tidak dapat dijadikan naungan, dan tidak dapat memberikan sebarang lindungan dari julangan api neraka."
  },
  {
    "surah": 77,
    "ayat": 32,
    "terjemahan": "\"Sesungguhnya neraka itu melemparkan bunga api, (yang besarnya) seperti bangunan besar,"
  },
  {
    "surah": 77,
    "ayat": 33,
    "terjemahan": "\"(Banyaknya dan warnanya) bunga api itu seolah-olah rombongan unta kuning\"."
  },
  {
    "surah": 77,
    "ayat": 34,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (keadaan yang demikian)."
  },
  {
    "surah": 77,
    "ayat": 35,
    "terjemahan": "Inilah hari mereka tidak dapat berkata-kata, (kerana masing-masing terpinga-pinga ketakutan),"
  },
  {
    "surah": 77,
    "ayat": 36,
    "terjemahan": "Dan tidak pula diizinkan mereka bercakap, maka mereka tidak dapat meminta maaf."
  },
  {
    "surah": 77,
    "ayat": 37,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (hari akhirat)!"
  },
  {
    "surah": 77,
    "ayat": 38,
    "terjemahan": "Inilah hari pemutusan hukum (yang menentukan siapa yang benar dan siapa yang salah). Kami himpunkan kamu bersama orang-orang yang terdahulu (dari kamu)."
  },
  {
    "surah": 77,
    "ayat": 39,
    "terjemahan": "Oleh itu, kalau kamu ada sebarang tipu-helah melepaskan diri, maka cubalah kamu lakukan terhadap azabKu."
  },
  {
    "surah": 77,
    "ayat": 40,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (apa yang telah dijanjikan oleh Allah)!"
  },
  {
    "surah": 77,
    "ayat": 41,
    "terjemahan": "Sesungguhnya orang-orang yang bertaqwa berada di tempat teduh (yang dipenuhi pelbagai nikmat), dan yang berdekatan dengan matair-matair (yang mengalir), -"
  },
  {
    "surah": 77,
    "ayat": 42,
    "terjemahan": "Serta menikmati buah-buahan dari segala jenis yang mereka ingini."
  },
  {
    "surah": 77,
    "ayat": 43,
    "terjemahan": "(Pada ketika itu dikatakan kepada mereka): \"Makanlah dan minumlah kamu dengan lazatnya, disebabkan apa yang kamu telah kerjakan.\""
  },
  {
    "surah": 77,
    "ayat": 44,
    "terjemahan": "Sesungguhnya, demikianlah Kami membalas orang-orang yang berusaha mengerjakan amal-amal yang baik."
  },
  {
    "surah": 77,
    "ayat": 45,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (nikmat-nikmat Syurga)!"
  },
  {
    "surah": 77,
    "ayat": 46,
    "terjemahan": "Makanlah dan bersenang-senanglah kamu (wahai orang-orang yang ingkar derhaka) sementara waktu hidup, (kemudian kamu akan menghadapi bahaya), kerana sesungguhnya kamu adalah orang-orang yang berdosa."
  },
  {
    "surah": 77,
    "ayat": 47,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (amaran Allah), -"
  },
  {
    "surah": 77,
    "ayat": 48,
    "terjemahan": "Dan apabila dikatakan kepada mereka (yang ingkar): \"Taatlah dan kerjakanlah sembahyang\", mereka enggan mengerjakannya."
  },
  {
    "surah": 77,
    "ayat": 49,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan (perintah-perintah Allah dan laranganNya)!"
  },
  {
    "surah": 77,
    "ayat": 50,
    "terjemahan": "(Kalau mereka tidak juga mahu beriman kepada keterangan-keterangan yang tersebut) maka kepada perkataan yang mana lagi, sesudah itu, mereka mahu beriman?"
  },
  {
    "surah": 78,
    "ayat": 1,
    "terjemahan": "Tentang apakah mereka bertanya-tanya?"
  },
  {
    "surah": 78,
    "ayat": 2,
    "terjemahan": "Tentang berita yang besar, (berita kebangkitan manusia hidup semula menerima balasannya)."
  },
  {
    "surah": 78,
    "ayat": 3,
    "terjemahan": "Yang mereka (ragu-ragu dan) berselisihan mengenainya."
  },
  {
    "surah": 78,
    "ayat": 4,
    "terjemahan": "Jangan! (Janganlah mereka bersikap demikian!) Mereka akan mengetahui (dengan yakin tentang kebenaran hari balasan itu)."
  },
  {
    "surah": 78,
    "ayat": 5,
    "terjemahan": "Sekali lagi jangan! (Janganlah mereka berselisihan!) Mereka akan mengetahui kelak (tentang apa yang akan menimpa mereka)."
  },
  {
    "surah": 78,
    "ayat": 6,
    "terjemahan": "(Mengapa kamu ragu-ragukan kekuasaan Kami menghidupkan semula orang-orang yang telah mati?) Bukankah Kami telah menjadikan bumi (terbentang luas) sebagai hamparan?"
  },
  {
    "surah": 78,
    "ayat": 7,
    "terjemahan": "Dan gunung-ganang sebagai pancang pasaknya?"
  },
  {
    "surah": 78,
    "ayat": 8,
    "terjemahan": "Dan Kami telah menciptakan kamu berpasang-pasang?"
  },
  {
    "surah": 78,
    "ayat": 9,
    "terjemahan": "Dan Kami telah menjadikan tidur kamu untuk berehat?"
  },
  {
    "surah": 78,
    "ayat": 10,
    "terjemahan": "Dan Kami telah menjadikan malam (dengan gelapnya) sebagai pakaian (yang melindungi)?"
  },
  {
    "surah": 78,
    "ayat": 11,
    "terjemahan": "Dan Kami telah menjadikan siang (dengan cahaya terangnya) - masa untuk mencari rezeki?"
  },
  {
    "surah": 78,
    "ayat": 12,
    "terjemahan": "Dan Kami telah membina di atas kamu tujuh petala (langit) yang kuat kukuh?"
  },
  {
    "surah": 78,
    "ayat": 13,
    "terjemahan": "Dan Kami telah mengadakan matahari menjadi lampu yang terang-benderang cahayanya?"
  },
  {
    "surah": 78,
    "ayat": 14,
    "terjemahan": "Dan Kami telah menurunkan dari awan, air (hujan) yang mencurah-curah, -"
  },
  {
    "surah": 78,
    "ayat": 15,
    "terjemahan": "Untuk Kami mengeluarkan dengan air itu, biji-bijian dan tumbuh-tumbuhan, -"
  },
  {
    "surah": 78,
    "ayat": 16,
    "terjemahan": "Serta kebun-kebun yang subur bertaut-taut pokoknya?"
  },
  {
    "surah": 78,
    "ayat": 17,
    "terjemahan": "Sesungguhnya hari pemutusan hukum itu, adalah satu masa yang ditentukan,"
  },
  {
    "surah": 78,
    "ayat": 18,
    "terjemahan": "Iaitu masa ditiup sangkakala, lalu kamu (bangkit hidup) serta datang berpuak-puak (ke Padang Mahsyar);"
  },
  {
    "surah": 78,
    "ayat": 19,
    "terjemahan": "Dan (pada masa itu) langit dipecah belahkan sehingga tiap-tiap belahannya menjadi ibarat pintu yang terbuka luas,"
  },
  {
    "surah": 78,
    "ayat": 20,
    "terjemahan": "Dan gunung-ganang - setelah dihancurkan - diterbangkan ke angkasa, lalu menjadilah ia bayangan semata-mata seperti riak sinaran panas di padang pasir."
  },
  {
    "surah": 78,
    "ayat": 21,
    "terjemahan": "Sesungguhnya neraka Jahannam adalah disediakan -"
  },
  {
    "surah": 78,
    "ayat": 22,
    "terjemahan": "Untuk orang-orang yang melampaui batas hukum Tuhan, sebagai tempat kembalinya."
  },
  {
    "surah": 78,
    "ayat": 23,
    "terjemahan": "Mereka tinggal di dalamnya berkurun-kurun lamanya."
  },
  {
    "surah": 78,
    "ayat": 24,
    "terjemahan": "Mereka tidak dapat merasai udara yang sejuk di dalamnya, dan tidak pula sebarang minuman -"
  },
  {
    "surah": 78,
    "ayat": 25,
    "terjemahan": "Kecuali air panas yang menggelegak, dan air danur yang mengalir, -"
  },
  {
    "surah": 78,
    "ayat": 26,
    "terjemahan": "Sebagai balasan yang sesuai (dengan amal mereka yang buruk)."
  },
  {
    "surah": 78,
    "ayat": 27,
    "terjemahan": "Kerana sesungguhnya mereka dahulu tidak menaruh ingatan terhadap hari hitungan amal,"
  },
  {
    "surah": 78,
    "ayat": 28,
    "terjemahan": "Dan mereka telah mendustakan dengan sesungguh-sungguhnya akan ayat-ayat keterangan Kami;"
  },
  {
    "surah": 78,
    "ayat": 29,
    "terjemahan": "Dan tiap-tiap sesuatu dari bawaan hidupnya, telah Kami hitung secara bertulis."
  },
  {
    "surah": 78,
    "ayat": 30,
    "terjemahan": "(Setelah mereka masuk ke dalam neraka, dikatakan kepada mereka: \"Oleh sebab kamu telah mendustakan ayat-ayat Kami) maka rasalah kamu (azab yang disediakan), kerana Kami tidak akan melakukan selain dari menambah berbagai azab kepada kamu\"."
  },
  {
    "surah": 78,
    "ayat": 31,
    "terjemahan": "Sesungguhnya orang-orang yang bertaqwa, disediakan Syurga tempat mereka beroleh apa yang mereka ingini."
  },
  {
    "surah": 78,
    "ayat": 32,
    "terjemahan": "(Mereka akan beroleh) taman-taman bunga dan kebun-kebun buah-buahan, terutama anggur;"
  },
  {
    "surah": 78,
    "ayat": 33,
    "terjemahan": "Dan perawan-perawan yang sebaya umurnya;"
  },
  {
    "surah": 78,
    "ayat": 34,
    "terjemahan": "Serta piala atau gelas yang penuh dengan minuman;"
  },
  {
    "surah": 78,
    "ayat": 35,
    "terjemahan": "Mereka tidak mendengar di dalam Syurga itu perkataan yang sia-sia, dan tiada pula perkataan yang dusta;"
  },
  {
    "surah": 78,
    "ayat": 36,
    "terjemahan": "Sebagai balasan dari Tuhanmu, iaitu satu limpah kurnia yang dikira cukup (menurut yang dijanjikanNya),"
  },
  {
    "surah": 78,
    "ayat": 37,
    "terjemahan": "Tuhan yang mentadbirkan tujuh petala langit dan bumi serta apa yang ada di antara keduanya, Tuhan Yang Maha Pemurah, tidak ada sesiapapun diberi kuasa berkata-kata denganNya (untuk memohon pertimbangan tentang balasan atau pengurniaan itu);"
  },
  {
    "surah": 78,
    "ayat": 38,
    "terjemahan": "(Tambahan pula) pada masa Jibril dan malaikat-malaikat yang lain berdiri bersaf-saf (menunggu perintah Tuhan), tidak ada yang berani berkata-kata (memohon pertimbangan) melainkan yang telah diizinkan baginya oleh Tuhan Yang Maha Pemurah, serta ia berkata benar."
  },
  {
    "surah": 78,
    "ayat": 39,
    "terjemahan": "Itulah keterangan-keterangan mengenai hari (kiamat) yang sungguh tetap berlakunya; maka sesiapa yang mahukan kebaikan dirinya, dapatlah ia mengambil jalan dan cara kembali kepada Tuhannya (dengan iman dan amal yang soleh)!"
  },
  {
    "surah": 78,
    "ayat": 40,
    "terjemahan": "Sesungguhnya (dengan keterangan-keterangan yang tersebut), Kami memberi amaran kepada kamu mengenai azab yang dekat (masa datangnya), - iaitu hari seseorang melihat apa yang telah diusahakannya; dan orang yang kafir akan berkata (pada hari itu): \"Alangkah baiknya kalau aku menjadi tanah (supaya aku tidak dibangkitkan untuk dihitung amalku dan menerima balasan)\"."
  },
  {
    "surah": 79,
    "ayat": 1,
    "terjemahan": "Demi (makhluk-makhluk) yang mencabut (apa yang ditugaskan mencabutnya) dengan cara yang sekasar-kasarnya;"
  },
  {
    "surah": 79,
    "ayat": 2,
    "terjemahan": "Dan yang menarik (apa yang ditugaskan menariknya) dengan cara yang selembut-lembutnya;"
  },
  {
    "surah": 79,
    "ayat": 3,
    "terjemahan": "Dan demi (makhluk-makhluk) yang cergas bergerak (menerima perintah) dengan gerak yang secergas-cergasnya;"
  },
  {
    "surah": 79,
    "ayat": 4,
    "terjemahan": "Lalu masing-masing berlumba-lumba dahulu-mendahului (menjalankan tugasnya) dengan cara yang sesungguh-sungguhnya;"
  },
  {
    "surah": 79,
    "ayat": 5,
    "terjemahan": "Serta menyempurnakan tadbir urusan alam yang diperintahkan kepadanya; (sumpah demi sumpah, sesungguhnya kamu akan dibangkitkan hidup semula pada hari kiamat)! -"
  },
  {
    "surah": 79,
    "ayat": 6,
    "terjemahan": "Pada masa berlakunya \"tiupan sangkakala yang pertama\" yang menggoncangkan alam, (sehingga mati segala yang bernyawa dan punah-ranah sekalian makhluk selain dari yang dikecualikan),"
  },
  {
    "surah": 79,
    "ayat": 7,
    "terjemahan": "Tiupan yang pertama itu diikuti oleh tiupan yang kedua, (yang menyebabkan orang-orang yang mati semuanya hidup semula serta keluar dari kubur masing-masing);"
  },
  {
    "surah": 79,
    "ayat": 8,
    "terjemahan": "Hati (manusia) pada hari itu berdebar-debar takut,"
  },
  {
    "surah": 79,
    "ayat": 9,
    "terjemahan": "Pemandangannya tunduk gerun."
  },
  {
    "surah": 79,
    "ayat": 10,
    "terjemahan": "Mereka (yang ingkar) berkata: \"Sungguhkah kita akan dikembalikan hidup seperti keadaan di dunia dahulu?"
  },
  {
    "surah": 79,
    "ayat": 11,
    "terjemahan": "\"Bolehkah (dihidupkan semula) sesudah kita menjadi tulang yang reput?\""
  },
  {
    "surah": 79,
    "ayat": 12,
    "terjemahan": "Mereka berkata lagi (secara mengejek: \"Kalaulah berlaku) yang demikian, sudah tentu kembalinya kita (hidup semula) itu satu perkara yang merugikan!\""
  },
  {
    "surah": 79,
    "ayat": 13,
    "terjemahan": "(Menghidupkan semula tidaklah sukar), kerana berlakunya perkara itu hanyalah dengan satu jeritan (yang terbit dari tiupan sangkakala yang kedua), -"
  },
  {
    "surah": 79,
    "ayat": 14,
    "terjemahan": "Yang menyebabkan mereka dengan serta-merta berada di muka bumi yang putih rata."
  },
  {
    "surah": 79,
    "ayat": 15,
    "terjemahan": "Sudahkah sampai kepadamu (wahai Muhammad) perihal Nabi Musa?"
  },
  {
    "surah": 79,
    "ayat": 16,
    "terjemahan": "Ketika ia diseru oleh Tuhannya di \"Wadi Tuwa\" yang suci; -"
  },
  {
    "surah": 79,
    "ayat": 17,
    "terjemahan": "(Lalu diperintahkan kepadanya): \"Pergilah kepada Firaun, sesungguhnya ia telah melampaui batas (dalam kekufuran dan kezalimannya);"
  },
  {
    "surah": 79,
    "ayat": 18,
    "terjemahan": "\"Serta katakanlah kepadanya: `Adakah engkau suka hendak mensucikan dirimu (dari kekufuran)?"
  },
  {
    "surah": 79,
    "ayat": 19,
    "terjemahan": "`Dan mahukah, aku tunjuk kepadamu jalan mengenal Tuhanmu, supaya engkau merasa takut (melanggar perintahNya)? ' \""
  },
  {
    "surah": 79,
    "ayat": 20,
    "terjemahan": "(Setelah Nabi Musa menyempurnakan perintah Tuhannya, dan Firaun pun meminta bukti kebenarannya); maka Nabi Musa memperlihatkan kepada Firaun: mukjizat yang besar."
  },
  {
    "surah": 79,
    "ayat": 21,
    "terjemahan": "Lalu Firaun mendustakan (Nabi Musa) dan menderhaka (kepada Allah);"
  },
  {
    "surah": 79,
    "ayat": 22,
    "terjemahan": "Kemudian ia berpaling ingkar sambil menjalankan usahanya (menentang Nabi Musa)."
  },
  {
    "surah": 79,
    "ayat": 23,
    "terjemahan": "Lalu ia menghimpunkan orang-orangnya dan menyeru, -"
  },
  {
    "surah": 79,
    "ayat": 24,
    "terjemahan": "Dengan berkata: \"Akulah tuhan kamu, yang tertinggi\"."
  },
  {
    "surah": 79,
    "ayat": 25,
    "terjemahan": "Maka Allah menyeksa Firaun di akhirat dan di dunia ini, dengan azab yang menakutkan sesiapa yang mengetahuinya."
  },
  {
    "surah": 79,
    "ayat": 26,
    "terjemahan": "Sesungguhnya yang demikian itu mengandungi pelajaran yang mendatangkan iktibar bagi orang-orang yang takut (melanggar perintah Tuhannya)."
  },
  {
    "surah": 79,
    "ayat": 27,
    "terjemahan": "(Wahai golongan yang ingkarkan kebangkitan hidup semula!) Kamukah yang sukar diciptakan atau langit? Tuhan telah membinanya (dengan Kukuh)!"
  },
  {
    "surah": 79,
    "ayat": 28,
    "terjemahan": "Ia telah meninggikan bangunan langit itu lalu menyempurnaKannya,"
  },
  {
    "surah": 79,
    "ayat": 29,
    "terjemahan": "Dan Ia menjadikan malamnya gelap-gelita, serta menjadikan siangnya terang-benderang."
  },
  {
    "surah": 79,
    "ayat": 30,
    "terjemahan": "Dan bumi sesudah itu dihamparkannya (untuk kemudahan penduduknya), -"
  },
  {
    "surah": 79,
    "ayat": 31,
    "terjemahan": "Ia mengeluarkan dari bumi itu: airnya dan tumbuh-tumbuhannya;"
  },
  {
    "surah": 79,
    "ayat": 32,
    "terjemahan": "Dan gunung-ganang pula dikukuhkan letaknya (di bumi, sebagai pancang pasak yang menetapnya);"
  },
  {
    "surah": 79,
    "ayat": 33,
    "terjemahan": "(Semuanya itu) untuk kegunaan kamu dan binatang-binatang ternak kamu."
  },
  {
    "surah": 79,
    "ayat": 34,
    "terjemahan": "Maka apabila datang hari yang bencananya amat besar, -"
  },
  {
    "surah": 79,
    "ayat": 35,
    "terjemahan": "Iaitu hari manusia akan mengingati apa yang telah diusahakannya, -"
  },
  {
    "surah": 79,
    "ayat": 36,
    "terjemahan": "Dan neraka diperlihatkan kepada sesiapa sahaja yang dapat melihatnya, -"
  },
  {
    "surah": 79,
    "ayat": 37,
    "terjemahan": "Maka (dapatlah masing-masing mengetahui kesudahannya); adapun orang yang melampau (perbuatan derhakanya), -"
  },
  {
    "surah": 79,
    "ayat": 38,
    "terjemahan": "Serta ia mengutamakan kehidupan dunia semata-mata, -"
  },
  {
    "surah": 79,
    "ayat": 39,
    "terjemahan": "Maka sesungguhnya neraka Jahanamlah tempat kediamannya."
  },
  {
    "surah": 79,
    "ayat": 40,
    "terjemahan": "Adapun orang yang takutkan keadaan semasa ia berdiri di mahkamah Tuhannya, (untuk dihitung amalnya), serta ia menahan dirinya dari menurut hawa nafsu, -"
  },
  {
    "surah": 79,
    "ayat": 41,
    "terjemahan": "Maka sesungguhnya Syurgalah tempat kediamannya."
  },
  {
    "surah": 79,
    "ayat": 42,
    "terjemahan": "Mereka (yang ingkar) selalu bertanya kepadamu (wahai Muhammad) tentang hari kiamat: \"Bilakah masa datangnya?\""
  },
  {
    "surah": 79,
    "ayat": 43,
    "terjemahan": "Apa hubungannya tugasmu dengan (soal) menerangkan masa kedatangan hari kiamat itu?"
  },
  {
    "surah": 79,
    "ayat": 44,
    "terjemahan": "Kepada Tuhanmu lah terserah kesudahan ilmu mengenainya."
  },
  {
    "surah": 79,
    "ayat": 45,
    "terjemahan": "Tugasmu hanyalah memberi amaran kepada orang yang takut akan huru-hara hari kiamat itu."
  },
  {
    "surah": 79,
    "ayat": 46,
    "terjemahan": "(Sangatlah dahsyatnya huru-hara hari itu, sehingga orang-orang yang bersalah merasa) pada masa melihatnya: seolah-olah mereka tidak tinggal di dunia melainkan sekadar satu petang atau paginya sahaja."
  },
  {
    "surah": 80,
    "ayat": 1,
    "terjemahan": "Ia memasamkan muka dan berpaling,"
  },
  {
    "surah": 80,
    "ayat": 2,
    "terjemahan": "Kerana ia didatangi orang buta."
  },
  {
    "surah": 80,
    "ayat": 3,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui (tujuannya, wahai Muhammad) ? Barangkali ia mahu membersihkan hatinya (dengan pelajaran ugama yang didapatinya daripadamu)! -"
  },
  {
    "surah": 80,
    "ayat": 4,
    "terjemahan": "Ataupun ia mahu mendapat peringatan, supaya peringatan itu memberi manfaat kepadanya."
  },
  {
    "surah": 80,
    "ayat": 5,
    "terjemahan": "Adapun orang yang merasa keadaannya telah cukup, tidak berhajat lagi (kepada ajaran Al-Quran),"
  },
  {
    "surah": 80,
    "ayat": 6,
    "terjemahan": "Maka engkau bersungguh-sungguh melayaninya."
  },
  {
    "surah": 80,
    "ayat": 7,
    "terjemahan": "Padahal engkau tidak bersalah kalau ia tidak mahu membersihkan dirinya (dari keingkarannya)."
  },
  {
    "surah": 80,
    "ayat": 8,
    "terjemahan": "Adapun orang yang segera datang kepadamu,"
  },
  {
    "surah": 80,
    "ayat": 9,
    "terjemahan": "Dengan perasaan takutnya (melanggar perintah-perintah Allah), -"
  },
  {
    "surah": 80,
    "ayat": 10,
    "terjemahan": "Maka engkau berlengah-lengah melayaninya."
  },
  {
    "surah": 80,
    "ayat": 11,
    "terjemahan": "Janganlah melakukan lagi yang sedemikian itu! Sebenarnya ayat-ayat Al-Quran adalah pengajaran dan peringatan (yang mencukupi)."
  },
  {
    "surah": 80,
    "ayat": 12,
    "terjemahan": "Maka sesiapa yang mahukan kebaikan dirinya, dapatlah ia mengambil peringatan daripadanya."
  },
  {
    "surah": 80,
    "ayat": 13,
    "terjemahan": "(Ayat-ayat Suci itu tersimpan) dalam naskhah-naskhah yang dimuliakan, -"
  },
  {
    "surah": 80,
    "ayat": 14,
    "terjemahan": "Yang tinggi darjatnya, lagi suci (dari segala gangguan), -"
  },
  {
    "surah": 80,
    "ayat": 15,
    "terjemahan": "(Terpelihara) di tangan malaikat-malaikat yang menyalinnya dari Lauh Mahfuz;"
  },
  {
    "surah": 80,
    "ayat": 16,
    "terjemahan": "(Malaikat-malaikat) yang mulia, lagi yang berbakti."
  },
  {
    "surah": 80,
    "ayat": 17,
    "terjemahan": "Binasalah hendaknya manusia (yang ingkar) itu, betapa besar kekufurannya?"
  },
  {
    "surah": 80,
    "ayat": 18,
    "terjemahan": "(Tidakkah ia memikirkan) dari apakah ia diciptakan oleh Allah? -"
  },
  {
    "surah": 80,
    "ayat": 19,
    "terjemahan": "Dari air mani diciptakanNya, serta dilengkapkan keadaannya dengan persediaan untuk bertanggungjawab;"
  },
  {
    "surah": 80,
    "ayat": 20,
    "terjemahan": "Kemudian jalan (baik dan jahat), dimudahkan Tuhan kepadanya (untuk menimbang dan mengambil mana satu yang ia pilih);"
  },
  {
    "surah": 80,
    "ayat": 21,
    "terjemahan": "Kemudian dimatikannya, lalu diperintahkan supaya ia dikuburkan;"
  },
  {
    "surah": 80,
    "ayat": 22,
    "terjemahan": "Kemudian apabila Allah kehendaki dibangkitkannya (hidup semula)."
  },
  {
    "surah": 80,
    "ayat": 23,
    "terjemahan": "Janganlah hendaknya ia kufur ingkar lagi! Sebenarnya ia belum menunaikan apa yang diperintahkan kepadanya."
  },
  {
    "surah": 80,
    "ayat": 24,
    "terjemahan": "(Kalaulah ia tidak memikirkan asal dan kesudahan dirinya), maka hendaklah manusia melihat kepada makanannya (bagaimana kami mentadbirkannya):"
  },
  {
    "surah": 80,
    "ayat": 25,
    "terjemahan": "Sesungguhnya kami telah mencurahkan hujan dengan curahan yang menakjubkan."
  },
  {
    "surah": 80,
    "ayat": 26,
    "terjemahan": "Kemudian kami belah-belahkan bumi dengan belahan yang sesuai dengan tumbuh-tumbuhan, -"
  },
  {
    "surah": 80,
    "ayat": 27,
    "terjemahan": "Lalu Kami tumbuhkan pada bumi biji-bijian,"
  },
  {
    "surah": 80,
    "ayat": 28,
    "terjemahan": "Dan buah anggur serta sayur-sayuran,"
  },
  {
    "surah": 80,
    "ayat": 29,
    "terjemahan": "Dan Zaitun serta pohon-pohon kurma,"
  },
  {
    "surah": 80,
    "ayat": 30,
    "terjemahan": "Dan taman-taman yang menghijau subur,"
  },
  {
    "surah": 80,
    "ayat": 31,
    "terjemahan": "Dan berbagai buah-buahan serta bermacam-macam rumput, -"
  },
  {
    "surah": 80,
    "ayat": 32,
    "terjemahan": "Untuk kegunaan kamu dan binatang-binatang ternak kamu."
  },
  {
    "surah": 80,
    "ayat": 33,
    "terjemahan": "Kemudian (ingatlah keadaan yang berlaku) apabila datang suara jeritan yang dahsyat, -"
  },
  {
    "surah": 80,
    "ayat": 34,
    "terjemahan": "Pada hari seseorang itu lari dari saudaranya,"
  },
  {
    "surah": 80,
    "ayat": 35,
    "terjemahan": "Dan ibunya serta bapanya,"
  },
  {
    "surah": 80,
    "ayat": 36,
    "terjemahan": "Dan isterinya serta anak-anaknya; -"
  },
  {
    "surah": 80,
    "ayat": 37,
    "terjemahan": "Kerana tiap-tiap seorang dari mereka pada hari itu, ada perkara-perkara yang cukup untuk menjadikannya sibuk dengan hal dirinya sahaja."
  },
  {
    "surah": 80,
    "ayat": 38,
    "terjemahan": "Muka (orang-orang yang beriman) pada hari itu berseri-seri,"
  },
  {
    "surah": 80,
    "ayat": 39,
    "terjemahan": "Tertawa, lagi bersuka ria;"
  },
  {
    "surah": 80,
    "ayat": 40,
    "terjemahan": "Dan muka (orang-orang yang ingkar) pada hari itu penuh berdebu,"
  },
  {
    "surah": 80,
    "ayat": 41,
    "terjemahan": "Diliputi oleh warna hitam legam dan gelap-gelita. -"
  },
  {
    "surah": 80,
    "ayat": 42,
    "terjemahan": "Mereka itu ialah orang-orang yang kafir, yang derhaka."
  },
  {
    "surah": 81,
    "ayat": 1,
    "terjemahan": "Apabila matahari dilingkari cahayanya (dan hilang lenyap);"
  },
  {
    "surah": 81,
    "ayat": 2,
    "terjemahan": "Dan apabila bintang-bintang gugur berselerak;"
  },
  {
    "surah": 81,
    "ayat": 3,
    "terjemahan": "Dan apabila gunung-ganang di terbangkan ke angkasa (setelah dihancurkan menjadi debu);"
  },
  {
    "surah": 81,
    "ayat": 4,
    "terjemahan": "Dan apabila unta-unta yang bunting terbiar;"
  },
  {
    "surah": 81,
    "ayat": 5,
    "terjemahan": "Dan apabila binatang-binatang liar dihimpunkan;"
  },
  {
    "surah": 81,
    "ayat": 6,
    "terjemahan": "Dan apabila lautan meluap-luap bercampur-baur;"
  },
  {
    "surah": 81,
    "ayat": 7,
    "terjemahan": "Dan apabila tiap-tiap diri disatukan dengan pasangannya;"
  },
  {
    "surah": 81,
    "ayat": 8,
    "terjemahan": "Dan apabila anak perempuan yang ditanam hidup-hidup: ditanya, -"
  },
  {
    "surah": 81,
    "ayat": 9,
    "terjemahan": "Dengan dosa apakah ia dibunuh?"
  },
  {
    "surah": 81,
    "ayat": 10,
    "terjemahan": "Dan apabila surat-surat amal dibentangkan;"
  },
  {
    "surah": 81,
    "ayat": 11,
    "terjemahan": "Dan apabila langit ditanggalkan dari tempatnya;"
  },
  {
    "surah": 81,
    "ayat": 12,
    "terjemahan": "Dan apabila neraka dinyalakan menjulang;"
  },
  {
    "surah": 81,
    "ayat": 13,
    "terjemahan": "Dan apabila Syurga didekatkan;"
  },
  {
    "surah": 81,
    "ayat": 14,
    "terjemahan": "(Setelah semuanya itu berlaku), tiap-tiap orang akan mengetahui tentang amal yang telah dibawanya."
  },
  {
    "surah": 81,
    "ayat": 15,
    "terjemahan": "Oleh itu, Aku bersumpah dengan bintang-bintang yang tenggelam timbul;"
  },
  {
    "surah": 81,
    "ayat": 16,
    "terjemahan": "Yang beredar, juga yang tetap pada tempatnya;"
  },
  {
    "surah": 81,
    "ayat": 17,
    "terjemahan": "Dan malam, apabila ia hampir habis,"
  },
  {
    "surah": 81,
    "ayat": 18,
    "terjemahan": "Dan siang, apabila ia mulai terang;"
  },
  {
    "surah": 81,
    "ayat": 19,
    "terjemahan": "Sebenarnya Al-Quran itu, sungguh-sungguh Kalamullah (yang disampaikan oleh Jibril) Utusan yang mulia,"
  },
  {
    "surah": 81,
    "ayat": 20,
    "terjemahan": "Yang kuat gagah, lagi berkedudukan tinggi di sisi Allah yang mempunyai Arasy,"
  },
  {
    "surah": 81,
    "ayat": 21,
    "terjemahan": "Yang ditaati di sana (dalam kalangan malaikat), lagi dipercayai."
  },
  {
    "surah": 81,
    "ayat": 22,
    "terjemahan": "Dan sebenarnya sahabat kamu (Nabi Muhammad) itu (wahai golongan yang menentang Islam), bukanlah ia seorang gila (seperti yang kamu tuduh);"
  },
  {
    "surah": 81,
    "ayat": 23,
    "terjemahan": "Dan (Nabi Muhammad yakin bahawa yang disampaikan kepadanya ialah wahyu dari Tuhan, kerana) demi sesungguhnya! Nabi Muhammad telah mengenal dan melihat Jibril di kaki langit yang nyata."
  },
  {
    "surah": 81,
    "ayat": 24,
    "terjemahan": "Dan bukanlah Nabi Muhammad seorang yang boleh dituduh dan disangka buruk, terhadap penyampaiannya mengenai perkara-perkara yang ghaib."
  },
  {
    "surah": 81,
    "ayat": 25,
    "terjemahan": "Dan sebenarnya Al-Quran itu bukanlah perkataan Syaitan yang kena rejam."
  },
  {
    "surah": 81,
    "ayat": 26,
    "terjemahan": "(Dengan yang demikian) maka ke manakah kamu hendak pergi (kiranya kamu masih menyeleweng dari jalan Al-Quran)?"
  },
  {
    "surah": 81,
    "ayat": 27,
    "terjemahan": "Al-Quran itu tidak lain hanyalah peringatan bagi seluruh penduduk alam:"
  },
  {
    "surah": 81,
    "ayat": 28,
    "terjemahan": "Iaitu bagi sesiapa dari kamu yang mahu tetap teguh di atas jalan (Islam) yang betul."
  },
  {
    "surah": 81,
    "ayat": 29,
    "terjemahan": "Dan kamu tidak dapat menentukan kemahuan kamu (mengenai sesuatupun), kecuali dengan cara yang diatur oleh Allah, Tuhan yang memelihara dan mentadbirkan seluruh alam."
  },
  {
    "surah": 82,
    "ayat": 1,
    "terjemahan": "Apabila langit terbelah;"
  },
  {
    "surah": 82,
    "ayat": 2,
    "terjemahan": "Dan apabila bintang-bintang gugur bertaburan;"
  },
  {
    "surah": 82,
    "ayat": 3,
    "terjemahan": "Dan apabila lautan pecah bercampur-baur;"
  },
  {
    "surah": 82,
    "ayat": 4,
    "terjemahan": "Dan apabila kubur-kubur dibongkarkan, -"
  },
  {
    "surah": 82,
    "ayat": 5,
    "terjemahan": "(Setelah semuanya itu berlaku), tiap-tiap orang akan mengetahui apa yang telah dikerjakan dan ditinggalkannya."
  },
  {
    "surah": 82,
    "ayat": 6,
    "terjemahan": "Wahai manusia! Apakah yang memperdayakanmu - (berlaku derhaka) kepada Tuhanmu yang Maha Pemurah? -"
  },
  {
    "surah": 82,
    "ayat": 7,
    "terjemahan": "Tuhan yang telah mencipta dan mengatur kejadianmu, lalu menjadikan anggotamu sesuai (dengan tujuan yang kerananya anggota itu diadakan), serta menjadikan (binaan tubuh badanmu) sama padan dengan kekuatannya;"
  },
  {
    "surah": 82,
    "ayat": 8,
    "terjemahan": "Dalam bentuk dan rupa apa sahaja yang dikehendakiNya, Ia menyusun kejadianmu."
  },
  {
    "surah": 82,
    "ayat": 9,
    "terjemahan": "Sebenarnya tidak ada yang memperdayakan kamu (hai golongan yang ingkar)! Bahkan kamu sendiri tidak percayakan adanya hari pembalasan."
  },
  {
    "surah": 82,
    "ayat": 10,
    "terjemahan": "Padahal sesungguhnya, ada malaikat-malaikat yang menjaga dan mengawas segala bawaan kamu,"
  },
  {
    "surah": 82,
    "ayat": 11,
    "terjemahan": "(Mereka adalah makhluk) yang mulia (di sisi Allah), lagi ditugaskan menulis (amal-amal kamu);"
  },
  {
    "surah": 82,
    "ayat": 12,
    "terjemahan": "Mereka mengetahui apa yang kamu lakukan."
  },
  {
    "surah": 82,
    "ayat": 13,
    "terjemahan": "(Gunanya catitan malaikat-malaikat itu ialah: untuk menyatakan siapa yang berbakti dan siapa yang bersalah) - kerana sesungguhnya: orang-orang yang berbakti (dengan taat dan amal kebajikan), tetap berada dalam Syurga yang penuh nikmat;"
  },
  {
    "surah": 82,
    "ayat": 14,
    "terjemahan": "Dan sesungguhnya orang-orang yang bersalah, bertempat dalam neraka yang menjulang-julang."
  },
  {
    "surah": 82,
    "ayat": 15,
    "terjemahan": "Mereka menderita bakaran neraka itu pada hari pembalasan,"
  },
  {
    "surah": 82,
    "ayat": 16,
    "terjemahan": "Dan mereka (sentiasa berada dalam azab seksanya), tidak ghaib daripadanya."
  },
  {
    "surah": 82,
    "ayat": 17,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui kedahsyatan hari pembalasan itu?"
  },
  {
    "surah": 82,
    "ayat": 18,
    "terjemahan": "Sekali lagi, apa jalannya engkau dapat mengetahui kedahsyatan hari pembalasan itu?"
  },
  {
    "surah": 82,
    "ayat": 19,
    "terjemahan": "(Hari itu ialah) hari seseorang tidak dapat memberikan pertolongan sedikitpun kepada orang lain, dan segala urusan pada hari itu tertentu bagi Allah."
  },
  {
    "surah": 83,
    "ayat": 1,
    "terjemahan": "Kecelakaan besar bagi orang-orang yang curang (dalam timbangan dan sukatan),"
  },
  {
    "surah": 83,
    "ayat": 2,
    "terjemahan": "Iaitu mereka yang apabila menerima sukatan (gantang cupak) dari orang lain mereka mengambilnya dengan cukup,"
  },
  {
    "surah": 83,
    "ayat": 3,
    "terjemahan": "Dan (sebaliknya) apabila mereka menyukat atau menimbang untuk orang lain, mereka kurangi."
  },
  {
    "surah": 83,
    "ayat": 4,
    "terjemahan": "Tidakkah mereka menyangka bahawa mereka akan dibangkitkan (hidup semula sesudah mati)?"
  },
  {
    "surah": 83,
    "ayat": 5,
    "terjemahan": "Pada hari (kiamat) yang amat besar (huru-haranya),"
  },
  {
    "surah": 83,
    "ayat": 6,
    "terjemahan": "Hari berdiri manusia untuk mengadap Tuhan sekalian alam?"
  },
  {
    "surah": 83,
    "ayat": 7,
    "terjemahan": "Tidak sepatutnya (mereka melakukan perbuatan yang salah itu dan melalaikan hari akhirat)! Sesungguhnya \"kitab suratan amal\" orang-orang yang berdosa itu (didaftarkan) dalam \"Sijjiin\"."
  },
  {
    "surah": 83,
    "ayat": 8,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui: apa dia \"Sijjiin\" itu,"
  },
  {
    "surah": 83,
    "ayat": 9,
    "terjemahan": "Ialah (tempat simpanan) kitab catitan yang jelas nyata, (yang menghimpunkan amalan orang-orang yang berdosa)."
  },
  {
    "surah": 83,
    "ayat": 10,
    "terjemahan": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan -"
  },
  {
    "surah": 83,
    "ayat": 11,
    "terjemahan": "Iaitu mereka yang mendustakan hari pembalasan."
  },
  {
    "surah": 83,
    "ayat": 12,
    "terjemahan": "Dan tiada yang mendustakannya melainkan tiap-tiap orang yang melampaui batas (kebenaran), lagi amat derhaka!"
  },
  {
    "surah": 83,
    "ayat": 13,
    "terjemahan": "(Sehingga) apabila ia dibacakan kepadanya ayat-ayat Kami, ia berkata:\" Ini ialah dongeng orang-orang dahulu kala!\""
  },
  {
    "surah": 83,
    "ayat": 14,
    "terjemahan": "Sebenarnya! (Ayat-ayat Kami itu tidak ada cacatnya) bahkan mata hati mereka telah diselaputi kekotoran (dosa), dengan sebab (perbuatan kufur dan maksiat) yang mereka kerjakan."
  },
  {
    "surah": 83,
    "ayat": 15,
    "terjemahan": "Jangan lagi mereka berlaku demikian! (kalau tidak), mereka pada hari itu, tetap terdinding dari (rahmat) Tuhannya."
  },
  {
    "surah": 83,
    "ayat": 16,
    "terjemahan": "Kemudian, sesungguhnya mereka akan menderita bakaran neraka."
  },
  {
    "surah": 83,
    "ayat": 17,
    "terjemahan": "Akhirnya dikatakan (kepada mereka): \"Inilah dia (azab seksa) yang kamu dustakan dahulu.\""
  },
  {
    "surah": 83,
    "ayat": 18,
    "terjemahan": "Ingatlah wahai manusia! Sesungguhnya \"kitab suratan amal\" orang-orang yang berbakti (dengan taat dan amal kebajikan), adalah (didaftarkan) dalam\" Illiyiin\"."
  },
  {
    "surah": 83,
    "ayat": 19,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui, apa dia \"Illiyiin\" itu?"
  },
  {
    "surah": 83,
    "ayat": 20,
    "terjemahan": "Ialah (tempat simpanan) kitab catitan yang jelas nyata,"
  },
  {
    "surah": 83,
    "ayat": 21,
    "terjemahan": "Yang disaksikan oleh sekumpulan malaikat, yang didampingkan Tuhan di sisinya."
  },
  {
    "surah": 83,
    "ayat": 22,
    "terjemahan": "Sesungguhnya orang-orang yang berbakti (dengan taat dan amal kebajikan), tetap berada di dalam Syurga yang penuh nikmat:"
  },
  {
    "surah": 83,
    "ayat": 23,
    "terjemahan": "Mereka berehat di atas pelamin-pelamin (yang berhias), sambil melihat (segala keindahan dan kemuliaan yang disediakan untuk mereka di situ)."
  },
  {
    "surah": 83,
    "ayat": 24,
    "terjemahan": "Engkau dapat melihat pada muka mereka: cahaya nikmat yang mereka perolehi."
  },
  {
    "surah": 83,
    "ayat": 25,
    "terjemahan": "Mereka diberi minum dari satu minuman yang termeterai bekasnya,"
  },
  {
    "surah": 83,
    "ayat": 26,
    "terjemahan": "Meterainya kasturi; - dan untuk (memperolehi nikmat kesenangan) itu hendaknya berlumba-lumba mereka yang ingin merebut kelebihan dan kesenangan;"
  },
  {
    "surah": 83,
    "ayat": 27,
    "terjemahan": "Dan campuran minuman itu adalah dari \"Tasnim\":"
  },
  {
    "surah": 83,
    "ayat": 28,
    "terjemahan": "laitu matair yang diminum daripadanya oleh orang-orang yang di dampingkan (Tuhan di sisiNya)."
  },
  {
    "surah": 83,
    "ayat": 29,
    "terjemahan": "Sesungguhnya orang-orang yang derhaka, mereka selalu tertawakan orang-orang yang beriman."
  },
  {
    "surah": 83,
    "ayat": 30,
    "terjemahan": "Dan apabila orang-orang yang beriman lalu dekat mereka, mereka mengerling dan memejam celikkan mata sesama sendiri (mencemuhnya)."
  },
  {
    "surah": 83,
    "ayat": 31,
    "terjemahan": "Dan apabila mereka kembali kepada kaum keluarganya, mereka kembali dengan riang gembira;"
  },
  {
    "surah": 83,
    "ayat": 32,
    "terjemahan": "Dan apabila mereka melihat orang-orang yang beriman, mereka berkata: \"Sesungguhnya orang-orang itu adalah golongan yang sesat!\""
  },
  {
    "surah": 83,
    "ayat": 33,
    "terjemahan": "Pada hal mereka tidak diutus untuk menjaga sesat atau tidaknya orang-orang yang beriman itu!"
  },
  {
    "surah": 83,
    "ayat": 34,
    "terjemahan": "Maka pada hari ini, orang-orang yang beriman pula tertawakan orang yang kafir itu."
  },
  {
    "surah": 83,
    "ayat": 35,
    "terjemahan": "Sambil mereka berehat di atas pelamin-pelamin (yang berhias), serta melihat (hal yang berlaku kepada musuhnya)."
  },
  {
    "surah": 83,
    "ayat": 36,
    "terjemahan": "(Untuk menambahkan kegembiraan mereka, mereka ditanya): \"Bukankah orang-orang yang kafir itu telah dibalas akan apa yang mereka telah kerjakan dahulu?\""
  },
  {
    "surah": 84,
    "ayat": 1,
    "terjemahan": "Apabila langit terbelah,"
  },
  {
    "surah": 84,
    "ayat": 2,
    "terjemahan": "Serta mematuhi perintah Tuhannya, dan sudah semestinya ia patuh;"
  },
  {
    "surah": 84,
    "ayat": 3,
    "terjemahan": "Dan apabila bumi diratakan,"
  },
  {
    "surah": 84,
    "ayat": 4,
    "terjemahan": "Serta mengeluarkan apa yang di dalamnya, dan menjadi kosong,"
  },
  {
    "surah": 84,
    "ayat": 5,
    "terjemahan": "Serta mematuhi perintah Tuhannya, dan sudah semestinya ia patuh; - (Maka pada saat itu tiap-tiap seorang akan mengetahui apa yang telah dilakukannya)."
  },
  {
    "surah": 84,
    "ayat": 6,
    "terjemahan": "Wahai manusia! Sesungguhnya engkau sentiasa berpenat-lelah (menjalankan keadaan hidupmu) dengan sedaya upayamu hinggalah (semasa engkau) kembali kepada Tuhanmu, kemudian engkau tetap menemui balasan apa yang engkau telah usahakan itu (tercatit semuanya)."
  },
  {
    "surah": 84,
    "ayat": 7,
    "terjemahan": "Kemudian sesiapa yang diberi menerima surat amalnya dengan tangan kanannya, -"
  },
  {
    "surah": 84,
    "ayat": 8,
    "terjemahan": "Maka ia akan dihisab dengan cara yang mudah dan ringan,"
  },
  {
    "surah": 84,
    "ayat": 9,
    "terjemahan": "Dan ia akan pergi kepada keluarganya (yang beriman) dengan sukacita."
  },
  {
    "surah": 84,
    "ayat": 10,
    "terjemahan": "Dan sesiapa yang diberi menerima surat amalnya (dengan tangan kiri), dari sebelah belakangnya,"
  },
  {
    "surah": 84,
    "ayat": 11,
    "terjemahan": "Maka ia akan meraung menyebut-nyebut kebinasaannya,"
  },
  {
    "surah": 84,
    "ayat": 12,
    "terjemahan": "Dan ia akan menderita bakaran neraka yang marak menjulang."
  },
  {
    "surah": 84,
    "ayat": 13,
    "terjemahan": "Sebenarnya ia semasa di dunia dahulu bersukaria dalam kalangan keluarganya (yang juga kufur ingkar)!"
  },
  {
    "surah": 84,
    "ayat": 14,
    "terjemahan": "Sesungguhnya ia menyangka bahawa ia tidak sekali-kali akan kembali (kepada Kami untuk menerima balasan) !"
  },
  {
    "surah": 84,
    "ayat": 15,
    "terjemahan": "(Sangkaannya itu tidak betul) bahkan ia tetap kembali! Sesungguhnya Tuhannya sentiasa Melihat dan Mengetahui keadaannya!"
  },
  {
    "surah": 84,
    "ayat": 16,
    "terjemahan": "Maka Aku bersumpah, demi mega;"
  },
  {
    "surah": 84,
    "ayat": 17,
    "terjemahan": "Dan malam serta segala yang dihimpunkannya;"
  },
  {
    "surah": 84,
    "ayat": 18,
    "terjemahan": "Dan bulan apabila (penuh cahayanya) menjadi purnama:"
  },
  {
    "surah": 84,
    "ayat": 19,
    "terjemahan": "Sesungguhnya kamu tetap melalui beberapa keadaan yang bertingkat-tingkat baik buruknya, (sebelum kamu menemui Tuhan - menerima kesenangan dan kebahagiaan atau sebaliknya)"
  },
  {
    "surah": 84,
    "ayat": 20,
    "terjemahan": "Maka apakah alasan bagi mereka bersikap tidak mahu beriman?"
  },
  {
    "surah": 84,
    "ayat": 21,
    "terjemahan": "Dan (apakah pula alasannya) apabila dibacakan Al-Quran kepada mereka, mereka tidak mahu taat dan sujud?"
  },
  {
    "surah": 84,
    "ayat": 22,
    "terjemahan": "(Tidak ada satu alasan pun) bahkan orang-orang yang kafir, semata-mata mendustakannya;"
  },
  {
    "surah": 84,
    "ayat": 23,
    "terjemahan": "Sedang Allah mengetahui apa yang mereka rahsiakan dalam hati."
  },
  {
    "surah": 84,
    "ayat": 24,
    "terjemahan": "Maka khabarkanlah kepada mereka dengan azab yang tidak terperi sakitnya;"
  },
  {
    "surah": 84,
    "ayat": 25,
    "terjemahan": "Tetapi orang-orang yang beriman dan beramal soleh mereka beroleh pahala balasan yang tidak putus-putus."
  },
  {
    "surah": 85,
    "ayat": 1,
    "terjemahan": "Demi langit yang mempunyai tempat-tempat peredaran bintang-bintang;"
  },
  {
    "surah": 85,
    "ayat": 2,
    "terjemahan": "Dan hari (pembalasan) yang dijanjikan;"
  },
  {
    "surah": 85,
    "ayat": 3,
    "terjemahan": "Dan makhluk-makhluk yang hadir menyaksikan hari itu, serta segala keadaan yang disaksikan; -"
  },
  {
    "surah": 85,
    "ayat": 4,
    "terjemahan": "Celakalah kaum yang menggali parit,"
  },
  {
    "surah": 85,
    "ayat": 5,
    "terjemahan": "(Parit) api yang penuh dengan bahan bakaran,"
  },
  {
    "surah": 85,
    "ayat": 6,
    "terjemahan": "(Mereka dilaknat) ketika mereka duduk di kelilingnya,"
  },
  {
    "surah": 85,
    "ayat": 7,
    "terjemahan": "Sambil mereka melihat apa yang mereka lakukan kepada orang-orang yang beriman."
  },
  {
    "surah": 85,
    "ayat": 8,
    "terjemahan": "Dan mereka tidak marah dan menyeksakan orang-orang yang beriman itu melainkan kerana orang-orang itu beriman kepada Allah Yang Maha Kuasa, lagi Maha Terpuji!"
  },
  {
    "surah": 85,
    "ayat": 9,
    "terjemahan": "Tuhan yang menguasai segala alam langit dan bumi. Dan (ingatlah), Allah sentiasa menyaksikan tiap-tiap sesuatu."
  },
  {
    "surah": 85,
    "ayat": 10,
    "terjemahan": "Sesungguhnya orang-orang yang menimpakan bencana untuk memesongkan orang-orang lelaki yang beriman dan orang-orang perempuan yang beriman, kemudian mereka tidak bertaubat, maka mereka akan beroleh azab neraka Jahannam (kerana perbuatan buruk itu), dan mereka akan beroleh lagi azab api yang kuat membakar (kerana mereka tidak bertaubat)."
  },
  {
    "surah": 85,
    "ayat": 11,
    "terjemahan": "Sesungguhnya orang-orang yang beriman dan beramal soleh, mereka akan beroleh Syurga yang mengalir di bawahnya beberapa sungai; yang demikian itu ialah kemenangan yang besar."
  },
  {
    "surah": 85,
    "ayat": 12,
    "terjemahan": "Sesungguhnya azab Tuhanmu (terhadap orang-orang yang kufur ingkar) amatlah berat."
  },
  {
    "surah": 85,
    "ayat": 13,
    "terjemahan": "Sesungguhnya Dia lah yang menciptakan (sekalian makhluk) pada mulanya, dan yang mengembalikannya (hidup semula sesudah mati)."
  },
  {
    "surah": 85,
    "ayat": 14,
    "terjemahan": "Dan Dia lah yang Maha Pengampun, lagi Maha Pengasih."
  },
  {
    "surah": 85,
    "ayat": 15,
    "terjemahan": "Tuhan yang mempunyai Arasy yang tinggi kemuliaannya,"
  },
  {
    "surah": 85,
    "ayat": 16,
    "terjemahan": "Yang berkuasa melakukan segala yang dikehendakinya."
  },
  {
    "surah": 85,
    "ayat": 17,
    "terjemahan": "Sudahkah sampai kepadamu (wahai Muhammad) perihal (kebinasaan yang telah menimpa) kaum-kaum yang menentang (Rasul-rasul yang diutuskan kepada mereka)?"
  },
  {
    "surah": 85,
    "ayat": 18,
    "terjemahan": "(Mereka itu ialah kaum) Firaun, dan Thamud (kaum Nabi Soleh)."
  },
  {
    "surah": 85,
    "ayat": 19,
    "terjemahan": "(Kaummu wahai Muhammad, bukan sahaja menolak ajaranmu), bahkan orang-orang yang kafir itu terus tenggelam dalam keadaan mendustakan kebenaran;"
  },
  {
    "surah": 85,
    "ayat": 20,
    "terjemahan": "Sedang Allah, dari belakang mereka, melingkungi mereka (dengan kekuasaanNya)!"
  },
  {
    "surah": 85,
    "ayat": 21,
    "terjemahan": "(Sebenarnya apa yang engkau sampaikan kepada mereka bukanlah syair atau sihir), bahkan ialah Al-Quran yang tertinggi kemuliaannya;"
  },
  {
    "surah": 85,
    "ayat": 22,
    "terjemahan": "(Lagi yang terpelihara dengan sebaik-baiknya) pada Lauh Mahfuz."
  },
  {
    "surah": 86,
    "ayat": 1,
    "terjemahan": "Demi langit dan \"At-Taariq\"; -"
  },
  {
    "surah": 86,
    "ayat": 2,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui apa dia \"At-Taariq\" itu? -"
  },
  {
    "surah": 86,
    "ayat": 3,
    "terjemahan": "(At-Taariq) ialah bintang yang menembusi (sinaran cahayanya);"
  },
  {
    "surah": 86,
    "ayat": 4,
    "terjemahan": "Tiada sesuatu diri juapun melainkan ada malaikat yang menjaga (keadaannya serta menyimpan catitan mengenai segala bawaannya)."
  },
  {
    "surah": 86,
    "ayat": 5,
    "terjemahan": "(Setelah mengetahui yang demikian), maka hendaklah manusia memikirkan: dari apa ia diciptakan."
  },
  {
    "surah": 86,
    "ayat": 6,
    "terjemahan": "Ia diciptakan dari air (mani) yang memancut (ke dalam rahim) -"
  },
  {
    "surah": 86,
    "ayat": 7,
    "terjemahan": "Yang keluar dari \"tulang sulbi\" lelaki dan \"tulang dada\" perempuan."
  },
  {
    "surah": 86,
    "ayat": 8,
    "terjemahan": "Sesungguhnya Allah Maha Kuasa untuk mengembalikannya (hidup semula sesudah mati),"
  },
  {
    "surah": 86,
    "ayat": 9,
    "terjemahan": "Pada hari didedahkan segala yang terpendam di hati (dari iktiqad, niat, dan lain-lainnya),"
  },
  {
    "surah": 86,
    "ayat": 10,
    "terjemahan": "Maka (pada saat itu) tidak ada bagi manusia sebarang kekuatan (untuk membela diri), dan tidak ada penolong (yang dapat memberikan pertolongan)."
  },
  {
    "surah": 86,
    "ayat": 11,
    "terjemahan": "Demi langit yang berulang-ulang mencurahkan hujan,"
  },
  {
    "surah": 86,
    "ayat": 12,
    "terjemahan": "Dan bumi yang merekah mengeluarkan tumbuh-tumbuhan,"
  },
  {
    "surah": 86,
    "ayat": 13,
    "terjemahan": "Sesungguhnya keterangan Al-Quran adalah kata-kata pemutus (yang sebenar),"
  },
  {
    "surah": 86,
    "ayat": 14,
    "terjemahan": "Dan bukanlah ia kata-kata yang olok-olok."
  },
  {
    "surah": 86,
    "ayat": 15,
    "terjemahan": "Sesungguhnya mereka (yang menentangmu, wahai Muhammad) bermati-mati menjalankan rancangan jahat,"
  },
  {
    "surah": 86,
    "ayat": 16,
    "terjemahan": "Dan Aku pula tetap bertindak membalas rancangan jahat (mereka, dan menggagalkannya)."
  },
  {
    "surah": 86,
    "ayat": 17,
    "terjemahan": "Oleh itu janganlah engkau hendakkan segera kebinasaan orang-orang kafir itu, berilah tempoh kepada mereka sedikit masa."
  },
  {
    "surah": 87,
    "ayat": 1,
    "terjemahan": "Bertasbihlah mensucikan nama Tuhanmu Yang Maha Tinggi (dari segala sifat-sifat kekurangan), -"
  },
  {
    "surah": 87,
    "ayat": 2,
    "terjemahan": "Yang telah menciptakan (sekalian makhlukNya) serta menyempurnakan kejadiannya dengan kelengkapan yang sesuai dengan keadaannya;"
  },
  {
    "surah": 87,
    "ayat": 3,
    "terjemahan": "Dan Yang telah mengatur (keadaan makhluk-makhlukNya) serta memberikan hidayah petunjuk (ke jalan keselamatannya dan kesempurnaannya);"
  },
  {
    "surah": 87,
    "ayat": 4,
    "terjemahan": "Dan Yang telah mengeluarkan tumbuh-tumbuhan untuk binatang-binatang ternak,"
  },
  {
    "surah": 87,
    "ayat": 5,
    "terjemahan": "Kemudian Ia menjadikan (tumbuh-tumbuhan yang menghijau) itu kering - (berubah warnanya) kehitam-hitaman."
  },
  {
    "surah": 87,
    "ayat": 6,
    "terjemahan": "Kami sentiasa menjadikan engkau (wahai Muhammad) dapat membaca (Al-Quran yang diturunkan kepadamu - dengan perantaraan jibril), sehingga engkau (menghafaznya dan) tidak lupa,"
  },
  {
    "surah": 87,
    "ayat": 7,
    "terjemahan": "Kecuali apa yang dikehendaki Allah engkau lupakan; sesungguhnya Ia mengetahui (segala keadaan yang patut berlaku), dan yang tersembunyi."
  },
  {
    "surah": 87,
    "ayat": 8,
    "terjemahan": "Dan Kami tetap memberi kemudahan kepadamu untuk (melaksanakan segala perkara) Ugama yang mudah diterima oleh akal yang sihat."
  },
  {
    "surah": 87,
    "ayat": 9,
    "terjemahan": "Oleh itu berilah peringatan (kepada umat manusia dengan ajaran Al-Quran), kalau-kalau peringatan itu berguna (dan sudah tentu berguna);"
  },
  {
    "surah": 87,
    "ayat": 10,
    "terjemahan": "Kerana orang yang takut (melanggar perintah Allah) akan menerima peringatan itu;"
  },
  {
    "surah": 87,
    "ayat": 11,
    "terjemahan": "Dan (sebaliknya) orang yang sangat celaka akan menjauhinya,"
  },
  {
    "surah": 87,
    "ayat": 12,
    "terjemahan": "Dia lah orang yang akan menderita bakaran neraka yang amat besar (azab seksanya),"
  },
  {
    "surah": 87,
    "ayat": 13,
    "terjemahan": "Selain dari itu, ia tidak mati di dalamnya dan tidak pula hidup senang."
  },
  {
    "surah": 87,
    "ayat": 14,
    "terjemahan": "Sesungguhnya berjayalah orang yang - setelah menerima peringatan itu - berusaha membersihkan dirinya (dengan taat dan amal yang soleh),"
  },
  {
    "surah": 87,
    "ayat": 15,
    "terjemahan": "Dan menyebut-nyebut dengan lidah dan hatinya akan nama Tuhannya serta mangerjakan sembahyang (dengan khusyuk)."
  },
  {
    "surah": 87,
    "ayat": 16,
    "terjemahan": "(Tetapi kebanyakkan kamu tidak melakukan yang demikian), bahkan kamu utamakan kehidupan dunia;"
  },
  {
    "surah": 87,
    "ayat": 17,
    "terjemahan": "Padahal kehidupan akhirat lebih baik dan lebih kekal."
  },
  {
    "surah": 87,
    "ayat": 18,
    "terjemahan": "Sesungguhnya (keterangan-keterangan yang dinyatakan) ini ada (disebutkan) di dalam Kitab-kitab yang terdahulu, -"
  },
  {
    "surah": 87,
    "ayat": 19,
    "terjemahan": "Iaitu Kitab-kitab Nabi Ibrahim dan Nabi Musa."
  },
  {
    "surah": 88,
    "ayat": 1,
    "terjemahan": "Sudahkah sampai kepadamu (wahai Muhammad) perihal hari kiamat yang huru-haranya meliputi?"
  },
  {
    "surah": 88,
    "ayat": 2,
    "terjemahan": "Muka (orang-orang yang kafir) pada hari itu tunduk kerana merasa hina,"
  },
  {
    "surah": 88,
    "ayat": 3,
    "terjemahan": "Mereka menjalankan kerja yang berat lagi berpenat lelah,"
  },
  {
    "surah": 88,
    "ayat": 4,
    "terjemahan": "Mereka tetap menderita bakaran neraka yang amat panas (membakar), -"
  },
  {
    "surah": 88,
    "ayat": 5,
    "terjemahan": "Mereka diberi minum dari matair yang menggelegak panasnya."
  },
  {
    "surah": 88,
    "ayat": 6,
    "terjemahan": "Tiada makanan bagi mereka (di situ) selain dari pokok-pokok yang berduri,"
  },
  {
    "surah": 88,
    "ayat": 7,
    "terjemahan": "Yang tidak menggemokkan, dan tidak pula dapat menghilangkan sedikit kelaparan pun."
  },
  {
    "surah": 88,
    "ayat": 8,
    "terjemahan": "(Sebaliknya) muka (orang-orang yang beriman) pada hari itu berseri-seri,"
  },
  {
    "surah": 88,
    "ayat": 9,
    "terjemahan": "Berpuas hati dengan balasan amal usahanya (yang baik yang telah dikerjakannya di dunia), -"
  },
  {
    "surah": 88,
    "ayat": 10,
    "terjemahan": "(Mereka tinggal menetap) di dalam Syurga tinggi (tempat kedudukannya darjatnya),"
  },
  {
    "surah": 88,
    "ayat": 11,
    "terjemahan": "Mereka tidak mendengar di situ sebarang perkataan yang sia-sia,"
  },
  {
    "surah": 88,
    "ayat": 12,
    "terjemahan": "Di dalam Syurga itu ada matair yang mengalir,"
  },
  {
    "surah": 88,
    "ayat": 13,
    "terjemahan": "Di situ juga ada pelamin-pelamin (berhias) yang tinggi (tempatnya),"
  },
  {
    "surah": 88,
    "ayat": 14,
    "terjemahan": "Dan piala-piala minuman yang disediakan (untuk mereka),"
  },
  {
    "surah": 88,
    "ayat": 15,
    "terjemahan": "Dan bantal-bantal yang teratur (untuk mereka berbaring atau bersandar),"
  },
  {
    "surah": 88,
    "ayat": 16,
    "terjemahan": "Serta hamparan-hamparan yang terbentang."
  },
  {
    "surah": 88,
    "ayat": 17,
    "terjemahan": "(Mengapa mereka yang kafir masih mengingkari akhirat) tidakkah mereka memperhatikan keadaan unta bagaimana ia diciptakan?"
  },
  {
    "surah": 88,
    "ayat": 18,
    "terjemahan": "Dan keadaan langit bagaimana ia ditinggikan binaannya.?"
  },
  {
    "surah": 88,
    "ayat": 19,
    "terjemahan": "Dan keadaan gunung-ganang bagaimana ia ditegakkan?"
  },
  {
    "surah": 88,
    "ayat": 20,
    "terjemahan": "Dan keadaan bumi bagaimana ia dihamparkan?"
  },
  {
    "surah": 88,
    "ayat": 21,
    "terjemahan": "Oleh itu berikanlah sahaja peringatan (wahai Muhammad, kepada manusia, dan janganlah berdukacita kiranya ada yang menolaknya), kerana sesungguhnya engkau hanyalah seorang Rasul pemberi ingatan;"
  },
  {
    "surah": 88,
    "ayat": 22,
    "terjemahan": "Bukanlah engkau seorang yang berkuasa memaksa mereka (menerima ajaran Islam yang engkau sampaikan itu)."
  },
  {
    "surah": 88,
    "ayat": 23,
    "terjemahan": "Akan tetapi sesiapa yang berpaling (dari kebenaran) serta ia kufur ingkar, -"
  },
  {
    "surah": 88,
    "ayat": 24,
    "terjemahan": "Maka Allah akan menyeksanya dengan azab seksa yang sebesar-besarnya."
  },
  {
    "surah": 88,
    "ayat": 25,
    "terjemahan": "Sesungguhnya kepada Kamilah kembalinya mereka,"
  },
  {
    "surah": 88,
    "ayat": 26,
    "terjemahan": "Selain dari itu, sesungguhnya tanggungan Kamilah soal menghitung amal mereka."
  },
  {
    "surah": 89,
    "ayat": 1,
    "terjemahan": "Demi waktu fajar;"
  },
  {
    "surah": 89,
    "ayat": 2,
    "terjemahan": "Dan malam yang sepuluh (yang mempunyai kelebihan di sisi Allah);"
  },
  {
    "surah": 89,
    "ayat": 3,
    "terjemahan": "Dan bilangan yang genap serta yang ganjil;"
  },
  {
    "surah": 89,
    "ayat": 4,
    "terjemahan": "Dan malam, apabila ia berlalu; -"
  },
  {
    "surah": 89,
    "ayat": 5,
    "terjemahan": "Bukankah yang demikian itu mengandungi sumpah (yang diakui kebenarannya) oleh orang yang berakal sempurna?"
  },
  {
    "surah": 89,
    "ayat": 6,
    "terjemahan": "(Kami tetap akan membinasakan orang-orang yang menentangmu wahai Muhammad), tidakkah engkau perhatikan, bagaimana Tuhanmu telah melakukan terhadap kaum Aad (yang kufur derhaka)"
  },
  {
    "surah": 89,
    "ayat": 7,
    "terjemahan": "Iaitu penduduk \"Iram\" yang mempunyai bangunan-bangunan yang tinggi tiangnya, (sesuai dengan penduduknya)"
  }
]