[
  {
    "surah": 89,
    "ayat": 8,
    "terjemahan": "Yang belum pernah diciptakan sepertinya (tentang besar dan kukuhnya) di segala negeri (pada zamannya)?"
  },
  {
    "surah": 89,
    "ayat": 9,
    "terjemahan": "Dan (terhadap) kaum Thamud yang memahat batu-batu besar di lembah (Wadil-Qura iaitu tempat tinggalnya)?"
  },
  {
    "surah": 89,
    "ayat": 10,
    "terjemahan": "Dan (terhadap) Firaun yang menguasai bangunan-bangunan yang handal kukuh?"
  },
  {
    "surah": 89,
    "ayat": 11,
    "terjemahan": "(Semuanya itu ialah) orang-orang yang telah bermaharajalela di negeri (masing-masing)."
  },
  {
    "surah": 89,
    "ayat": 12,
    "terjemahan": "Lalu mereka melakukan dengan banyaknya kerosakan dan bencana di negeri-negeri itu."
  },
  {
    "surah": 89,
    "ayat": 13,
    "terjemahan": "Dengan yang demikian, Tuhanmu mencurahkan ke atas mereka berbagai paluan azab;"
  },
  {
    "surah": 89,
    "ayat": 14,
    "terjemahan": "Sesungguhnya Tuhanmu tetap mengawas dan membalas, (terutama balasan akhirat)"
  },
  {
    "surah": 89,
    "ayat": 15,
    "terjemahan": "(Dalam pada itu manusia tidak menghiraukan balasan akhirat), oleh yang demikian, maka kebanyakan manusia apabila diuji oleh Tuhannya dengan dimuliakan dan dimewahkan hidupnya, (ia tidak mahu bersyukur tetapi terus bersikap takbur) serta berkata dengan sombongnya: \"Tuhanku telah memuliakan daku!\""
  },
  {
    "surah": 89,
    "ayat": 16,
    "terjemahan": "Dan sebaliknya apabila ia diuji oleh Tuhannya, dengan disempitkan rezekinya, (ia tidak bersabar bahkan ia resah gelisah) serta merepek dengan katanya: \"Tuhanku telah menghinakan daku!\""
  },
  {
    "surah": 89,
    "ayat": 17,
    "terjemahan": "Jangan demikian, (sebenarnya kata-kata kamu itu salah). Bahkan (perbuatan kamu wahai orang-orang yang hidup mewah, lebih salah lagi kerana) kamu tidak memuliakan anak yatim, (malah kamu menahan apa yang Ia berhak menerimanya);"
  },
  {
    "surah": 89,
    "ayat": 18,
    "terjemahan": "Dan kamu tidak menggalakkan untuk memberi makanan (yang berhak diterima oleh) orang miskin;"
  },
  {
    "surah": 89,
    "ayat": 19,
    "terjemahan": "Dan kamu sentiasa makan harta pusaka secara rakus (dengan tidak membezakan halal haramnya),"
  },
  {
    "surah": 89,
    "ayat": 20,
    "terjemahan": "Serta kamu pula sayangkan harta secara tamak haloba!"
  },
  {
    "surah": 89,
    "ayat": 21,
    "terjemahan": "Jangan sekali-kali bersikap demikian! (Sebenarnya) apabila bumi (dihancurkan segala yang ada di atasnya dan) diratakan serata-ratanya,"
  },
  {
    "surah": 89,
    "ayat": 22,
    "terjemahan": "Dan (perintah) Tuhanmu pun datang, sedang malaikat berbaris-baris (siap sedia menjalankan perintah),"
  },
  {
    "surah": 89,
    "ayat": 23,
    "terjemahan": "Serta diperlihatkan neraka Jahannam pada hari itu, (maka) pada saat itu manusia akan ingat (hendak berlaku baik), dan bagaimana ingatan itu akan berguna lagi kepadanya?"
  },
  {
    "surah": 89,
    "ayat": 24,
    "terjemahan": "Ia akan berkata: \"Alangkah baiknya kalau aku dahulu sediakan amal-amal baik untuk hidupku (di sini)!\""
  },
  {
    "surah": 89,
    "ayat": 25,
    "terjemahan": "Maka pada hari itu tiada sesiapapun yang dapat menyeksa seperti azab (yang ditimpakan oleh) Allah."
  },
  {
    "surah": 89,
    "ayat": 26,
    "terjemahan": "Dan tiada sesiapapun yang dapat mengikat serta membelenggu seperti ikatan dan belengguNya."
  },
  {
    "surah": 89,
    "ayat": 27,
    "terjemahan": "(Setelah menerangkan akibat orang-orang yang tidak menghiraukan akhirat, Tuhan menyatakan bahawa orang-orang yang beriman dan beramal soleh akan disambut dengan kata-kata): \"Wahai orang yang mempunyai jiwa yang sentiasa tenang tetap dengan kepercayaan dan bawaan baiknya! -"
  },
  {
    "surah": 89,
    "ayat": 28,
    "terjemahan": "\"Kembalilah kepada Tuhanmu dengan keadaan engkau berpuas hati (dengan segala nikmat yang diberikan) lagi diredhai (di sisi Tuhanmu) ! -"
  },
  {
    "surah": 89,
    "ayat": 29,
    "terjemahan": "\"Serta masuklah engkau dalam kumpulan hamba-hambaku yang berbahagia -"
  },
  {
    "surah": 89,
    "ayat": 30,
    "terjemahan": "\"Dan masuklah ke dalam SyurgaKu! \""
  },
  {
    "surah": 90,
    "ayat": 1,
    "terjemahan": "Aku bersumpah dengan negeri (Makkah) ini;"
  },
  {
    "surah": 90,
    "ayat": 2,
    "terjemahan": "Sedang engkau (wahai Muhammad) tinggal di negeri ini (sentiasa ditindas),"
  },
  {
    "surah": 90,
    "ayat": 3,
    "terjemahan": "Demi manusia yang melahirkan zuriat, dan zuriat yang dilahirkannya;"
  },
  {
    "surah": 90,
    "ayat": 4,
    "terjemahan": "Sesungguhnya Kami telah jadikan manusia sentiasa dalam keadaan menghadapi kesulitan dan kesukaran (jasmani dan rohaninya);"
  },
  {
    "surah": 90,
    "ayat": 5,
    "terjemahan": "Patutkah manusia yang demikian keadaannya (terpedaya dengan kekuasaan yang ada padanya dan) menyangka bahawa tidak ada sesiapapun yang dapat mengatasi kekuasaannya (dan menyeksakannya)?"
  },
  {
    "surah": 90,
    "ayat": 6,
    "terjemahan": "Manusia yang demikian keadaannya (tidaklah patut ia bermegah-megah dengan kekayaannya dan) berkata: \"Aku telah habiskan harta benda yang banyak (dalam usaha menegakkan nama dan bangsa)."
  },
  {
    "surah": 90,
    "ayat": 7,
    "terjemahan": "Adakah ia menyangka bahawa tidak ada sesiapapun yang melihatnya (dan mengetahui tujuannya menghabiskan harta bendanya itu?"
  },
  {
    "surah": 90,
    "ayat": 8,
    "terjemahan": "(Mengapa manusia terpedaya dan bermegah-megah?) Tidakkah Kami telah menjadikan baginya: dua mata (untuk ia memerhatikan kekuasaan dan kekayaan Kami?) -"
  },
  {
    "surah": 90,
    "ayat": 9,
    "terjemahan": "Dan lidah serta dua bibir (untuk ia menyempurnakan sebahagian besar dari hajat-hajatnya)?"
  },
  {
    "surah": 90,
    "ayat": 10,
    "terjemahan": "Dan Kami telah menunjukkan kepadanya dua jalan, (jalan kebaikan untuk dijalaninya, dan jalan kejahatan untuk dijauhi)?"
  },
  {
    "surah": 90,
    "ayat": 11,
    "terjemahan": "Dalam pada itu manusia tidak (memilih jalan kebaikan) merempuh masuk mengerjakan amal-amal yang tinggi darjatnya di sisi Tuhan;"
  },
  {
    "surah": 90,
    "ayat": 12,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui: apa dia amal-amal yang tinggi darjatnya di sisi Tuhan itu?"
  },
  {
    "surah": 90,
    "ayat": 13,
    "terjemahan": "(Di antara amal-amal itu - bagi orang yang mampu) ialah: memerdekakan hamba abdi;"
  },
  {
    "surah": 90,
    "ayat": 14,
    "terjemahan": "Atau memberi makan pada hari kelaparan -"
  },
  {
    "surah": 90,
    "ayat": 15,
    "terjemahan": "Kepada anak yatim dari kaum kerabat,"
  },
  {
    "surah": 90,
    "ayat": 16,
    "terjemahan": "Atau kepada orang miskin yang terlantar di atas tanah."
  },
  {
    "surah": 90,
    "ayat": 17,
    "terjemahan": "Selain dari (tidak mengerjakan amal-amal) itu, ia (tidak pula) menjadi dari orang-orang yang beriman dan berpesan-pesan dengan sabar serta berpesan-pesan dengan kasih sayang."
  },
  {
    "surah": 90,
    "ayat": 18,
    "terjemahan": "(Ketahuilah! Bahawa orang-orang yang beriman serta berusaha mengerjakan amal-amal yang tinggi darjatnya di sisi Tuhan), merekalah golongan pihak kanan (yang akan beroleh Syurga)."
  },
  {
    "surah": 90,
    "ayat": 19,
    "terjemahan": "Dan (sebaliknya) orang-orang yang kufur ingkar akan ayat-ayat keterangan Kami, merekalah golongan pihak kiri. -"
  },
  {
    "surah": 90,
    "ayat": 20,
    "terjemahan": "Mereka ditimpakan (azab seksa) neraka yang ditutup rapat (supaya kuat bakarannya)."
  },
  {
    "surah": 91,
    "ayat": 1,
    "terjemahan": "Demi matahari dan cahayanya yang terang-benderang;"
  },
  {
    "surah": 91,
    "ayat": 2,
    "terjemahan": "Dan bulan apabila ia mengiringinya;"
  },
  {
    "surah": 91,
    "ayat": 3,
    "terjemahan": "Dan siang apabila ia memperlihatkannya dengan jelas nyata;"
  },
  {
    "surah": 91,
    "ayat": 4,
    "terjemahan": "Dan malam apabila ia menyelubunginya (dengan gelap- gelita),"
  },
  {
    "surah": 91,
    "ayat": 5,
    "terjemahan": "Demi langit dan Yang membinanya (dalam bentuk yang kuat kukuh - yang melambangkan kekuasaanNya);"
  },
  {
    "surah": 91,
    "ayat": 6,
    "terjemahan": "Serta bumi dan Yang menghamparkannya (untuk kemudahan makhluk-makhlukNya);"
  },
  {
    "surah": 91,
    "ayat": 7,
    "terjemahan": "Demi diri manusia dan Yang menyempurnakan kejadiannya (dengan kelengkapan yang sesuai dengan keadaannya);"
  },
  {
    "surah": 91,
    "ayat": 8,
    "terjemahan": "Serta mengilhamkannya (untuk mengenal) jalan yang membawanya kepada kejahatan, dan yang membawanya kepada bertaqwa; -"
  },
  {
    "surah": 91,
    "ayat": 9,
    "terjemahan": "Sesungguhnya berjayalah orang yang menjadikan dirinya - yang sedia bersih - bertambah-tambah bersih (dengan iman dan amal kebajikan),"
  },
  {
    "surah": 91,
    "ayat": 10,
    "terjemahan": "Dan sesungguhnya hampalah orang yang menjadikan dirinya - yang sedia bersih - itu susut dan terbenam kebersihannya (dengan sebab kekotoran maksiat)."
  },
  {
    "surah": 91,
    "ayat": 11,
    "terjemahan": "(Ingatlah), kaum Thamud telah mendustakan (Rasulnya) dengan sebab perbuatan derhaka mereka yang melampaui batas;"
  },
  {
    "surah": 91,
    "ayat": 12,
    "terjemahan": "Ketika orang yang paling jahat di antara mereka menerima perintah dari mereka (supaya membunuh unta yang menjadi mukjizat),"
  },
  {
    "surah": 91,
    "ayat": 13,
    "terjemahan": "Maka berkatalah Rasul Allah (Nabi Soleh) kepada mereka: \" (Janganlah kamu ganggu) unta betina dari Allah itu, dan (janganlah kamu menyekatnya daripada mendapat) air minumnya (supaya kamu tidak ditimpa azab)!\""
  },
  {
    "surah": 91,
    "ayat": 14,
    "terjemahan": "(Setelah Nabi Soleh memberi amaran) lalu mereka mendustakannya serta menyembelih unta itu. Dengan sebab dosa mereka, maka Tuhan menimpakan mereka dengan azab yang membinasakan serta Ia meratakan azab itu meliputi mereka (sehingga punah-ranah semuanya)."
  },
  {
    "surah": 91,
    "ayat": 15,
    "terjemahan": "Dan Allah tidak hiraukan kesudahan (mereka) yang demikian, (kerana itu adalah balasan yang adil)."
  },
  {
    "surah": 92,
    "ayat": 1,
    "terjemahan": "Demi malam apabila ia menyelubungi segala-galanya (dengan gelap-gelitanya),"
  },
  {
    "surah": 92,
    "ayat": 2,
    "terjemahan": "Dan siang apabila ia lahir terang-benderang;"
  },
  {
    "surah": 92,
    "ayat": 3,
    "terjemahan": "Demi Yang menciptakan (makhluk-makhlukNya) lelaki dan perempuan, (jantan dan betina); -"
  },
  {
    "surah": 92,
    "ayat": 4,
    "terjemahan": "Sesungguhnya amal usaha kamu adalah berbagai-bagai keadaannya."
  },
  {
    "surah": 92,
    "ayat": 5,
    "terjemahan": "Jelasnya: adapun orang yang memberikan apa yang ada padanya ke jalan kebaikan dan bertaqwa (mengerjakan suruhan Allah dan meninggalkan segala laranganNya), -"
  },
  {
    "surah": 92,
    "ayat": 6,
    "terjemahan": "Serta ia mengakui dengan yakin akan perkara yang baik,"
  },
  {
    "surah": 92,
    "ayat": 7,
    "terjemahan": "Maka sesungguhnya Kami akan memberikannya kemudahan untuk mendapat kesenangan (Syurga)."
  },
  {
    "surah": 92,
    "ayat": 8,
    "terjemahan": "Sebaliknya: orang yang bakhil (daripada berbuat kebajikan) dan merasa cukup dengan kekayaan dan kemewahannya, -"
  },
  {
    "surah": 92,
    "ayat": 9,
    "terjemahan": "Serta ia mendustakan perkara yang baik,"
  },
  {
    "surah": 92,
    "ayat": 10,
    "terjemahan": "Maka sesungguhnya Kami akan memberikannya kemudahan untuk mendapat kesusahan dan kesengsaraan;"
  },
  {
    "surah": 92,
    "ayat": 11,
    "terjemahan": "Dan apakah pertolongan yang dapat diberi kepadanya oleh hartanya apabiha ia telah terjerumus (ke dalam azab seksa hari akhirat)?"
  },
  {
    "surah": 92,
    "ayat": 12,
    "terjemahan": "Sesungguhnya tanggungan Kamilah memberi hidayah petunjuk (tentang yang benar dan yang salah)."
  },
  {
    "surah": 92,
    "ayat": 13,
    "terjemahan": "Dan sesungguhnya Kamilah yang menguasai hari akhirat dan alam dunia."
  },
  {
    "surah": 92,
    "ayat": 14,
    "terjemahan": "Maka (serentak dengan memberi hidayah petunjuk) Aku juga telah memberi amaran mengingatkan kamu akan api neraka yang marak menjulang,"
  },
  {
    "surah": 92,
    "ayat": 15,
    "terjemahan": "Yang tidak akan menderita bakarannya melainkan orang yang sungguh celaka, -"
  },
  {
    "surah": 92,
    "ayat": 16,
    "terjemahan": "Yang telah mendustakan (kebenaran) dan berpaling ingkar."
  },
  {
    "surah": 92,
    "ayat": 17,
    "terjemahan": "Dan (sebaliknya) akan dijauhkan (azab neraka) itu daripada orang yang sungguh bertaqwa, -"
  },
  {
    "surah": 92,
    "ayat": 18,
    "terjemahan": "Yang mendermakan hartanya dengan tujuan membersihkan dirinya dan hartabendanya,"
  },
  {
    "surah": 92,
    "ayat": 19,
    "terjemahan": "Sedang ia tidak menanggung budi sesiapapun, yang patut di balas,"
  },
  {
    "surah": 92,
    "ayat": 20,
    "terjemahan": "Hanyalah mengharapkan keredaan Tuhannya Yang Maha Tinggi;"
  },
  {
    "surah": 92,
    "ayat": 21,
    "terjemahan": "Dan demi sesungguhnya, ia tetap akan berpuas hati (pada hari akhirat, dengan mendapat segala yang diharapkannya)."
  },
  {
    "surah": 93,
    "ayat": 1,
    "terjemahan": "Demi waktu dhuha,"
  },
  {
    "surah": 93,
    "ayat": 2,
    "terjemahan": "Dan malam apabila ia sunyi-sepi -"
  },
  {
    "surah": 93,
    "ayat": 3,
    "terjemahan": "(Bahawa) Tuhanmu (wahai Muhammad) tidak meninggalkanmu, dan Ia tidak benci (kepadamu, sebagaimana yang dituduh oleh kaum musyrik)."
  },
  {
    "surah": 93,
    "ayat": 4,
    "terjemahan": "Dan sesungguhnya kesudahan keaadaanmu adalah lebih baik bagimu daripada permulaannya."
  },
  {
    "surah": 93,
    "ayat": 5,
    "terjemahan": "Dan sesungguhnya Tuhanmu akan memberikanmu (kejayaan dan kebahagiaan di dunia dan di akhirat) sehingga engkau reda - berpuas hati."
  },
  {
    "surah": 93,
    "ayat": 6,
    "terjemahan": "Bukankah dia mendapati engkau yatim piatu, lalu la memberikan perlindungan?"
  },
  {
    "surah": 93,
    "ayat": 7,
    "terjemahan": "Dan didapatiNya engkau mencari-cari (jalan yang benar), lalu Ia memberikan hidayah petunjuk (dengan wahyu - Al-Quran)?"
  },
  {
    "surah": 93,
    "ayat": 8,
    "terjemahan": "Dan didapatiNya engkau miskin, lalu Ia memberikan kekayaan?"
  },
  {
    "surah": 93,
    "ayat": 9,
    "terjemahan": "Oleh itu, adapun anak yatim maka janganlah engkau berlaku kasar terhadapnya,"
  },
  {
    "surah": 93,
    "ayat": 10,
    "terjemahan": "Adapun orang yang meminta (bantuan pimpinan) maka janganlah engkau tengking herdik;"
  },
  {
    "surah": 93,
    "ayat": 11,
    "terjemahan": "Adapun nikmat Tuhanmu, maka hendaklah engkau sebut-sebutkan (dan zahirkan) sebagai bersyukur kepadaNya."
  },
  {
    "surah": 94,
    "ayat": 1,
    "terjemahan": "Bukankah Kami telah melapangkan bagimu: dadamu (wahai Muhammad serta mengisinya dengan iman dan hidayah petunjuk) ?"
  },
  {
    "surah": 94,
    "ayat": 2,
    "terjemahan": "Dan Kami telah meringankan daripadamu: bebanmu (menyiarkan Islam) -"
  },
  {
    "surah": 94,
    "ayat": 3,
    "terjemahan": "Yang memberati tanggunganmu, (dengan memberikan berbagai kemudahan dalam melaksanakannya)?"
  },
  {
    "surah": 94,
    "ayat": 4,
    "terjemahan": "Dan Kami telah meninggikan bagimu: sebutan namamu (dengan mengurniakan pangkat Nabi dan berbagai kemuliaan)?"
  },
  {
    "surah": 94,
    "ayat": 5,
    "terjemahan": "Oleh itu, maka (tetapkanlah kepercayaanmu) bahawa sesungguhnya tiap-tiap kesukaran disertai kemudahan,"
  },
  {
    "surah": 94,
    "ayat": 6,
    "terjemahan": "(Sekali lagi ditegaskan): bahawa sesungguhnya tiap-tiap kesukaran disertai kemudahan."
  },
  {
    "surah": 94,
    "ayat": 7,
    "terjemahan": "Kemudian apabila engkau telah selesai (daripada sesuatu amal soleh), maka bersungguh-sungguhlah engkau berusaha (mengerjakan amal soleh yang lain),"
  },
  {
    "surah": 94,
    "ayat": 8,
    "terjemahan": "Dan kepada Tuhanmu sahaja hendaklah engkau memohon (apa yang engkau gemar dan ingini)."
  },
  {
    "surah": 95,
    "ayat": 1,
    "terjemahan": "Demi buah Tiin dan Zaitun,"
  },
  {
    "surah": 95,
    "ayat": 2,
    "terjemahan": "Dan Gunung Tursina,"
  },
  {
    "surah": 95,
    "ayat": 3,
    "terjemahan": "Serta negeri (Makkah) yang aman ini, -"
  },
  {
    "surah": 95,
    "ayat": 4,
    "terjemahan": "Sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya (dan berkelengkapan sesuai dengan keadaannya)."
  },
  {
    "surah": 95,
    "ayat": 5,
    "terjemahan": "Kemudian (jika ia panjang umur sehingga tua atau menyalahgunakan kelengkapan itu), Kami kembalikan dia ke serendah-rendah peringkat orang-orang yang rendah,"
  },
  {
    "surah": 95,
    "ayat": 6,
    "terjemahan": "Kecuali orang-orang yang beriman dan beramal soleh, maka mereka beroleh pahala yang tidak putus-putus."
  },
  {
    "surah": 95,
    "ayat": 7,
    "terjemahan": "(Jika demikian kekuasaanKu), maka apa pula yang menjadikan engkau seorang pendusta, (berkata tidak benar) mengenai hari pembalasan, sesudah (ternyata dalil-dalil yang membuktikan kekuasaanKu mengadakan hari pembalasan) itu?"
  },
  {
    "surah": 95,
    "ayat": 8,
    "terjemahan": "Bukankah Allah (yang demikian kekuasaanNya) seadil-adil Hakim?"
  },
  {
    "surah": 96,
    "ayat": 1,
    "terjemahan": "Bacalah (wahai Muhammad) dengan nama Tuhanmu yang menciptakan (sekalian makhluk),"
  },
  {
    "surah": 96,
    "ayat": 2,
    "terjemahan": "Ia menciptakan manusia dari sebuku darah beku;"
  },
  {
    "surah": 96,
    "ayat": 3,
    "terjemahan": "Bacalah, dan Tuhanmu Yang Maha Pemurah, -"
  },
  {
    "surah": 96,
    "ayat": 4,
    "terjemahan": "Yang mengajar manusia melalui pena dan tulisan, -"
  },
  {
    "surah": 96,
    "ayat": 5,
    "terjemahan": "Ia mengajarkan manusia apa yang tidak diketahuinya."
  },
  {
    "surah": 96,
    "ayat": 6,
    "terjemahan": "Ingatlah! Sesungguhnya jenis manusia tetap melampaui batas (yang sepatutnya atau yang sewajibnya),"
  },
  {
    "surah": 96,
    "ayat": 7,
    "terjemahan": "Dengan sebab ia melihat dirinya sudah cukup apa yang dihajatinya."
  },
  {
    "surah": 96,
    "ayat": 8,
    "terjemahan": "(Ingatlah) sesungguhnya kepada Tuhanmu lah tempat kembali (untuk menerima balasan)."
  },
  {
    "surah": 96,
    "ayat": 9,
    "terjemahan": "Adakah engkau nampak (baiknya) orang yang melarang (dan menghalang) -"
  },
  {
    "surah": 96,
    "ayat": 10,
    "terjemahan": "Seorang hamba Allah apabila ia mengerjakan sembahyang?"
  },
  {
    "surah": 96,
    "ayat": 11,
    "terjemahan": "Adakah engkau nampak (buruknya) jika ia berada di atas jalan yang betul? -"
  },
  {
    "surah": 96,
    "ayat": 12,
    "terjemahan": "Atau ia menyuruh orang bertaqwa (jangan melakukan syirik)?"
  },
  {
    "surah": 96,
    "ayat": 13,
    "terjemahan": "Adakah engkau nampak (terlepasnya dari azab) jika ia mendustakan (apa yang disampaikan oleh Nabi Muhammad kepadanya) serta ia berpaling ingkar?"
  },
  {
    "surah": 96,
    "ayat": 14,
    "terjemahan": "Tidakkah ia mengetahui bahawa sesungguhnya Allah melihat (segala amal perbuatannya dan membalasnya)?"
  },
  {
    "surah": 96,
    "ayat": 15,
    "terjemahan": "Jangan sekali-kali berlaku derhaka! Demi sesungguhnya jika ia tidak berhenti (dari perbuatannya yang buruk itu), nescaya Kami akan menyentap ubun-ubunnya (dan menyeretnya ke dalam neraka), -"
  },
  {
    "surah": 96,
    "ayat": 16,
    "terjemahan": "Ubun-ubun (orang) yang berdusta, yang bersalah."
  },
  {
    "surah": 96,
    "ayat": 17,
    "terjemahan": "Kemudian biarlah ia memanggil kumpulannya (untuk menyelamatkannya),"
  },
  {
    "surah": 96,
    "ayat": 18,
    "terjemahan": "Kami pula akan memanggil malaikat Zabaniyah (untuk menyeksanya)!"
  },
  {
    "surah": 96,
    "ayat": 19,
    "terjemahan": "Ingatlah! Janganlah engkau (wahai Muhammad) menurut kehendaknya, dan (sebaliknya) sujudlah dan dampingkanlah dirimu kepada Allah (dengan taat dan beramal soleh)!"
  },
  {
    "surah": 97,
    "ayat": 1,
    "terjemahan": "Sesungguhnya Kami telah menurunkan (Al-Quran) ini pada Malam Lailatul-Qadar,"
  },
  {
    "surah": 97,
    "ayat": 2,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui apa dia kebesaran Malam Lailatul-Qadar itu?"
  },
  {
    "surah": 97,
    "ayat": 3,
    "terjemahan": "Malam Lailatul-Qadar lebih baik daripada seribu bulan."
  },
  {
    "surah": 97,
    "ayat": 4,
    "terjemahan": "Pada Malam itu, turun malaikat dan Jibril dengan izin Tuhan mereka, kerana membawa segala perkara (yang ditakdirkan berlakunya pada tahun yang berikut);"
  },
  {
    "surah": 97,
    "ayat": 5,
    "terjemahan": "Sejahteralah Malam (yang berkat) itu hingga terbit fajar!"
  },
  {
    "surah": 98,
    "ayat": 1,
    "terjemahan": "Orang-orang yang kafir dari Ahli Kitab (Yahudi dan Nasrani) serta orang-orang musyrik, tidak akan terlepas (dari kepercayaan dan amalan masing-masing) sehingga datang kepada mereka bukti yang jelas nyata, -"
  },
  {
    "surah": 98,
    "ayat": 2,
    "terjemahan": "Iaitu seorang Rasul dari Allah yang membacakan (kepada mereka) Lembaran-lembaran Suci,"
  },
  {
    "surah": 98,
    "ayat": 3,
    "terjemahan": "Terkandung di dalamnya pelajaran-pelajaran dan hukum-hukum yang benar."
  },
  {
    "surah": 98,
    "ayat": 4,
    "terjemahan": "Dan orang-orang (Yahudi dan Nasrani) yang diberi Kitab (Taurat dan Injil) itu, tidak berpecah-belah melainkan setelah datang kepada mereka bukti yang jelas nyata."
  },
  {
    "surah": 98,
    "ayat": 5,
    "terjemahan": "Pada hal mereka tidak diperintahkan melainkan supaya menyembah Allah dengan mengikhlaskan ibadat kepadaNya, lagi tetap teguh di atas tauhid; dan supaya mereka mendirikan sembahyang serta memberi zakat. Dan yang demikian itulah Ugama yang benar."
  },
  {
    "surah": 98,
    "ayat": 6,
    "terjemahan": "Sesungguhnya orang-orang yang kafir dari Ahli Kitab dan orang-orang musyrik itu akan ditempatkan di dalam neraka Jahannam, kekalah mereka di dalamnya. Mereka itulah sejahat-jahat makhluk."
  },
  {
    "surah": 98,
    "ayat": 7,
    "terjemahan": "Seungguhnya orang-orang yang beriman dan beramal soleh, mereka itulah sebaik-baik makhluk."
  },
  {
    "surah": 98,
    "ayat": 8,
    "terjemahan": "Balasan mereka di sisi Tuhannya ialah syurga Adn (tempat tinggal yang tetap), yang mengalir di bawahnya beberapa sungai; kekalah mereka di dalamnya selama-lamanya; Allah reda akan mereka dan merekapun reda (serta bersyukur) akan nikmat pemberianNya. Balasan yang demikian itu untuk orang-orang yang takut (melanggar perintah) Tuhannya."
  },
  {
    "surah": 99,
    "ayat": 1,
    "terjemahan": "Apabila bumi digegarkan dengan gegaran yang sedahsyat-dahsyatnya,"
  },
  {
    "surah": 99,
    "ayat": 2,
    "terjemahan": "Serta bumi itu mengeluarkan segala isinya,"
  },
  {
    "surah": 99,
    "ayat": 3,
    "terjemahan": "Dan berkatalah manusia (dengan perasaan gerun); \"Apa yang sudah terjadi kepada bumi?\""
  },
  {
    "surah": 99,
    "ayat": 4,
    "terjemahan": "Pada hari itu bumipun menceritakan khabar beritanya:"
  },
  {
    "surah": 99,
    "ayat": 5,
    "terjemahan": "Bahawa Tuhanmu telah memerintahnya (berlaku demikian)."
  },
  {
    "surah": 99,
    "ayat": 6,
    "terjemahan": "Pada hari itu manusia akan keluar berselerak (dari kubur masing-masing) - untuk diperlihatkan kepada mereka (balasan) amal-amal mereka."
  },
  {
    "surah": 99,
    "ayat": 7,
    "terjemahan": "Maka sesiapa berbuat kebajikan seberat zarah, nescaya akan dilihatnya (dalam surat amalnya)!"
  },
  {
    "surah": 99,
    "ayat": 8,
    "terjemahan": "Dan sesiapa berbuat kejahatan seberat zarah, nescaya akan dilihatnya (dalam surat amalnya)!"
  },
  {
    "surah": 100,
    "ayat": 1,
    "terjemahan": "Demi Kuda Perang yang tangkas berlari dengan kedengaran kencang nafasnya,"
  },
  {
    "surah": 100,
    "ayat": 2,
    "terjemahan": "Serta mencetuskan api dari telapak kakinya,"
  },
  {
    "surah": 100,
    "ayat": 3,
    "terjemahan": "Dan meluru menyerbu musuh pada waktu subuh,"
  },
  {
    "surah": 100,
    "ayat": 4,
    "terjemahan": "Sehingga menghamburkan debu pada waktu itu,"
  },
  {
    "surah": 100,
    "ayat": 5,
    "terjemahan": "Lalu menggempur ketika itu di tengah-tengah kumpulan musuh;"
  },
  {
    "surah": 100,
    "ayat": 6,
    "terjemahan": "Sesungguhnya manusia sangat tidak bersyukur akan nikmat Tuhannya."
  },
  {
    "surah": 100,
    "ayat": 7,
    "terjemahan": "Dan sesungguhnya ia (dengan bawaannya) menerangkan dengan jelas keadaan yang demikian;"
  },
  {
    "surah": 100,
    "ayat": 8,
    "terjemahan": "Dan sesungguhnya ia melampau sangat sayangkan harta (secara tamak haloba)."
  },
  {
    "surah": 100,
    "ayat": 9,
    "terjemahan": "(Patutkah ia bersikap demikian?) Tidakkah ia mengetahui (bagaimana keadaan) ketika dibongkarkan segala yang ada dalam kubur?"
  },
  {
    "surah": 100,
    "ayat": 10,
    "terjemahan": "Dan dikumpul serta didedahkan segala yang terpendam dalam dada?"
  },
  {
    "surah": 100,
    "ayat": 11,
    "terjemahan": "Sesungguhnya Tuhan mereka Maha Mengetahui dengan mendalam tentang (balasan yang diberikanNya kepada) mereka - pada hari itu."
  },
  {
    "surah": 101,
    "ayat": 1,
    "terjemahan": "Hari yang menggemparkan,"
  },
  {
    "surah": 101,
    "ayat": 2,
    "terjemahan": "Apa dia hari yang menggemparkan itu?"
  },
  {
    "surah": 101,
    "ayat": 3,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui kedahsyatan hari yang menggemparkan itu? -"
  },
  {
    "surah": 101,
    "ayat": 4,
    "terjemahan": "(Hari itu ialah: hari kiamat), hari manusia menjadi seperti kelkatu yang terbang berkeliaran,"
  },
  {
    "surah": 101,
    "ayat": 5,
    "terjemahan": "Dan gunung-ganang menjadi seperti bulu yang dibusar berterbangan."
  },
  {
    "surah": 101,
    "ayat": 6,
    "terjemahan": "Setelah berlaku demikian, maka (manusia akan diberikan tempatnya menurut amal masing-masing); adapun orang yang berat timbangan amal baiknya, -"
  },
  {
    "surah": 101,
    "ayat": 7,
    "terjemahan": "Maka ia berada dalam kehidupan yang senang lenang."
  },
  {
    "surah": 101,
    "ayat": 8,
    "terjemahan": "Sebaliknya orang yang ringan timbangan amal baiknya, -"
  },
  {
    "surah": 101,
    "ayat": 9,
    "terjemahan": "Maka tempat kembalinya ialah \"Haawiyah\""
  },
  {
    "surah": 101,
    "ayat": 10,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui, apa dia \"Haawiyah\" itu?"
  },
  {
    "surah": 101,
    "ayat": 11,
    "terjemahan": "(Haawiyah itu ialah): api yang panas membakar."
  },
  {
    "surah": 102,
    "ayat": 1,
    "terjemahan": "Kamu telah dilalaikan (daripada mengerjakan amal bakti) oleh perbuatan berlumba-lumba untuk mendapat dengan sebanyak-banyaknya (harta benda, anak-pinak pangkat dan pengaruh), -"
  },
  {
    "surah": 102,
    "ayat": 2,
    "terjemahan": "Sehingga kamu masuk kubur."
  },
  {
    "surah": 102,
    "ayat": 3,
    "terjemahan": "Jangan sekali-kali (bersikap demikian)! Kamu akan mengetahui kelak (akibatnya yang buruk semasa hendak mati)!"
  },
  {
    "surah": 102,
    "ayat": 4,
    "terjemahan": "Sekali lagi (diingatkan): jangan sekali-kali (kamu bersikap demikian)! Kamu akan mengetahui kelak akibatnya yang buruk pada hari kiamat)!"
  },
  {
    "surah": 102,
    "ayat": 5,
    "terjemahan": "Demi sesungguhnya! Kalaulah kamu mengetahui - (apa yang kamu akan hadapi) - dengan pengetahuan yang yakin, (tentulah kamu akan mengerjakan perkara-perkara yang menjadi bekalan kamu untuk hari akhirat)."
  },
  {
    "surah": 102,
    "ayat": 6,
    "terjemahan": "(Ingatlah) demi sesungguhnya! - Kamu akan melihat neraka yang marak menjulang."
  },
  {
    "surah": 102,
    "ayat": 7,
    "terjemahan": "Selepas itu - demi sesungguhnya! - kamu (wahai orang-orang yang derhaka) akan melihatnya dengan penglihatan yang yakin (semasa kamu dilemparkan ke dalamnya)!"
  },
  {
    "surah": 102,
    "ayat": 8,
    "terjemahan": "Selain dari itu, sesungguhnya kamu akan ditanya pada hari itu, tentang segala nikmat (yang kamu telah menikmatinya)!"
  },
  {
    "surah": 103,
    "ayat": 1,
    "terjemahan": "Demi Masa!"
  },
  {
    "surah": 103,
    "ayat": 2,
    "terjemahan": "Sesungguhnya manusia itu dalam kerugian -"
  },
  {
    "surah": 103,
    "ayat": 3,
    "terjemahan": "Kecuali orang-orang yang beriman dan beramal soleh, dan mereka pula berpesan-pesan dengan kebenaran serta berpesan-pesan dengan sabar."
  },
  {
    "surah": 104,
    "ayat": 1,
    "terjemahan": "Kecelakaan besar bagi tiap-tiap pencaci, pengeji,"
  },
  {
    "surah": 104,
    "ayat": 2,
    "terjemahan": "Yang mengumpulkan harta dan berulang-ulang menghitung kekayaannya;"
  },
  {
    "surah": 104,
    "ayat": 3,
    "terjemahan": "Ia menyangka bahawa hartanya itu dapat mengekalkannya (dalam dunia ini)!"
  },
  {
    "surah": 104,
    "ayat": 4,
    "terjemahan": "Tidak! Sesungguhnya dia akan dicampakkan ke dalam \"Al-Hutamah\"."
  },
  {
    "surah": 104,
    "ayat": 5,
    "terjemahan": "Dan apa jalannya engkau dapat mengetahui, apa dia \"Al-Hutamah\" itu?"
  },
  {
    "surah": 104,
    "ayat": 6,
    "terjemahan": "(Al-Hutamah) ialah api Allah yang dinyalakan (dengan perintahNya), -"
  },
  {
    "surah": 104,
    "ayat": 7,
    "terjemahan": "Yang naik menjulang ke hati;"
  },
  {
    "surah": 104,
    "ayat": 8,
    "terjemahan": "Sesungguhnnya api neraka itu ditutup rapat atas mereka."
  },
  {
    "surah": 104,
    "ayat": 9,
    "terjemahan": "(Mereka terikat di situ) pada batang-batang palang yang melintang panjang."
  },
  {
    "surah": 105,
    "ayat": 1,
    "terjemahan": "Tidakkah engkau mengetahui bagaimana Tuhanmu telah melakukan kepada angkatan tentera (yang dipimpin oleh pembawa) Gajah, (yang hendak meruntuhkan Kaabah)?"
  },
  {
    "surah": 105,
    "ayat": 2,
    "terjemahan": "Bukankah Tuhanmu telah menjadikan rancangan jahat mereka dalam keadaan yang rugi dan memusnahkan mereka?"
  },
  {
    "surah": 105,
    "ayat": 3,
    "terjemahan": "Dan Ia telah menghantarkan kepada mereka (rombongan) burung berpasuk-pasukan, -"
  },
  {
    "surah": 105,
    "ayat": 4,
    "terjemahan": "Yang melontar mereka dengan batu-batu dari sejenis tanah yang dibakar keras, -"
  },
  {
    "surah": 105,
    "ayat": 5,
    "terjemahan": "Lalu Ia menjadikan mereka hancur berkecai seperti daun-daun kayu yang dimakan ulat."
  },
  {
    "surah": 106,
    "ayat": 1,
    "terjemahan": "Kerana kebiasaan aman tenteram kaum Quraisy (penduduk Makkah)"
  },
  {
    "surah": 106,
    "ayat": 2,
    "terjemahan": "(laitu) kebiasaan aman tenteram perjalanan mereka (menjalankan perniagaan) pada musim sejuk (ke negeri Yaman), dan pada musim panas (ke negeri Syam),"
  },
  {
    "surah": 106,
    "ayat": 3,
    "terjemahan": "Maka hendaklah mereka menyembah Tuhan yang menguasai rumah (Kaabah) ini,"
  },
  {
    "surah": 106,
    "ayat": 4,
    "terjemahan": "Tuhan yang memberi mereka penghidupan: menyelamatkan mereka dari kelaparan, dan mengamankan mereka dari ketakutan."
  },
  {
    "surah": 107,
    "ayat": 1,
    "terjemahan": "Tahukah engkau akan orang yang mendustakan ugama (meliputi hari pembalasan)?"
  },
  {
    "surah": 107,
    "ayat": 2,
    "terjemahan": "Orang itu ialah yang menindas serta berlaku zalim kepada anak yatim,"
  },
  {
    "surah": 107,
    "ayat": 3,
    "terjemahan": "Dan ia tidak menggalakkan untuk memberi makanan yang berhak diterima oleh orang miskin."
  },
  {
    "surah": 107,
    "ayat": 4,
    "terjemahan": "(Kalau orang yang demikian dikira dari bilangan orang-orang yang mendustakan ugama), maka kecelakaan besar bagi orang-orang Ahli Sembahyang -"
  },
  {
    "surah": 107,
    "ayat": 5,
    "terjemahan": "(laitu) mereka yang berkeadaan lalai daripada menyempurnakan sembahyangnya;"
  },
  {
    "surah": 107,
    "ayat": 6,
    "terjemahan": "(Juga bagi) orang-orang yang berkeadaan riak (bangga diri dalam ibadat dan bawaannya),"
  },
  {
    "surah": 107,
    "ayat": 7,
    "terjemahan": "Dan orang-orang yang tidak memberi sedikit pertolongan (kepada orang yang berhak mendapatnya)."
  },
  {
    "surah": 108,
    "ayat": 1,
    "terjemahan": "Sesungguhnya Kami telah mengurniakan kepadamu (wahai Muhammad) kebaikan yang banyak (di dunia dan di akhirat)."
  },
  {
    "surah": 108,
    "ayat": 2,
    "terjemahan": "Oleh itu, kerjakanlah sembahyang kerana Tuhanmu semata-mata, dan sembelihlah korban (sebagai bersyukur)."
  },
  {
    "surah": 108,
    "ayat": 3,
    "terjemahan": "Sesungguhnya orang yang bencikan engkau, Dia lah yang terputus (dari mendapat sebarang perkara yang diingininya)."
  },
  {
    "surah": 109,
    "ayat": 1,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Hai orang-orang kafir!"
  },
  {
    "surah": 109,
    "ayat": 2,
    "terjemahan": "\"Aku tidak akan menyembah apa yang kamu sembah."
  },
  {
    "surah": 109,
    "ayat": 3,
    "terjemahan": "\"Dan kamu tidak mahu menyembah (Allah) yang aku sembah."
  },
  {
    "surah": 109,
    "ayat": 4,
    "terjemahan": "\"Dan aku tidak akan beribadat secara kamu beribadat."
  },
  {
    "surah": 109,
    "ayat": 5,
    "terjemahan": "\"Dan kamu pula tidak mahu beribadat secara aku beribadat."
  },
  {
    "surah": 109,
    "ayat": 6,
    "terjemahan": "\"Bagi kamu ugama kamu, dan bagiku ugamaku\"."
  },
  {
    "surah": 110,
    "ayat": 1,
    "terjemahan": "Apabila datang pertolongan Allah dan kemenangan (semasa engkau wahai Muhammad berjaya menguasai negeri Makkah), -"
  },
  {
    "surah": 110,
    "ayat": 2,
    "terjemahan": "Dan engkau melihat manusia masuk dalam ugama Allah beramai-ramai, -"
  },
  {
    "surah": 110,
    "ayat": 3,
    "terjemahan": "Maka ucapkanlah tasbih dengan memuji Tuhanmu dan mintalah ampun kepadaNya, sesungguhnya Dia amat menerima taubat."
  },
  {
    "surah": 111,
    "ayat": 1,
    "terjemahan": "Binasalah kedua-dua tangan Abu lahab, dan binasalah ia bersama!"
  },
  {
    "surah": 111,
    "ayat": 2,
    "terjemahan": "Hartanya dan segala yang diusahakannya, tidak dapat menolongnya."
  },
  {
    "surah": 111,
    "ayat": 3,
    "terjemahan": "Ia akan menderita bakaran api neraka yang marak menjulang."
  },
  {
    "surah": 111,
    "ayat": 4,
    "terjemahan": "Dan juga isterinya, seorang perempuan pemunggah kayu api. -"
  },
  {
    "surah": 111,
    "ayat": 5,
    "terjemahan": "Di lehernya sejenis tali, dari tali-tali yang dipintal."
  },
  {
    "surah": 112,
    "ayat": 1,
    "terjemahan": "Katakanlah (wahai Muhammad): \"(Tuhanku) ialah Allah Yang Maha Esa;"
  },
  {
    "surah": 112,
    "ayat": 2,
    "terjemahan": "\"Allah Yang menjadi tumpuan sekalian makhluk untuk memohon sebarang hajat;"
  },
  {
    "surah": 112,
    "ayat": 3,
    "terjemahan": "\"Ia tiada beranak, dan Ia pula tidak diperanakkan;"
  },
  {
    "surah": 112,
    "ayat": 4,
    "terjemahan": "\"Dan tidak ada sesiapapun yang serupa denganNya\"."
  },
  {
    "surah": 113,
    "ayat": 1,
    "terjemahan": "Katakanlah (wahai Muhammad); \"Aku berlindung kepada (Allah) Tuhan yang menciptakan sekalian makhluk,"
  },
  {
    "surah": 113,
    "ayat": 2,
    "terjemahan": "\"Dari bencana makhluk-makhluk yang Ia ciptakan;"
  },
  {
    "surah": 113,
    "ayat": 3,
    "terjemahan": "\"Dan dari bahaya gelap apabila ia masuk;"
  },
  {
    "surah": 113,
    "ayat": 4,
    "terjemahan": "\"Dan dari kejahatan makhluk-makhluk yang menghembus-hembus pada simpulan-simpulan (dan ikatan-ikatan);"
  },
  {
    "surah": 113,
    "ayat": 5,
    "terjemahan": "\"Dan dari kejahatan orang yang dengki apabila ia melakukan dengkinya\"."
  },
  {
    "surah": 114,
    "ayat": 1,
    "terjemahan": "Katakanlah (wahai Muhammad): \"Aku berlindung kepada (Allah) Pemulihara sekalian manusia."
  },
  {
    "surah": 114,
    "ayat": 2,
    "terjemahan": "\"Yang Menguasai sekalian manusia,"
  },
  {
    "surah": 114,
    "ayat": 3,
    "terjemahan": "\"Tuhan yang berhak disembah oleh sekalian manusia,"
  },
  {
    "surah": 114,
    "ayat": 4,
    "terjemahan": "\"Dari kejahatan pembisik penghasut yang timbul tenggelam, -"
  },
  {
    "surah": 114,
    "ayat": 5,
    "terjemahan": "\"Yang melemparkan bisikan dan hasutannya ke dalam hati manusia, -"
  },
  {
    "surah": 114,
    "ayat": 6,
    "terjemahan": "\"(Iaitu pembisik dan penghasut) dari kalangan jin dan manusia\"."
  }
]
